[
  {
    "description": "At EMF it's easy to see lots of cool things and think you \"that's awesome, but I couldn't possibly do that!\": this talk is about how to overcome that feeling and get started in a new domain.\r\n\r\nTwo years ago, despite having not done any woodwork since high school, I decided to turn my hand at building electric guitars; with success enough that people are now commissioning me to make them for them. But to keep such an ambitious project manageable I had to create structure and tools around how I approached getting started and continuing to develop, and find ways to keep myself motivated in the days when it all goes wrong. This talk will review those methods so that you can try and apply them when you go to head off in a new direction yourself.",
    "title": "From Idiot to Imposter: how to get started in a new field",
    "map_link": null,
    "latlon": null,
    "speaker": "Michael Dales",
    "end_date": "2018-09-02 16:00:00",
    "source": "database",
    "end_time": "16:00",
    "type": "talk",
    "slug": "from-idiot-to-imposter-how-to-get-started-in-a-new-field",
    "id": 76,
    "link": "https://www.emfcamp.org/line-up/2018/76",
    "user_id": 438,
    "may_record": true,
    "start_date": "2018-09-02 15:30:00",
    "start_time": "15:30",
    "is_fave": false,
    "venue": "Stage B",
    "conversation_id": "CON-5eff8c30-44b1-495b-b730-2e2ed8254125",
    "member_id": "MEM-71698fe3-495f-496b-b3e9-7a68805c417c"
  },
  {
    "description": "A comprehensive description of good and bad ciders from a technical, simple flavour chemistry, and hardware viewpoint. What different apples do for the taste of a cider, what goes into a real cider, how real cider is made, and then by contrast how cheap cider is made. This talk is based upon four decades of cider making experience growing up on a British small farm.",
    "title": "Making And Understanding Real Cider",
    "map_link": null,
    "latlon": null,
    "speaker": "Jenny List",
    "end_date": "2018-08-31 14:30:00",
    "source": "database",
    "end_time": "14:30",
    "type": "talk",
    "slug": "making-and-understanding-real-cider",
    "id": 107,
    "link": "https://www.emfcamp.org/line-up/2018/107",
    "user_id": 522,
    "may_record": true,
    "start_date": "2018-08-31 14:00:00",
    "start_time": "14:00",
    "is_fave": false,
    "venue": "Stage C",
    "conversation_id": "CON-e834b9bb-afd7-41d8-a9e6-2df9132f6fd8",
    "member_id": "MEM-7e689c0e-7d49-4c16-b014-912ac233dba2"
  },
  {
    "age_range": "Anyone",
    "cost": "",
    "description": "Come and ask the Eventphone & GSM teams anything about the phone network, how they built it, what challenges they had, why X doesn't work or generally ask then stuff about telecoms, GSM SMS and Phone Numbers.\r\n",
    "title": "We Built a Phone Network at EMF - AMA",
    "map_link": null,
    "latlon": null,
    "equipment": "none",
    "speaker": "Sam Machin",
    "end_date": "2018-09-01 22:10:00",
    "source": "database",
    "end_time": "22:10",
    "type": "workshop",
    "slug": "we-built-a-phone-network-at-emf-ama",
    "id": 520,
    "link": "https://www.emfcamp.org/line-up/2018/520",
    "user_id": 1585,
    "may_record": false,
    "start_date": "2018-09-01 21:10:00",
    "start_time": "21:10",
    "is_fave": false,
    "venue": "Workshop 3",
    "conversation_id": "CON-7babd51f-8bee-4c9d-9fe4-714bf462080d",
    "member_id": "MEM-11541704-8a7d-4841-9fbf-12a56b19f6ad"
  },
  {
    "description": "Technology seeks to ease our aging years with humanoid resources to replace care workers and improve our quality of life. But is that the answer for our 'golden' years? How do we plan and prepare for what's ahead? Depending on our genes and our jeans, we could live into our 100s but a lot rides on our perception of ageing and whether we want to do what our parents have done. \r\n\r\nEdye is a social anthropologist who works embedded with our older and oldest generations as they manage the challenges of ageing. Together, they witness success and failure; and they're circumspect about the power of Pepper and whether we even know what we want in our 80s, 90s, 100s and beyond.",
    "title": "Do you really want a robot in your old age?",
    "map_link": null,
    "latlon": null,
    "speaker": "Edye Hoffmann",
    "end_date": "2018-09-01 14:50:00",
    "source": "database",
    "end_time": "14:50",
    "type": "talk",
    "slug": "do-you-really-want-a-robot-in-your-old-age",
    "id": 258,
    "link": "https://www.emfcamp.org/line-up/2018/258",
    "user_id": 1244,
    "may_record": true,
    "start_date": "2018-09-01 14:20:00",
    "start_time": "14:20",
    "is_fave": false,
    "venue": "Stage C",
    "conversation_id": "CON-68986992-646c-4a9a-bd43-e287674bb6a8",
    "member_id": "MEM-d26cce9b-8612-411e-9780-f7cc1425f143"
  },
  {
    "age_range": "14-144",
    "cost": "",
    "description": "The goal of this workshop is to create a comprehensive overview of the UK government and their online services. Ultimately pushing them to better secure their services and thus protecting your privacy.\r\n\r\nAfter a short introduction you'll be surfing the web, finding names, addresses and urls of the UK government and adding them to the map. They will automatically be scanned for basic security. If all is well, they are shown green, otherwise orange or red. Expect a lot of red.\r\n\r\nThe results of our work will be sent to various press agencies in the UK. We hope they start asking questions about the sad state of security. This causes responsible organizations to wake up and adopt better practices, securing your data and privacy. We've seen this work in the Netherlands.\r\n\r\nYou can expect: It's a lot of fun to see the amount of data grow, and more terribleness appear. Club Mate will be provided. The hunt is on!\r\n\r\nRequirements: This workshop is suitable for anyone with basic computer knowledge. Bring your own laptop / tablet / smartphone.\r\n\r\nAll data gathered is published publicly in easy to consume formats. The software running this is fully open source and available on gitlab. You can see an example of the Netherlands: https://faalkaart.nl.",
    "title": "Let's monitor the government - UK Edition",
    "map_link": null,
    "latlon": null,
    "equipment": "A laptop with internet connection and a browser :)",
    "speaker": "Elger / \"Stitch\"",
    "end_date": "2018-09-01 18:40:00",
    "source": "database",
    "end_time": "18:40",
    "type": "workshop",
    "slug": "lets-monitor-the-government-uk-edition",
    "id": 326,
    "link": "https://www.emfcamp.org/line-up/2018/326",
    "user_id": 161,
    "may_record": false,
    "start_date": "2018-09-01 16:40:00",
    "start_time": "16:40",
    "is_fave": false,
    "venue": "Workshop 2",
    "conversation_id": "CON-300b69c6-85aa-44fc-a6c9-92c9549842c5",
    "member_id": "MEM-737db779-c9c1-4a59-aa4f-c66945168c6b"
  },
  {
    "age_range": "12 years and above as long as they are adventurous eaters",
    "cost": "Nominal fee of £2 per person",
    "description": "Mexican food is becoming more and more popular in the UK and the range of restaurant options is expanding, particularly in large cities. However, it is almost certainly true that most people have never had the life-changing experience of tasting a truly authentic Mexican taco. Furthermore, I would imagine that most people would never think of attempting to make one at home, despite the fact that it is such a simple dish.\r\n\r\nAs a keen home-cook, who has lived in Mexico for the past 10 years, I am hoping to share this experience with people with a passion for trying new things.\r\n\r\nI will explain a little behind the theory of what makes a good taco, as well as introduce people to the core elements and constituents.\r\n\r\nThis will primarily be a sensory experience where people will be able to compare \"good\" vs. \"bad\" ingredients, and learn the basics of putting together a simple but delicious taco.",
    "title": "The Art of the Taco",
    "map_link": null,
    "latlon": null,
    "equipment": "",
    "speaker": "Simon Bedford",
    "end_date": "2018-09-01 20:00:00",
    "source": "database",
    "end_time": "20:00",
    "type": "workshop",
    "slug": "the-art-of-the-taco",
    "id": 137,
    "link": "https://www.emfcamp.org/line-up/2018/137",
    "user_id": 555,
    "may_record": false,
    "start_date": "2018-09-01 19:00:00",
    "start_time": "19:00",
    "is_fave": false,
    "venue": "Workshop 2",
    "conversation_id": "CON-4a874954-0f99-4288-9a28-eeeeadd815da",
    "member_id": "MEM-e8115699-c020-4548-a58c-c243732de77f"
  },
  {
    "age_range": "15+ (or old enough to handle power tools)",
    "cost": "£30 Standard horn (More options available)",
    "description": "Alcohol should be consumed sensibly, and the most sensible way I know how to drink is from a horn!\r\n\r\nA drinking horn is a great natural and individual drinking vessel, but can be made even more personal with a hand carved symbol or decoration to make it truly unique.\r\n\r\nIn this workshop, you will be selecting the design you will put on your horn, transfer it onto the horn, use a traditional Viking Dremel to carve the design, then polish and paint it to finish off the horn.\r\n\r\nAfter this workshop, you'll have your horn to enjoy your beer and mead with for the rest of the festival. So try not to make any holes in it!\r\n\r\nIf you really want to go full Viking, then more Viking stuff will be available from SkullVikings at the Cyber Viking village.",
    "title": "Carve your own Viking Drinking Horn!",
    "map_link": null,
    "latlon": null,
    "equipment": "A rotary tool if you have one, but not essential",
    "speaker": "Steve Samuels",
    "end_date": "2018-09-02 13:00:00",
    "source": "database",
    "end_time": "13:00",
    "type": "workshop",
    "slug": "carve-your-own-viking-drinking-horn",
    "id": 540,
    "link": "https://www.emfcamp.org/line-up/2018/540",
    "user_id": 1340,
    "may_record": false,
    "start_date": "2018-09-02 10:00:00",
    "start_time": "10:00",
    "is_fave": false,
    "venue": "Workshop 2",
    "conversation_id": "CON-b5d053a6-dc08-4c29-8b29-2c820dbde600",
    "member_id": "MEM-e2ebc166-04be-40d0-8383-8d5de25bf229"
  },
  {
    "description": "Imogen Heap's MI.MU glove is a gesture based midi instrument. The prototypes have been used by artists across the world including megastar Ariana Grande. Earlier this year Imogen and I met to talk about how inspire the next generation of creative technologists and the result was the Mini.Mu, a glove kit that gets children sewing, wiring, coding and playing a gesture based instrument. \r\n\r\nIn my talk I'll be chatting about maker education, music tech and the importance of smushing up art and technology. I'll be sharing my experience of taking a rough and ready prototype made in my makerspace through to a real product that you can find in real shops. There will also be a short performance with the glove.",
    "title": "Making the Mini.Mu, a sewable, codeable instrument for kids",
    "map_link": null,
    "latlon": null,
    "speaker": "Helen Leigh",
    "end_date": "2018-08-31 20:00:00",
    "source": "database",
    "end_time": "20:00",
    "type": "talk",
    "slug": "making-the-mini-mu-a-sewable-codeable-instrument-for-kids",
    "id": 127,
    "link": "https://www.emfcamp.org/line-up/2018/127",
    "user_id": 547,
    "may_record": true,
    "start_date": "2018-08-31 19:30:00",
    "start_time": "19:30",
    "is_fave": false,
    "venue": "Stage C",
    "conversation_id": "CON-c63a5a16-2bdb-444e-86df-bfcd5762c210",
    "member_id": "MEM-3d2c3027-e4ee-4339-84b1-9121750394cd"
  },
  {
    "description": "Open Bionics is a robotics startup developing assistive devices that enhance the human body. They work with Disney and the team behind Deus Ex to create bionic limbs for amputees from films and games! They bring science fiction to life! Sammy, the co founder, will talk you through how they’re using 3D tech like scanning, modelling, and printing to change lives.",
    "title": "Open Bionics: Turning children with limb differences into bionic superheroes ",
    "map_link": null,
    "latlon": null,
    "speaker": "Sammy",
    "end_date": "2018-09-01 12:50:00",
    "source": "database",
    "end_time": "12:50",
    "type": "talk",
    "slug": "open-bionics-turning-children",
    "id": 433,
    "link": "https://www.emfcamp.org/line-up/2018/433",
    "user_id": 1456,
    "may_record": true,
    "start_date": "2018-09-01 12:20:00",
    "start_time": "12:20",
    "is_fave": false,
    "venue": "Stage C",
    "conversation_id": "CON-ce6d5dee-b95b-4252-8f9a-162a87873962",
    "member_id": "MEM-8723e67c-c18c-45bc-a5a4-83b8c8692290"
  },
  {
    "description": "Falling generally is consider bad. It hurts at best, sometimes fatally. However some folks like to jump out of planes and actively seek to fall even faster. Earlier this year, CBBC wanted to accelerate a TV presenter to the speed of a diving peregrine for the series “Beyond Bionic”, this required extra speed and thus the “Jet Boot” project was born. This talk will cover the technologies we used to help Andy Torbert fall even faster, specifically the use of 3D printing to make the final system a reality, whilst covering some of the challenges of trying to attach jet engines to the human body, not setting anyone on fire, and the potential of jet packs, jet boots and other flying platforms for future transportation (sensible or otherwise!)",
    "title": "Falling Faster Straight Down, or How Taking 3D Printing to New Heights ",
    "map_link": null,
    "latlon": null,
    "speaker": "Mike Curtis-Rouse",
    "end_date": "2018-09-02 11:00:00",
    "source": "database",
    "end_time": "11:00",
    "type": "talk",
    "slug": "falling-faster-straight-down",
    "id": 474,
    "link": "https://www.emfcamp.org/line-up/2018/474",
    "user_id": 1495,
    "may_record": true,
    "start_date": "2018-09-02 10:40:00",
    "start_time": "10:40",
    "is_fave": false,
    "venue": "Stage B",
    "conversation_id": "CON-5e4f9c5d-52a7-4d1d-95ea-f488670799b8",
    "member_id": "MEM-86bc7458-6feb-41ee-8631-232df95b9db2"
  },
  {
    "age_range": "10 upwards. Children under 10 who are keen on programming have had a fun time doing this before, but it's best for them to be with an adult.",
    "cost": "Free",
    "description": "How does a computer like the BBC micro:bit work? Find out by becoming part of the processor for a few hours! In this workshop, all the participants will be able to be part of a giant micro:bit - teams will race against each other to run different programs, each attendee being a part of the machine. There’ll be a small workshop at the beginning and the end so that we demystify the way computers work and understand what we're all doing.\r\n\r\nThis is a good companion to other programming workshops because it turns the concept on its head, with the participants running, not writing, programs.\r\n\r\nIt isn't just about *being* a CPU though, our aim is to optimise one. After running the first program, your team will be able to make changes to the CPU's arrangement and operation to optimise yourselves. If you've ever asked yourself \"what does it mean to be part of a 5-stage pipeline?\" or thought \"Can I try branch prediction today?\" then this is definitely the workshop for you. If you don't know what those things are, then this is the place to learn what it means and have some fun.",
    "title": "Be a Computer! Demystifying assembly language and CPUs",
    "map_link": null,
    "latlon": null,
    "equipment": "Nothing, just a sense of computing adventure.",
    "speaker": "Jonny Austin",
    "end_date": "2018-09-01 20:50:00",
    "source": "database",
    "end_time": "20:50",
    "type": "workshop",
    "slug": "be-a-computer-demystifying-assembly-language-and-cpus",
    "id": 149,
    "link": "https://www.emfcamp.org/line-up/2018/149",
    "user_id": 567,
    "may_record": false,
    "start_date": "2018-09-01 18:50:00",
    "start_time": "18:50",
    "is_fave": false,
    "venue": "Workshop 3",
    "conversation_id": "CON-5920b5d6-582e-4243-85bd-58790e2afd5f",
    "member_id": "MEM-d376fe4e-747e-4aca-888b-9521048d6038"
  },
  {
    "description": "Everybody loves blinky LEDs, but what do you do with them once you've got them to not catch fire? A veteran LED addict presents a selection of tips, tricks, and cheats (oh god so many cheats) for getting your project to, well, shine.\r\n\r\n- LED types (RGB, RGBW, RGBWW, WWA, WTF?)\r\n- Getting away with the bare minimum (six sine waves and a bitmap)\r\n- Gamma correction, why and how?\r\n- Easing functions\r\n- Optimisation (cheating)\r\n- Geometry and localisation\r\n- When to random\r\n- How not to random\r\n- An exclusive collection of my personal fuckups",
    "title": "Algorithmic Light Art: How To Not Suck",
    "map_link": null,
    "latlon": null,
    "speaker": "Cass May",
    "end_date": "2018-08-31 17:00:00",
    "source": "database",
    "end_time": "17:00",
    "type": "talk",
    "slug": "algorithmic-light-art-how-to-not-suck",
    "id": 376,
    "link": "https://www.emfcamp.org/line-up/2018/376",
    "user_id": 1345,
    "may_record": true,
    "start_date": "2018-08-31 16:10:00",
    "start_time": "16:10",
    "is_fave": false,
    "venue": "Stage B",
    "conversation_id": "CON-7db28487-293e-46fc-9b50-36e7b0b5312c",
    "member_id": "MEM-ede21679-f48c-4112-a3a4-90363d08620d"
  },
  {
    "description": "I am doing a PhD related to stem cells and tissue engineering. I would like to talk about the future of medicine using stem cells to grow off the shelf organs for personalised medicine. This talk will include the benefits of using stem cells to overcome obstacles such as organ donors and rejections, and also the current progress in this field. I will also show some images of projects that I have worked with including decellularisation of animal tissue. In this talk I aim to create a vision in the minds of the audience of the endless possibilities that can be done with stem cells, and a possible near future of a pick-n-mix of organ/tissue design.",
    "title": "The future of medicine",
    "map_link": null,
    "latlon": null,
    "speaker": "Rachel Konichiwakitty",
    "end_date": "2018-08-31 16:40:00",
    "source": "database",
    "end_time": "16:40",
    "type": "talk",
    "slug": "the-future-of-medicine",
    "id": 87,
    "link": "https://www.emfcamp.org/line-up/2018/87",
    "user_id": 400,
    "may_record": true,
    "start_date": "2018-08-31 16:10:00",
    "start_time": "16:10",
    "is_fave": false,
    "venue": "Stage A",
    "conversation_id": "CON-cc4b88e8-79d2-496b-9073-a6b9450c3a2f",
    "member_id": "MEM-1ecd0992-a4a6-4746-9830-99a348ed5264"
  },
  {
    "description": "Almost everyone has traveled on a train, many commute on them every day, but surprisingly few know how signalling and control systems work.\r\n\r\nThe speaker will cover (at a very high level), train detection, train signalling across UK mainline and metro (tube) systems. As the UK mostly invented a lot of this stuff, it's applicable worldwide :)\r\n\r\nCome and be surprised how not-boring railways actually are (and how you could in theory implement a lot of it with arduinos and raspberry pis)!\r\n\r\nIncludes stories such as 'You could basically still repeat the great train robbery today, here's how' and 'Can you stop trains with only an ISM band radio?'. The speaker highly recommends none of this is applied in the real world. It would definitely not be a good idea. Please don't. But it's nice to know some technical details at least.\r\n\r\nThe speaker will assume no previous knowledge and the content is appropriate for all. It would mostly appeal to those who are interested in railways, transport and infrastructure. ",
    "title": "How does railway signalling work?",
    "map_link": null,
    "latlon": null,
    "speaker": "Paul",
    "end_date": "2018-08-31 17:20:00",
    "source": "database",
    "end_time": "17:20",
    "type": "talk",
    "slug": "how-does-railway-signalling-work",
    "id": 19,
    "link": "https://www.emfcamp.org/line-up/2018/19",
    "user_id": 9,
    "may_record": false,
    "start_date": "2018-08-31 16:50:00",
    "start_time": "16:50",
    "is_fave": false,
    "venue": "Stage A",
    "conversation_id": "CON-972b8a66-afd4-46c9-a015-695b5e746fd1",
    "member_id": "MEM-43de8f48-1f38-4f26-9f4b-7fe2a6f57c74"
  },
  {
    "description": "Contemporary software engineering is at a crucial juncture in the evolution as a discipline. We’re professionalising and expanding our abilities, but in doing so we’re encountering dramatic new risks and venturing into new ethical territory. In this way, we share similarities with the expansion of traditional civil engineering during the industrial revolution. In this talk I’ll discuss what lessons can we learn from that industry, and how we can try to avoid making some of the same mistakes. I’ll also give a basic introduction to engineering ethics, discuss some examples of ethical problems from my own career, and explore how we can try to improve our ethical decision-making by incorporating ethical reasoning into the different stages of our work.",
    "title": "Actually, it's about ethics in software engineering",
    "map_link": null,
    "latlon": null,
    "speaker": "Richard Westenra",
    "end_date": "2018-09-02 12:20:00",
    "source": "database",
    "end_time": "12:20",
    "type": "talk",
    "slug": "actually-its-about-ethics-in-software-engineering",
    "id": 63,
    "link": "https://www.emfcamp.org/line-up/2018/63",
    "user_id": 327,
    "may_record": true,
    "start_date": "2018-09-02 11:50:00",
    "start_time": "11:50",
    "is_fave": false,
    "venue": "Stage B",
    "conversation_id": "CON-dff53a49-ad26-462d-ae39-84963de652a7",
    "member_id": "MEM-4af7cf9b-5f80-4f9a-a6c0-10910f53526c"
  },
  {
    "age_range": "All ages",
    "cost": "£5",
    "description": "A hands on workshop (and short presentation) on making clay objects focused mostly on basic hand building methods -\r\nPinch pots, slab building, coiling\r\nParticipants will be given all necessary materials (i.e. clay) and equipment, no prior knowledge required\r\nThere will be opportunity to continue making after the workshop at Nottinghack village and to join there if the workshop becomes full\r\nObjects will be fired in a sawdust firing in a modified metal bin on site during the festival, if you're leaving early it might be possible to arrange to send finished pieces to you\r\nRegister interest (so I know how much clay/sawdust to bring) and find out more via:\r\nhttps://bit.ly/2MoHGOa",
    "title": "An Impostor's Clay Workshop (and firing!)",
    "map_link": null,
    "latlon": null,
    "equipment": "",
    "speaker": "James",
    "end_date": "2018-08-31 15:50:00",
    "source": "database",
    "end_time": "15:50",
    "type": "workshop",
    "slug": "an-impostors-clay-workshop-and-firing",
    "id": 399,
    "link": "https://www.emfcamp.org/line-up/2018/399",
    "user_id": 1362,
    "may_record": false,
    "start_date": "2018-08-31 14:50:00",
    "start_time": "14:50",
    "is_fave": false,
    "venue": "Workshop 2",
    "conversation_id": "CON-190baa1a-277a-40af-a0d6-6bea8b445cb1",
    "member_id": "MEM-7584eba7-47ae-4bcb-8788-bb62b7ad2aed"
  },
  {
    "description": "We were legally banned from using encryption on our computers, and were required to email the police every time we purchased a new computer, due to a “Serious Crime Prevention Order” lasting 5 years, which expired recently. Additionally, we had to email the police our exact whereabouts, and initially they tried to put in a condition that we had to send them a letter every time we used \"the cloud\". The order was given to us by a Crown Court judge after we were sentenced in a hacking case in the UK. We will discuss the experience, and our interactions with the police during these 5 years.",
    "title": "Banned from encrypting",
    "map_link": null,
    "latlon": null,
    "speaker": "Mustafa Al-Bassam and Jake Davis",
    "end_date": "2018-09-01 15:00:00",
    "source": "database",
    "end_time": "15:00",
    "type": "talk",
    "slug": "banned-from-encrypting",
    "id": 393,
    "link": "https://www.emfcamp.org/line-up/2018/393",
    "user_id": 1140,
    "may_record": true,
    "start_date": "2018-09-01 14:30:00",
    "start_time": "14:30",
    "is_fave": false,
    "venue": "Stage A",
    "conversation_id": "CON-b447af6e-4c76-429e-bb9d-c5d7c3dfa542",
    "member_id": "MEM-8e96eb49-63fc-4bf9-bec5-e38e806f4823"
  },
  {
    "age_range": "12+ or anyone who can sew.",
    "cost": "£1",
    "description": "Ever wondered how to make a Dorset button?  Come and make your own wearable art button from a ring, embroidery thread and a pin.  Participants will receive a kit to make a couple of buttons.",
    "title": "Dorset Buttons",
    "map_link": null,
    "latlon": null,
    "equipment": "scissors if you have them",
    "speaker": "Cara McIntosh",
    "end_date": "2018-09-01 17:40:00",
    "source": "database",
    "end_time": "17:40",
    "type": "workshop",
    "slug": "dorset-buttons",
    "id": 429,
    "link": "https://www.emfcamp.org/line-up/2018/429",
    "user_id": 1435,
    "may_record": false,
    "start_date": "2018-09-01 16:40:00",
    "start_time": "16:40",
    "is_fave": false,
    "venue": "Workshop 1",
    "conversation_id": "CON-b8636c1e-a6c7-481e-b37e-a01bef3c6b7b",
    "member_id": "MEM-857c10e2-80ad-44f6-8702-189d976cdec2"
  },
  {
    "description": "Over a ten year period the sculptor James Capper has investigated methods to combine engineering and technology with sculpture to create machines. \r\n\r\nKnown as 'Mobile Sculptures', they record and challenge what we recognise in daily life as machines, in a world that relies heavily on engineering.\r\n\r\nThe talk will cover all areas of the sculptors practice along a slide presentation.\r\n\r\nThe sculpture MOUNTAINEER PROTOTYPE, an 800kg four legged hydraulic prototype walking machine will be at EMF, Capper looks for collaborators in system control software to give the machine a life of its own!\r\n\r\ninstagram\r\n@jamescappersculpture  \r\n",
    "title": "WHY DID YOU MAKE THAT?",
    "map_link": null,
    "latlon": null,
    "speaker": "James Capper",
    "end_date": "2018-09-02 13:40:00",
    "source": "database",
    "end_time": "13:40",
    "type": "talk",
    "slug": "why-did-you-make-that",
    "id": 522,
    "link": "https://www.emfcamp.org/line-up/2018/522",
    "user_id": 1683,
    "may_record": true,
    "start_date": "2018-09-02 13:10:00",
    "start_time": "13:10",
    "is_fave": false,
    "venue": "Stage C",
    "conversation_id": "CON-7376af1d-55f3-4394-bcdf-98b3682f55ad",
    "member_id": "MEM-7ee6e0c5-e573-4bee-8fb2-5364efcfe657"
  },
  {
    "description": "Modern processors are amazing devices: small, fast, low power and getting better with every generation.\r\nBut the most amazing things about modern microprocessors is that they work so incredibly reliably despite all their incredible complexity.\r\n\r\nThis talk is about the battle between complexity and correctness and about how new formal verification tools can be used to help you design higher performance processors that actually work.  I will describe the common optimisations, the bugs that these often introduce and how open source tools such as SAT solvers and bounded model checkers can be used to find these bugs.",
    "title": "What makes processors fail - and how to prevent it",
    "map_link": null,
    "latlon": null,
    "speaker": "Alastair Reid",
    "end_date": "2018-09-02 16:50:00",
    "source": "database",
    "end_time": "16:50",
    "type": "talk",
    "slug": "what-makes-processors-fail-and-how-to-prevent-it",
    "id": 417,
    "link": "https://www.emfcamp.org/line-up/2018/417",
    "user_id": 1400,
    "may_record": true,
    "start_date": "2018-09-02 16:00:00",
    "start_time": "16:00",
    "is_fave": false,
    "venue": "Stage A",
    "conversation_id": "CON-794eeab8-2b5f-4d4d-ad76-f4e2d1d292eb",
    "member_id": "MEM-6fda3a35-05d0-45ba-8342-b6669e50644d"
  },
  {
    "age_range": "15-18 and more.",
    "cost": "Free",
    "description": "Using simple recycled materials such as cardboards, old CD-ROMs, pencils and scissors, we will build an hand made Spectrometer that works with any smartphone.  We will “extract” the electromagnetic spectrum of known sources, commenting it together.\r\nTo build the Spectrometer and process the acquired data, we will use the instructions and the web based software made available by http://publiclab.org/about [1,2].\r\nWe will complement the experience with various scientific details behind the working principles of such device and what could be investigated with it.\r\nParticipants will learn what is light, what is a \"color\", how a color is associated to the actual light spectrum by the human visual system, details about the color filters embedded in cameras and in particular the physics behind the generation of light from light sources.\r\nWe are part of a group founded in 2013 and we studied different STEM subjects and share a common passion for science, technology and dissemination. We recently founded a nonprofit association named NOVA, offering innovative workshops and learning experiences.\r\n\r\n[1] https://publiclab.org/notes/abdul/10-19-2016/foldable-paper-spectrometer-instructions\r\n[2] https://spectralworkbench.org/\r\n",
    "title": "Papercraft Spectrometer",
    "map_link": null,
    "latlon": null,
    "equipment": "Each attendee will need her/his smartphone, one DVD-R and having also her/his computer may be helpful.",
    "speaker": "Linda Polastri, Francesco Forastieri, Enrico Calore, Valentina Rolando",
    "end_date": "2018-09-01 20:00:00",
    "source": "database",
    "end_time": "20:00",
    "type": "workshop",
    "slug": "papercraft-spectrometer",
    "id": 253,
    "link": "https://www.emfcamp.org/line-up/2018/253",
    "user_id": 1240,
    "may_record": false,
    "start_date": "2018-09-01 18:00:00",
    "start_time": "18:00",
    "is_fave": false,
    "venue": "Workshop 1",
    "conversation_id": "CON-b50adf41-e26a-47d6-87d1-c3810b530926",
    "member_id": "MEM-421ba6dc-ced4-4a86-8f7b-8972e738c8f8"
  },
  {
    "age_range": "12+",
    "cost": "",
    "description": "What does health and wellbeing looks like for the future space travellers? There are less than 600  people who have been to space to date. But would space adventures be restricted to the very strictly health screened forward going? Will there be medical autonomy? In this workshop, we co-design the future of health and wellbeing space (and other extreme environments) using speculative design research methods and play tools. This workshop will involve hands-on activities: making and sketching scrappy prototypes/concepts. You do not have to have prior knowledge of anything, we do ask you to park judgements at the front of the tent before you enter the world...",
    "title": "Speculative design of health and wellbeing in space (and other extreme environments) for future adventurers",
    "map_link": null,
    "latlon": null,
    "equipment": "Bring pens, preferably marker pens, scrap paper and other materials",
    "speaker": "Stephanie Pau",
    "end_date": "2018-09-01 21:50:00",
    "source": "database",
    "end_time": "21:50",
    "type": "workshop",
    "slug": "speculative-design-of-health",
    "id": 332,
    "link": "https://www.emfcamp.org/line-up/2018/332",
    "user_id": 1309,
    "may_record": false,
    "start_date": "2018-09-01 20:20:00",
    "start_time": "20:20",
    "is_fave": false,
    "venue": "Workshop 1",
    "conversation_id": "CON-6aa072f0-cba5-4923-9c63-2da1651bb6c2",
    "member_id": "MEM-9bef405e-0322-46a4-959d-b80224d1c874"
  },
  {
    "description": "Spider silk is the strongest natural fibre known to man - stronger than steel, tougher than Kevlar, spider silks act as natural glues, cements, elastic capture webs and physical gills, all to enable spiders to survive and hunt on 6 out of 7 continents on Earth (the exception being icy Antarctica). \r\n\r\nI've spent the last 4 years researching spider silk at the University of Nottingham, learning how spiders have spent the last 386 million years adapting their silk to perform in a massive range of tasks. But now, scientists and industry professionals are looking into how we can adapt spider silk for our own purposes. Want a giant net that can catch falling Jumbos? We're on it. How about a biocompatible silk scaffold to help regrow that broken bone? We're on that too. \r\n\r\nThis is a 30 minute talk on the subject of spider silk aimed at those with an interest in, but no specialist knowledge of, science. There will be some pictures of spiders at the start but should otherwise be friendly for those who are interested but wary of things with eight legs. ",
    "title": "Spider Silk: Hacking Nature's Strongest Fibre",
    "map_link": null,
    "latlon": null,
    "speaker": "Michelle Strickland",
    "end_date": "2018-09-01 11:50:00",
    "source": "database",
    "end_time": "11:50",
    "type": "talk",
    "slug": "spider-silk-hacking-natures-strongest-fibre",
    "id": 357,
    "link": "https://www.emfcamp.org/line-up/2018/357",
    "user_id": 181,
    "may_record": true,
    "start_date": "2018-09-01 11:20:00",
    "start_time": "11:20",
    "is_fave": false,
    "venue": "Stage A",
    "conversation_id": "CON-843169de-29eb-4d1e-9cd8-90c22f676bc6",
    "member_id": "MEM-f298d63e-3262-4dfc-a368-8befbf0dec95"
  },
  {
    "description": "Orbs are located all over the site, hung in lots of locations (aiming for 30). Players use an RFID card to capture the orb for their team, changing the orbs colour. A website shows which team hold which orbs and tracks who is winning, with a live scoreboard in the null sector.\r\n\r\nThis talk is a breakdown of how it all works, the orbs themselves and the game architecture. The hardware inside the orbs, why those parts were selected, and how they interact with each other.  The software design and game architecture, and how all of that flows together.  This will also cover the trials and tribulations of making the game work and building the finished products.",
    "title": "Orbs Game Explained",
    "map_link": null,
    "latlon": null,
    "speaker": "Michael Turner",
    "end_date": "2018-09-02 11:40:00",
    "source": "database",
    "end_time": "11:40",
    "type": "talk",
    "slug": "orbs-game-explained",
    "id": 423,
    "link": "https://www.emfcamp.org/line-up/2018/423",
    "user_id": 353,
    "may_record": true,
    "start_date": "2018-09-02 11:10:00",
    "start_time": "11:10",
    "is_fave": false,
    "venue": "Stage C",
    "conversation_id": "CON-4a50f51b-4f98-4715-82c7-026d79a619a8",
    "member_id": "MEM-ec8f8d7a-28eb-4479-961d-d4388becc71a"
  },
  {
    "age_range": "",
    "cost": "",
    "description": "Haikus are a form of short poetry originating from 17th Century Japan which are characterised by their use of syllable structure, juxtaposition and abstraction of ideas, and references to time and place. \r\n\r\nIn a modern world where communication often comes with character and time limits, we need to find ways to communicate complex ideas in short and more engaging ways.  Fun, easy, and they make everything sound better (and cleverer), Haikus are the answer!   \r\n\r\nThis workshop will give a brief history of Haikus, an overview of the basics, and some fun wordy activities before letting people unleash their vocabularic prowess on emf!  \r\n\r\nHaiku, timeless poetry \r\nJuxtaposing cherry blossom with  \r\nSyllabic framework \r\n\r\nModern nonsense  \r\nDistilled to bite-sized chunks \r\nEnrich souls \r\n\r\nA history, a review, \r\nVocabulary unleashed! \r\nChallenge accepted. ",
    "title": "Haiku: an introduction to Japanese poetry",
    "map_link": null,
    "latlon": null,
    "equipment": "",
    "speaker": "Helen",
    "end_date": "2018-08-31 22:40:00",
    "source": "database",
    "end_time": "22:40",
    "type": "workshop",
    "slug": "haiku-an-introduction-to-japanese-poetry",
    "id": 257,
    "link": "https://www.emfcamp.org/line-up/2018/257",
    "user_id": 1243,
    "may_record": false,
    "start_date": "2018-08-31 21:40:00",
    "start_time": "21:40",
    "is_fave": false,
    "venue": "Workshop 2",
    "conversation_id": "CON-7d36c687-485a-44c3-8fdc-3ae78af600a7",
    "member_id": "MEM-cd1dec0c-cd43-45f2-9798-f8203879cc1c"
  },
  {
    "description": "While exploring her new home, a girl named Coraline discovers a secret door, behind which lies an alternate world that closely mirrors her own but, in many ways, is better. She rejoices in her discovery, until Other Mother and the rest of her parallel family try to keep her there forever. Coraline must use all her resources and bravery to make it back to her own family and life.\r\n\r\nThis beautifully animated piece takes Neil Gaiman’s source material and spins it into a fun and sometimes creepy fairy tale. Director Henry Selick (The Nightmare Before Christmas) creates a series of stop-motion set pieces that equally bewilder and delight. A delicious alternative to saccharine-sweet Hollywood standards.\r\n\r\nMay be unsuitable for younger children.",
    "title": "Coraline (PG) - With supporting short 'The Present'",
    "map_link": null,
    "latlon": null,
    "speaker": "EMF Film Festival",
    "end_date": "2018-08-31 23:13:00",
    "source": "database",
    "end_time": "23:13",
    "type": "performance",
    "slug": "coraline-pg-with-supporting-short-the-present",
    "id": 531,
    "link": "https://www.emfcamp.org/line-up/2018/531",
    "user_id": 282,
    "may_record": false,
    "start_date": "2018-08-31 21:30:00",
    "start_time": "21:30",
    "is_fave": false,
    "venue": "Stage C",
    "conversation_id": "CON-ec709b9e-c432-419d-be2c-1a79fbd2c283",
    "member_id": "MEM-59b148cf-4ba2-42c8-99e9-c06ee55add70"
  },
  {
    "description": "One of us had a shed full of antique pipe organ parts, the other had a Zil-131 dumped in a hedge at the bottom of his garden.\r\n\r\nWe decided to start building a portable, fully playable musical instrument with a variety of audio-visual effects including singing Tesla coils, propane cannons and fog horns. Because why not?\r\n\r\nIt is still very much a work in progress, but in this talk we will explain and demonstrate some of the technical challenges we have faced so far in bringing the project, including its bewildering array of ancient and modern control systems, to life. \r\nWe hope to share our experiences of some of the challenges from our journey so far and hopefully encourage other hobbyists who are considering taking on larger than average projects to just get out there and do it!\r\n",
    "title": "Project Awesome - Two Men, A Pipe Organ and A Russian Army Lorry.",
    "map_link": null,
    "latlon": null,
    "speaker": "Maximus Ironthumper & Mark Tanner",
    "end_date": "2018-09-01 16:50:00",
    "source": "database",
    "end_time": "16:50",
    "type": "talk",
    "slug": "project-awesome-two-men-a-pipe-organ",
    "id": 322,
    "link": "https://www.emfcamp.org/line-up/2018/322",
    "user_id": 1290,
    "may_record": true,
    "start_date": "2018-09-01 16:20:00",
    "start_time": "16:20",
    "is_fave": false,
    "venue": "Stage C",
    "conversation_id": "CON-b899503a-486a-4e59-a495-3bae2fbc819b",
    "member_id": "MEM-4890218c-ffcf-4474-b100-fb3de82a5b5c"
  },
  {
    "description": "The talk gives an overview and describes the built-in support for prototyping, testing, and running Simulink models on Raspberry Pi®. It covers how to build a basic robot that demonstrates autonomous behaviour based on vision from the ground up. The Simulink built-in support for hardware enables hobbyist, engineers and students to access the hardware capabilities of the popular credit-card sized, ARM11 based Raspberry Pi® computer, from within Simulink environment, and deploy for embedded implementation.",
    "title": "Building a robot with MATLAB and Simulink",
    "map_link": null,
    "latlon": null,
    "speaker": "Building a robot with MATLAB and Simulink",
    "end_date": "2018-09-02 17:40:00",
    "source": "database",
    "end_time": "17:40",
    "type": "talk",
    "slug": "building-a-robot-with-matlab-and-simulink",
    "id": 524,
    "link": "https://www.emfcamp.org/line-up/2018/524",
    "user_id": 1760,
    "may_record": true,
    "start_date": "2018-09-02 17:20:00",
    "start_time": "17:20",
    "is_fave": false,
    "venue": "Stage C",
    "conversation_id": "CON-34955de7-81ca-4124-b4be-da38ac6cbbf9",
    "member_id": "MEM-a3802dbc-932d-43c6-853a-2ea919b49bec"
  },
  {
    "description": "At the beginning of 2017 I joined a volunteer Data Science community called Data for Democracy and became involved in a project focused on putting together a submission for a worldwide competition run by UNITE ideas (part of the United Nations) on behalf of the Internal Displacement Monitoring Center (IDMC) in Geneva.\r\n\r\nThe main aim of this challenge was to build a machine learning-driven tool that can automatically identify news and other written articles about ‘Internally Displaced Persons’ (people who have been forced from their homes by conflict or disaster). The platform also had to be able to extract key facts about the underlying events mentioned in the articles.\r\n\r\nI would like share the story of how our team, that had never met in person, put together a platform using almost 100% open source tools, and ultimately won the competition. We were subsequently invited to Geneva to help implement our platform, and we presented it to the broader non-profit community at an event at the International Red Cross museum.\r\n\r\nDuring my talk the areas I would like to address are:\r\n1. My experience of learning & getting involved in data science/programming/machine learning as a non-professional programmer\r\n2. What it was like to work on something constructive with a team from around the world that had never met each other\r\n3. The motivation behind needing this platform and how we put together a winning solution using open source tools",
    "title": "Using Machine Learning for Humanitarian Aims",
    "map_link": null,
    "latlon": null,
    "speaker": "Simon Bedford",
    "end_date": "2018-09-01 15:30:00",
    "source": "database",
    "end_time": "15:30",
    "type": "talk",
    "slug": "using-machine-learning-for-humanitarian-aims",
    "id": 136,
    "link": "https://www.emfcamp.org/line-up/2018/136",
    "user_id": 555,
    "may_record": true,
    "start_date": "2018-09-01 15:00:00",
    "start_time": "15:00",
    "is_fave": false,
    "venue": "Stage C",
    "conversation_id": "CON-b4d68da8-c43e-4175-a652-beea1de728c7",
    "member_id": "MEM-2d0e6243-6e28-439d-9090-0a93f89ee348"
  },
  {
    "age_range": "15+ (or old enough to handle power tools)",
    "cost": "£30 Standard horn (More options available)",
    "description": "Alcohol should be consumed sensibly, and the most sensible way I know how to drink is from a horn!\r\n\r\nA drinking horn is a great natural and individual drinking vessel, but can be made even more personal with a hand carved symbol or decoration to make it truly unique.\r\n\r\nIn this workshop, you will be selecting the design you will put on your horn, transfer it onto the horn, use a traditional Viking Dremel to carve the design, then polish and paint it to finish off the horn.\r\n\r\nAfter this workshop, you'll have your horn to enjoy your beer and mead with for the rest of the festival. So try not to make any holes in it!\r\n\r\nIf you really want to go full Viking, then more Viking stuff will be available from SkullVikings at the Cyber Viking village.",
    "title": "Carve your own Viking Drinking Horn!",
    "map_link": null,
    "latlon": null,
    "equipment": "A rotary tool if you have one, but not essential",
    "speaker": "Steve Samuels",
    "end_date": "2018-09-01 13:00:00",
    "source": "database",
    "end_time": "13:00",
    "type": "workshop",
    "slug": "carve-your-own-viking-drinking-horn",
    "id": 368,
    "link": "https://www.emfcamp.org/line-up/2018/368",
    "user_id": 1340,
    "may_record": false,
    "start_date": "2018-09-01 10:00:00",
    "start_time": "10:00",
    "is_fave": false,
    "venue": "Workshop 4",
    "conversation_id": "CON-d99d279a-498f-4f7e-9c52-20ce89668801",
    "member_id": "MEM-9d7dbac3-1b49-4eb8-a331-5e2875d74ee8"
  },
  {
    "age_range": "16-\\inf",
    "cost": "",
    "description": "Bring your PC and (if possible) an SDR device (RTL-SDR, HackRF, CCC Camp rad1o badge, LimeSDR, USRP) and use it to receive and/or transmit Digital Audio Broadcasting using free and open source software. Big discussions with lots of acronyms about the math behind the modulation are also welcome!\r\n\r\nDAB isn't your fancy and you want to experiment with other broadcasting standards, like FM, DVB, Digital Radio Mondiale? Come instead to the Opendigitalradio village and we can hack something up.",
    "title": "Software-Defined Radio Techniques for DAB Reception and Transmission",
    "map_link": null,
    "latlon": null,
    "equipment": "laptop, sdr device",
    "speaker": "Matthias Braendli",
    "end_date": "2018-09-02 18:40:00",
    "source": "database",
    "end_time": "18:40",
    "type": "workshop",
    "slug": "software-defined-radio-techniques-for-dab-reception",
    "id": 460,
    "link": "https://www.emfcamp.org/line-up/2018/460",
    "user_id": 1355,
    "may_record": false,
    "start_date": "2018-09-02 16:40:00",
    "start_time": "16:40",
    "is_fave": false,
    "venue": "Workshop 4",
    "conversation_id": "CON-ae969d45-2d40-4e04-b787-a055d41b9556",
    "member_id": "MEM-e14f9e95-d204-4cec-a61e-5ae26f35e383"
  },
  {
    "age_range": "any, but kids must be accompanied by adult please",
    "cost": "",
    "description": "I'm a software developer and anthousiastic volunteer with the\r\n Restart Project, co-organising Rosie the Restarter skill shares for women\r\n to learn how to tinker and repair things. \r\n\r\nI want to share a session I run for the Rosies, where we go through some of the basic skills for fixing household electronic appliances with the aim of building up our skills and confidence to actually start fixing.\r\nWe will be looking into safety issues; how to use a multimeter ; and how to wire a plug, or change a fuse.\r\n\r\nIf you are a female or non-binary person and want to share your skills please come forward and help out.\r\nPlease note, this is a very beginners workshop and is aimed at making people feel comfortable learning; not a place for dudes to brag about their knowledge.",
    "title": "Intro to Basic Electronics",
    "map_link": null,
    "latlon": null,
    "equipment": "Their multimeter if they have one and don't know how to use it",
    "speaker": "Haly",
    "end_date": "2018-09-01 12:00:00",
    "source": "database",
    "end_time": "12:00",
    "type": "workshop",
    "slug": "intro-to-basic-electronics",
    "id": 308,
    "link": "https://www.emfcamp.org/line-up/2018/308",
    "user_id": 1283,
    "may_record": false,
    "start_date": "2018-09-01 10:00:00",
    "start_time": "10:00",
    "is_fave": false,
    "venue": "Workshop 2",
    "conversation_id": "CON-6481e96a-d00d-4739-81ed-19e1f681dd0a",
    "member_id": "MEM-655533fa-c2bf-4936-a3d8-de1617142bee"
  },
  {
    "age_range": "6-106",
    "cost": "",
    "description": "In this workshop, get hands on with basic programming and 3D printing by hacking together a colour changing unicorn themed headpiece using Adafruit Circuit Playground Express boards and MakeCode.\r\nThe workshop will explore 3D printing, followed by getting attendees programming with the graphical drag and drop environment, Microsoft Makecode.\r\nYou will program their own light sequences using onboard RGB LEDs (Neopixels) and use onboard sensors to trigger these to light up the 3D printed unicorn horn (attached to a cap on your head).\r\n\r\nThis workshop has been run numerous times at the Northern Ireland Raspberry Jam and is one of our most popular workshops - https://twitter.com/NIRaspJam/status/977562610437632001",
    "title": "Hacking Unicorns - Intro to programming/3D printing",
    "map_link": null,
    "latlon": null,
    "equipment": "Laptop",
    "speaker": "Andrew Mulholland",
    "end_date": "2018-09-01 13:00:00",
    "source": "database",
    "end_time": "13:00",
    "type": "youthworkshop",
    "slug": "hacking-unicorns-intro-to-programming-3d-printing",
    "id": 156,
    "link": "https://www.emfcamp.org/line-up/2018/156",
    "user_id": 102,
    "may_record": false,
    "start_date": "2018-09-01 11:50:00",
    "start_time": "11:50",
    "is_fave": false,
    "venue": "Youth Workshop",
    "conversation_id": "CON-333da1fd-f470-44d1-9dd4-c9ec5f60b582",
    "member_id": "MEM-779c8048-270e-4e4e-b42a-c4df6741eb90"
  },
  {
    "description": "Everything we see in the Universe makes up only a paltry 4% of the total sum. The rest is ‘dark’ – we know remarkably little about it other than what we call ‘Dark Energy’ is causing the expansion of the Universe to accelerate, and ‘Dark Matter’ is holding galaxies like our own Milky Way together. Scientists think that Dark Matter is everywhere, streaming through you as you read this right now! Understanding the nature of Dark Matter is one of the most important scientific missions of our time. In this talk, I will present what evidence we have for the existence of Dark Matter, what we know, and how we go about finding out more about it. Finally, I will entertain the idea of a Dark-Matter-inclusive universe and imagine what having access to such a resource  would imply for humanity. ",
    "title": "Dark-Dark Dark-Matter Matter-Matter",
    "map_link": null,
    "latlon": null,
    "speaker": "Nicolas Angelides",
    "end_date": "2018-08-31 18:00:00",
    "source": "database",
    "end_time": "18:00",
    "type": "talk",
    "slug": "dark-dark-dark-matter-matter-matter",
    "id": 504,
    "link": "https://www.emfcamp.org/line-up/2018/504",
    "user_id": 1581,
    "may_record": true,
    "start_date": "2018-08-31 17:30:00",
    "start_time": "17:30",
    "is_fave": false,
    "venue": "Stage A",
    "conversation_id": "CON-21282481-5412-427d-a791-c69810a27ea2",
    "member_id": "MEM-447265f5-bd2a-4eaf-bc22-65410db05943"
  },
  {
    "age_range": ">12 years old",
    "cost": "£0",
    "description": "Air is what keeps us alive, we breath air every second of our lives but air pollution threatens our health. Know what you breath, come build a monitoring device and visualise your results while learning about sensor hardware.\r\n\t\r\nAttendees require no prior knowledge or skills, other than enthusiasm and a positive attitude!  \r\n\t \r\nWe will run 3 workshops during this session (75min each). \r\n\r\nThe plan of the workshop is as follows:\r\n1. Introduction: Air quality sensors, programming, building a device\r\n2. Presentation of the different components of the air quality device \r\n3. Program it in Python.\r\n4. Retrieve the data from you and your friends’ devices.\r\n5. Visualise and compare your data with others at the camp.\r\n6. Have fun!\r\n\t \r\nAt the end of the day, we will offer 5 lucky participants the opportunity to take an entire sensor device away with them so they can experiment at home.  \r\n\t \r\nWe will generate and make public all the workshop plans, notes, code and hardware sources via GitHub (public) so the workshop is repeatable. ",
    "title": "Air quality sensor devices: Build, program and test.",
    "map_link": null,
    "latlon": null,
    "equipment": "WiFi enabled device capable of editing text (e.g. laptop). Open to all skill ranges.",
    "speaker": "University of Southampton - Computational Engineering and Design",
    "end_date": "2018-08-31 17:10:00",
    "source": "database",
    "end_time": "17:10",
    "type": "workshop",
    "slug": "air-quality-sensor-devices-build-program-and-test",
    "id": 180,
    "link": "https://www.emfcamp.org/line-up/2018/180",
    "user_id": 1173,
    "may_record": false,
    "start_date": "2018-08-31 13:00:00",
    "start_time": "13:00",
    "is_fave": false,
    "venue": "Workshop 1",
    "conversation_id": "CON-7f9db9e3-4aac-48d3-8f7f-4ac5853179d9",
    "member_id": "MEM-43e1c6cb-f90f-4fde-9375-2479d4f15c9e"
  },
  {
    "age_range": "14+",
    "cost": "",
    "description": "Following on from Rich Metson's 2016 talk 'Off Grid:  a game about circumvention tech and hacking,' this workshop is for anyone who wants to come and learn how to mod 'Off Grid' - a hacking game about surveillance and data privacy - and make their own levels and hacks!\r\n\r\nWe'll go over how to useLevelKit to build levels and how to mod or create your own Lua scripts to make your own righteous hacks, devices with abhorrent vulnerabilities, or data types that will alter space-time.\r\n\r\nThe idea being that players, modders and hackers (many of whom caught the hacking bug by messing around with games in the first place) will be able to use the game to tell new and interesting stories about hacking and surveillance, use the platform to build a dialogue around digital activism through play, create new hacking tools in the game, and who knows even drop a 0day or leak a massive political conspiracy or two for real ;P\r\n\r\nCome with a laptop and some unique hacking ideas and Rich will help you with the rest. No previous knowledge of Lua or game development required :D\r\n\r\n**If you want to get a jump start on things before the workshop, please download Unity, Steam, and have a read of 'Getting Started with Levelkit' on our wiki:. http://wiki.offgridthegame.com/index.php?title=Getting_Started_with_the_LevelKit\r\n\r\nYou can watch the 2016 EMF talk here:  https://m.youtube.com/watch?v=suEXrMO6rQo#\r\n\r\nRead what Eurogamer has to say about Off Grid here:  https://www.eurogamer.net/articles/2018-01-15-off-grid-is-about-the-principles-of-hacking\r\n",
    "title": "How to use a moddable hacking game as a tool for digital activism: a modding workshop",
    "map_link": null,
    "latlon": null,
    "equipment": "",
    "speaker": "Rich Metson",
    "end_date": "2018-08-31 23:50:00",
    "source": "database",
    "end_time": "23:50",
    "type": "workshop",
    "slug": "how-to-use-a-moddable-hacking-game-as-a-tool",
    "id": 356,
    "link": "https://www.emfcamp.org/line-up/2018/356",
    "user_id": 577,
    "may_record": false,
    "start_date": "2018-08-31 20:50:00",
    "start_time": "20:50",
    "is_fave": false,
    "venue": "Workshop 1",
    "conversation_id": "CON-f4db6155-4387-41b5-aabf-4c3ddcdeb741",
    "member_id": "MEM-4289f42c-aee6-4749-909d-ce0f3278d6d8"
  },
  {
    "description": "\"It's not natural!\"\r\n\r\nThis phrase is often used to try and justify bigotry and prejudice, especially against people who are LGBTQIA+, polyamorous, or women who don't fit traditional gender roles. But is it true? What do we mean by \"natural\"?\r\n\r\nAs a bisexual, polyamorous biologist and science presenter, Antonia Forster is keen to set the record straight (no pun intended). What behaviours do we see in nature? What's the difference between gender and sex? Can animals be gay, bi or trans? Are there organisms with more, or fewer, than two sexes? Prepare to see the animal kingdom as you've never seen it before...\r\n\r\nThis talk has previously been delivered to 2,000 people at TEDxBristol, and watched by over 14,000 online. Antonia has also spoken at Wilderness Festival, Kew Gardens, the Royal Society, Stanford University, Bristol Pride, the OvalHouse Theatre, BCFm Radio, and BBC Radio Bristol. Antonia has been nominated for the John Maddox prize for \"promoting scientific understanding in the face of hostility\"; and continues to campaign for under-represented groups, especially LGBTQIA+ and women in STEM and science media.",
    "title": "LGBTQIA+ Behaviour in Animals ",
    "map_link": null,
    "latlon": null,
    "speaker": "Antonia Forster",
    "end_date": "2018-09-01 13:50:00",
    "source": "database",
    "end_time": "13:50",
    "type": "talk",
    "slug": "lgbtqia-behaviour-in-animals",
    "id": 405,
    "link": "https://www.emfcamp.org/line-up/2018/405",
    "user_id": 1372,
    "may_record": true,
    "start_date": "2018-09-01 13:30:00",
    "start_time": "13:30",
    "is_fave": false,
    "venue": "Stage A",
    "conversation_id": "CON-6333428f-c17c-4e2c-b458-0f9da6f4b5e8",
    "member_id": "MEM-204c2c17-0848-407f-86d9-b9e24afaa96b"
  },
  {
    "description": "A personal account of getting involved in the recreation at The National Museum of Computing at Bletchley Park of EDSAC.  This was the first fully programmable general purpose computer built from 1946 to 1949 at Cambridge University. It has 3000 valves and takes 12kW of power.\r\nI am on the commissioning team finding how difficult it is to use valves (tubes) as logic circuits.\r\n\r\nYou can find out more here:\r\n\r\nhttp://www.tnmoc.org/special-projects/edsac",
    "title": "The 1949 EDSAC Computer Rebuild",
    "map_link": null,
    "latlon": null,
    "speaker": "Tony Abbey",
    "end_date": "2018-08-31 20:00:00",
    "source": "database",
    "end_time": "20:00",
    "type": "talk",
    "slug": "the-1949-edsac-computer-rebuild",
    "id": 451,
    "link": "https://www.emfcamp.org/line-up/2018/451",
    "user_id": 1472,
    "may_record": true,
    "start_date": "2018-08-31 19:30:00",
    "start_time": "19:30",
    "is_fave": false,
    "venue": "Stage B",
    "conversation_id": "CON-5bcea2e8-aafe-4731-b0af-964e58481cc8",
    "member_id": "MEM-f7bfc45a-4864-4d6c-b901-d163cab24be9"
  },
  {
    "description": "Quick <10min talks, on anything, from anybody who would like to get on the stage!\r\n\r\nIf you'd like to give a lightning talk, please email lightning@emfcamp.org, or try your luck and show up to a session.",
    "title": "Lightning Talks Friday",
    "map_link": null,
    "latlon": null,
    "speaker": "Lightning Talks",
    "end_date": "2018-08-31 14:40:00",
    "source": "database",
    "end_time": "14:40",
    "type": "talk",
    "slug": "lightning-talks-friday",
    "id": 483,
    "link": "https://www.emfcamp.org/line-up/2018/483",
    "user_id": 282,
    "may_record": true,
    "start_date": "2018-08-31 13:40:00",
    "start_time": "13:40",
    "is_fave": false,
    "venue": "Stage B",
    "conversation_id": "CON-5b8c5f9d-724b-49d5-8441-25fa29741825",
    "member_id": "MEM-60b5a6b3-b981-4307-aa68-1c643bc9bb81"
  },
  {
    "description": "The past few years have seen a cascade of headlines about sex robots. It's a shame these are generally completely inaccurate, as behind them there are fascinating stories of intimacy and technology, computers and psychology. Throw in some science-fiction utopias and dystopias, loneliness and companionship, law and ethics, privacy and community and there is so much to be learned about our future with machines that could care for us and about us. The speaker has spent the past four years learning all about this topic: from 30,000 year old dildos to the world's first commercially-available sex robot (on sale now). Content warning: terrible puns; NSFW.       ",
    "title": "Sex Robots! The Truth Behind the Headlines",
    "map_link": null,
    "latlon": null,
    "speaker": "Kate Devlin",
    "end_date": "2018-08-31 20:00:00",
    "source": "database",
    "end_time": "20:00",
    "type": "talk",
    "slug": "sex-robots-the-truth-behind-the-headlines",
    "id": 374,
    "link": "https://www.emfcamp.org/line-up/2018/374",
    "user_id": 1343,
    "may_record": true,
    "start_date": "2018-08-31 19:30:00",
    "start_time": "19:30",
    "is_fave": false,
    "venue": "Stage A",
    "conversation_id": "CON-023316cc-439f-4e36-8659-0af8f503cf72",
    "member_id": "MEM-37254d75-07d2-44b1-8c98-ad3bd4c16158"
  },
  {
    "description": "Making is cool, but we talk and think a lot less about maintenance. Everything we make - software, hardware, communities - needs to be looked after, if it is useful. Sadly, maintaining, repairing and sustaining can be challenging in a fast-moving era, where this work can be seen as boring and low value, compared to the excitement around inventing or making new things. It is easy to forget that apps, data and connected systems need maintenance too, if they are to realise their potential and be useful or fun for more than a brief moment. \r\n\r\nAnd it’s not always easy. It can be hard to find good resourcing models for long-lasting products, or for looking after new forms of shared infrastructure (such as open source software libraries). Strong commons models, where groups share and steward resources (whether the knowledge in Wikipedia or open hardware designs) are scarce or difficult to replicate. \r\n\r\nWe’ll talk about maintenance, good and bad examples of it, and what we are doing to recognise the work done in repair, custodianship, stewardship, tending and caring for things that matter.  \r\n",
    "title": "From making to maintaining ",
    "map_link": null,
    "latlon": null,
    "speaker": "Laura James",
    "end_date": "2018-09-02 18:10:00",
    "source": "database",
    "end_time": "18:10",
    "type": "talk",
    "slug": "from-making-to-maintaining",
    "id": 142,
    "link": "https://www.emfcamp.org/line-up/2018/142",
    "user_id": 524,
    "may_record": true,
    "start_date": "2018-09-02 17:50:00",
    "start_time": "17:50",
    "is_fave": false,
    "venue": "Stage C",
    "conversation_id": "CON-d6988155-1e29-4b4f-84d6-19dcc8468cba",
    "member_id": "MEM-c824a063-b6e8-423a-b155-bbc092a89674"
  },
  {
    "description": "A critically hopeful perspective on the magical technology of the 21st Century, Dr. Lydia Kostopoulos takes the listeners on a journey of how technology is transforming the human experience all the way from birth to death.\r\n\r\nHer talk unpacks the potential benefits and consequences of DNA Editing, Artificially Intelligent Companions, Brain Computer Interface, 3D Printing of Body Parts, and Whole Brain Emulation after Death.",
    "title": "A Magical Time To Be Alive",
    "map_link": null,
    "latlon": null,
    "speaker": "Lydia Kostopoulos",
    "end_date": "2018-09-01 11:40:00",
    "source": "database",
    "end_time": "11:40",
    "type": "talk",
    "slug": "a-magical-time-to-be-alive",
    "id": 336,
    "link": "https://www.emfcamp.org/line-up/2018/336",
    "user_id": 1313,
    "may_record": true,
    "start_date": "2018-09-01 11:10:00",
    "start_time": "11:10",
    "is_fave": false,
    "venue": "Stage B",
    "conversation_id": "CON-53e88407-bed6-4737-b8e5-41db077da931",
    "member_id": "MEM-3bce3799-a7e4-4607-a284-4866beb6eae4"
  },
  {
    "age_range": "18+",
    "cost": "",
    "description": "The Tomb of Horrors is a Dungeons & Dragons adventure designed to be almost impossible and a distinct challenge for D&D players. https://en.wikipedia.org/wiki/Tomb_of_Horrors I am going to run a developing session for 5 players at a time. It will continue until all the characters die. Then we'll start again with the next group! It’s likely that the first few groups won’t take too long, and if they stick around to watch further groups they’ll learn more ways of getting to the end. \r\n\r\nIt will be fun for novice and veteran D&D players, but likely not beginners.\r\n\r\nIt is thoroughly recommended that you bring some good time spirits, as crowd participation will be encouraged. Booing, Cheering and Drinking are all advised.\r\n",
    "title": "How long will it take the beat The Tomb of Horrors?",
    "map_link": null,
    "latlon": null,
    "equipment": "Nothing.",
    "speaker": "graham kitteridge",
    "end_date": "2018-09-01 23:20:00",
    "source": "database",
    "end_time": "23:20",
    "type": "workshop",
    "slug": "how-long-will-it-take-the-beat-the-tomb-of-horrors",
    "id": 246,
    "link": "https://www.emfcamp.org/line-up/2018/246",
    "user_id": 19,
    "may_record": false,
    "start_date": "2018-09-01 20:20:00",
    "start_time": "20:20",
    "is_fave": false,
    "venue": "Workshop 2",
    "conversation_id": "CON-6d6564e3-7065-4c1a-9889-35f9585e7bf9",
    "member_id": "MEM-82bd726b-46ca-4a05-ae84-7849d1470081"
  },
  {
    "age_range": "5+",
    "cost": "0, or add some optional extra costs for 'special' crafting materials e.g. googly eyes, pipe cleaners, stickers",
    "description": "Come along and create a fabulous piece of artwork - whatever you can imagine! Draw, colour, decorate and add glitter to a creation making it as fabulous as you want. Then we're going to add the lights. Using a Crumble controller board, program lights which are going to be added to your artwork to make it even better. Make volcanoes looks like they're exploring, police cars with lights flashing around or a magical unicorn with a horn that glows. Some simple programming transforms your artwork from the same old stuff you've done before to a unique combination of art and light.",
    "title": "Art meets Light",
    "map_link": null,
    "latlon": null,
    "equipment": "A laptop with the Crumble software installed on it. Any favoured arts and craft supplies",
    "speaker": "Sway Grantham",
    "end_date": "2018-09-01 14:30:00",
    "source": "database",
    "end_time": "14:30",
    "type": "youthworkshop",
    "slug": "art-meets-light",
    "id": 231,
    "link": "https://www.emfcamp.org/line-up/2018/231",
    "user_id": 1220,
    "may_record": false,
    "start_date": "2018-09-01 13:20:00",
    "start_time": "13:20",
    "is_fave": false,
    "venue": "Youth Workshop",
    "conversation_id": "CON-8d79dce8-cec0-4054-a4c8-e01659bd3c82",
    "member_id": "MEM-fd5bb5a0-ec81-431a-bc27-c0bf48ed6764"
  },
  {
    "age_range": "All ages",
    "cost": "£1 per attendee",
    "description": "Learn how to make Pom Poms of different sizes and colours!\r\nMake them into garlands to decorate your tent or bedroom or tie onto hair bands as a pretty hair accessory.\r\nYou can make any design you like and is fun for all the family!\r\n\r\nInstructions will be given and there will be some ready made Pom Poms available to you to use \r\n\r\n\r\n",
    "title": "Pom Poms",
    "map_link": null,
    "latlon": null,
    "equipment": "Nothing",
    "speaker": "Sarah Purdie",
    "end_date": "2018-09-01 11:30:00",
    "source": "database",
    "end_time": "11:30",
    "type": "youthworkshop",
    "slug": "pom-poms",
    "id": 23,
    "link": "https://www.emfcamp.org/line-up/2018/23",
    "user_id": 295,
    "may_record": false,
    "start_date": "2018-09-01 09:30:00",
    "start_time": "09:30",
    "is_fave": false,
    "venue": "Youth Workshop",
    "conversation_id": "CON-1178a8b6-63a4-4d5b-b8b2-484b58ded353",
    "member_id": "MEM-a103e2b0-3580-4cf1-9ca0-942a87915b1d"
  },
  {
    "age_range": "All ages",
    "cost": "",
    "description": "Starting with a single sheet of paper, make a triangle, turn it\r\n into a hexagon or a star. Learn to make modules from paper and join them to\r\n make cubes, dodecahedra, stellated shapes. Prove that there are only five platonic solids, explore regular and semi-regular tessellations, and find out what happens if you try to fit more than six triangles around a point.",
    "title": "Making Maths with Modular Origami",
    "map_link": null,
    "latlon": null,
    "equipment": "",
    "speaker": "Alison Kiddle",
    "end_date": "2018-08-31 20:00:00",
    "source": "database",
    "end_time": "20:00",
    "type": "workshop",
    "slug": "making-maths-with-modular-origami",
    "id": 171,
    "link": "https://www.emfcamp.org/line-up/2018/171",
    "user_id": 1162,
    "may_record": false,
    "start_date": "2018-08-31 18:30:00",
    "start_time": "18:30",
    "is_fave": false,
    "venue": "Workshop 2",
    "conversation_id": "CON-53c6ce18-fe2b-448d-8c9e-029db50d4aa0",
    "member_id": "MEM-db5cdd21-c76f-40ec-aac4-4c51303336b4"
  },
  {
    "age_range": "about 4 year upwards (adult assistance requried for under 9s attendees)",
    "cost": "Optional donation to cover materials £1-2",
    "description": "Learn about electronics whilst crafting with LEDs, card and copper tape. Build what your imagination desires. Experimentation is easy and encouraged.",
    "title": "Paper Circuits Workshop ",
    "map_link": null,
    "latlon": null,
    "equipment": "None",
    "speaker": "Peter Jackson",
    "end_date": "2018-08-31 16:20:00",
    "source": "database",
    "end_time": "16:20",
    "type": "workshop",
    "slug": "paper-circuits-workshop",
    "id": 394,
    "link": "https://www.emfcamp.org/line-up/2018/394",
    "user_id": 70,
    "may_record": false,
    "start_date": "2018-08-31 15:20:00",
    "start_time": "15:20",
    "is_fave": false,
    "venue": "Workshop 4",
    "conversation_id": "CON-5bdbe765-e165-4699-9ee8-6ab0776197c9",
    "member_id": "MEM-cbacc0ec-c559-45af-b980-32b051a28c85"
  },
  {
    "age_range": "All ages",
    "cost": "Free - thanks to Pimoroni and Underland for covering costs",
    "description": "Hebocon is Robot Wars for those who are not technically gifted. Crappy robots that can just barely move will somehow manage to engage in odd, awkward battles. \r\n\r\nHebocon requires absolutely no prior skill, and that's what makes it fun. We'll be running a beginner-level electronics workshop and will provide all basic materials to get some motors moving back and forward. We'll be providing a kit for every 2 people, but you are welcome to work in teams. \r\n\r\nAt the end of the session, whatever Heboi robots will fight in our arena for a shameful-proud victory. ",
    "title": "Hebocon: Crappy Robot Workshop for Beginners",
    "map_link": null,
    "latlon": null,
    "equipment": "Any tat they want to make into a robot, none required as we'll provide some",
    "speaker": "Kevin Lewis",
    "end_date": "2018-09-01 16:00:00",
    "source": "database",
    "end_time": "16:00",
    "type": "workshop",
    "slug": "hebocon-crappy-robot-workshop-for-beginners",
    "id": 188,
    "link": "https://www.emfcamp.org/line-up/2018/188",
    "user_id": 1178,
    "may_record": false,
    "start_date": "2018-09-01 12:20:00",
    "start_time": "12:20",
    "is_fave": false,
    "venue": "Workshop 2",
    "conversation_id": "CON-ef7ac090-dafb-4f34-8513-7d551142af39",
    "member_id": "MEM-9bf32730-1f60-4536-bbd1-2dd39abf3677"
  },
  {
    "description": "Governments and organisations the world over are releasing free LiDAR data - capturing the globe in 3D down to the metre. But how can you take this data and make into something tangible? And how can you do it at both the small scale of cities and the enormous scale of mountain ranges?\r\n\r\nWe'll look at three different methods of making 3D terrain models via both 3D printing and CNC machining - examining where the data comes from and LiDAR technology; the challenges of LiDAR data and how to shape it into 3D models; and how to take these highly detailed models and successfully print or machine them.",
    "title": "Taming Terrain: Sculpting geoscapes from LiDAR",
    "map_link": null,
    "latlon": null,
    "speaker": "Andrew Godwin",
    "end_date": "2018-08-31 18:40:00",
    "source": "database",
    "end_time": "18:40",
    "type": "talk",
    "slug": "taming-terrain-sculpting-geoscapes-from-lidar",
    "id": 223,
    "link": "https://www.emfcamp.org/line-up/2018/223",
    "user_id": 1216,
    "may_record": true,
    "start_date": "2018-08-31 18:10:00",
    "start_time": "18:10",
    "is_fave": false,
    "venue": "Stage A",
    "conversation_id": "CON-192fa96e-f60d-4c16-88ae-da27f0852484",
    "member_id": "MEM-e3258390-6300-4996-b524-e96d6664bf97"
  },
  {
    "description": "A talk explaining how and why I built an undertent heating system, and possible future improvements, with jokes, based on my 2017 Edinburgh show \"Renegade Plumber\" ",
    "title": "Adventures in Undertent Heating",
    "map_link": null,
    "latlon": null,
    "speaker": "simon munnery",
    "end_date": "2018-08-31 16:00:00",
    "source": "database",
    "end_time": "16:00",
    "type": "talk",
    "slug": "adventures-in-undertent-heating",
    "id": 493,
    "link": "https://www.emfcamp.org/line-up/2018/493",
    "user_id": 1547,
    "may_record": true,
    "start_date": "2018-08-31 15:30:00",
    "start_time": "15:30",
    "is_fave": false,
    "venue": "Stage A",
    "conversation_id": "CON-ac829031-427f-40b0-95e0-ccff504a0827",
    "member_id": "MEM-d690a6c9-0948-4895-984f-e224cac1579e"
  },
  {
    "age_range": "12+",
    "cost": "£15",
    "description": "The drop spindle is a simple, handheld device, used to turn raw fibres into useable yarns and strings. In use since before recorded history, and still in use today, the drop spindle is portable, lightweight and versatile. It can be used to make a variety of yarns, from simple and practical, to bold and creative.\r\n\r\nYou'll learn the basics of how to turn soft, non-scratchy, merino wool fibre into a useable yarn. How to tweak your spinning to make yarns suitable for different purpose, and how to finish your yarns ready for use. We'll also cover the different kinds of plant and animal fibres, and their properties in spinning. There will be an oppourtunity to see a variety of different fibres, but wool will be the only fibre availiable to work with, as it is by far the simplest for beginners.\r\n\r\nThe kit is yours to take home, and includes 100g of wool fibre. Enough to make a full sized ball of yarn.",
    "title": "Yarn Making",
    "map_link": null,
    "latlon": null,
    "equipment": "n/a",
    "speaker": "Vicki Winter",
    "end_date": "2018-09-02 16:20:00",
    "source": "database",
    "end_time": "16:20",
    "type": "workshop",
    "slug": "yarn-making",
    "id": 179,
    "link": "https://www.emfcamp.org/line-up/2018/179",
    "user_id": 1169,
    "may_record": false,
    "start_date": "2018-09-02 14:20:00",
    "start_time": "14:20",
    "is_fave": false,
    "venue": "Workshop 2",
    "conversation_id": "CON-c144b636-066a-4cf9-af4b-f796c8845527",
    "member_id": "MEM-8e7010b7-e0b6-4a79-88c8-0b1a3cc7241f"
  },
  {
    "age_range": "People who can tie a knot in a balloon  or bring a friend to help",
    "cost": "50p for basic balloon hat + LED and battery  -   Possible extra LED's if wanted",
    "description": "Funky headgear made from long sculptural balloons in various colours.\r\nWe start off by making a basic hat to to fit your head, then \r\nthe fun part starts by adding more balloons to decorate it as you want.\r\nTo finish, we add the LED (and battery provided) to make it glow at night!\r\n",
    "title": "Fun Balloon Hats that Glow",
    "map_link": null,
    "latlon": null,
    "equipment": "None  needed   (But you may want to bring your own LEDS, permanent pens to decorate etc)",
    "speaker": "Stewart Dunn",
    "end_date": "2018-08-31 21:20:00",
    "source": "database",
    "end_time": "21:20",
    "type": "workshop",
    "slug": "fun-balloon-hats-that-glow",
    "id": 42,
    "link": "https://www.emfcamp.org/line-up/2018/42",
    "user_id": 308,
    "may_record": false,
    "start_date": "2018-08-31 20:20:00",
    "start_time": "20:20",
    "is_fave": false,
    "venue": "Workshop 2",
    "conversation_id": "CON-9044e667-95f7-4f37-820f-e4921a1cbac5",
    "member_id": "MEM-06886bb8-e17d-4e61-ba2f-b122971cd7fa"
  },
  {
    "description": "Scratch is a popular language/IDE for teaching children to code. It is possible to extend the offline version of Scratch 2 with a Python module that communicates with Scratch via a web service.\r\n\r\nI have extended Scratch to control Midi instruments and Arduino projects, including controlling Lego Power Functions motors, having reverse engineered the infrared protocol they use.\r\n\r\nIn addition, and perhaps most scarily, I have implemented a TCP/IP sockets extension with which I have exploited vulnerabilities in network services and gained remote code execution.  It is literally possible to create 0day exploits with Scratch!\r\n\r\nI will discuss the framework and the format of the extensions, and I will demonstrate my projects, including hacking a target virtual machine, controlling Lego motors and making noises with a Midi instrument.",
    "title": "Taking Over The World with Scratch",
    "map_link": null,
    "latlon": null,
    "speaker": "Kev Sheldrake",
    "end_date": "2018-08-31 13:50:00",
    "source": "database",
    "end_time": "13:50",
    "type": "talk",
    "slug": "taking-over-the-world-with-scratch",
    "id": 74,
    "link": "https://www.emfcamp.org/line-up/2018/74",
    "user_id": 351,
    "may_record": true,
    "start_date": "2018-08-31 13:00:00",
    "start_time": "13:00",
    "is_fave": false,
    "venue": "Stage C",
    "conversation_id": "CON-7749a7fc-75b4-479b-b288-e2a61fe77832",
    "member_id": "MEM-cf3824b0-1b50-4b33-9614-de5eed014dfc"
  },
  {
    "description": "1 in 2 PhD students experiences psychological distress and 1 in 3 is at risk of a psychiatric disorder. The mental health of PhD students and the academic community has not been discussed enough. This presentation is to share the shocking statistics and real life experiences of those on the PhD programme and to discuss the next steps in ensuring every student has a Mindful PhD. ",
    "title": "A Mindful PhD",
    "map_link": null,
    "latlon": null,
    "speaker": "Dr Marion Brooks Brooks-Bartlett",
    "end_date": "2018-09-02 14:10:00",
    "source": "database",
    "end_time": "14:10",
    "type": "talk",
    "slug": "a-mindful-phd",
    "id": 541,
    "link": "https://www.emfcamp.org/line-up/2018/541",
    "user_id": 1850,
    "may_record": false,
    "start_date": "2018-09-02 13:50:00",
    "start_time": "13:50",
    "is_fave": false,
    "venue": "Stage C",
    "conversation_id": "CON-1c0f9579-375a-43de-82b0-8bba4dbab2b0",
    "member_id": "MEM-fa12ed7a-d905-40a7-9e90-fee86f6d9ec1"
  },
  {
    "age_range": "6+ with adult supervision",
    "cost": "£5",
    "description": "Build a simple solid-fuelled model rocket from scratch!\r\n\r\nWe'll provide paper templates and all required materials, you cut and stick the rocket together and then decorate it to taste.\r\n\r\nAssembling the rocket is straightforward and as they're all made from white card/paper there are plenty of options for decoration or modification. We'll provide some stickers, felt tips, glitter, etc, but feel free to bring your own too! You can also customise the build to your heart's content and we'll be on hand to advise.\r\n\r\nAlso suitable for young children with some supervision. The build involves mostly scissors and tape, one step involves hot glue which requires adult supervision. Feel free to contact us beforehand if you want to check suitability: emf@adamgreig.com / extension 2440. This workshop is also running as a youth workshop on Friday.",
    "title": "Build a rocket",
    "map_link": null,
    "latlon": null,
    "equipment": "",
    "speaker": "Adam Greig",
    "end_date": "2018-09-01 17:10:00",
    "source": "database",
    "end_time": "17:10",
    "type": "workshop",
    "slug": "build-a-rocket",
    "id": 502,
    "link": "https://www.emfcamp.org/line-up/2018/502",
    "user_id": 129,
    "may_record": false,
    "start_date": "2018-09-01 15:10:00",
    "start_time": "15:10",
    "is_fave": false,
    "venue": "Workshop 4",
    "conversation_id": "CON-ef59b22f-4ef6-4827-adfd-8942d6d9ec29",
    "member_id": "MEM-a870899b-d5c7-4aeb-b318-595c0e348f89"
  },
  {
    "description": "I'm James, and I'm responsible for firing literally hundreds of billions of (low power) laser pulses at the countryside in the UK through my work at Gigaclear, a rural FTTH ISP. We're using mobile mapping technologies to make better maps of the country for our network planners.\r\n\r\nIn this talk I'll provide an overview of Mobile Mapping technologies, precision location (and the technology to achieve it), and share some open source workflows and tools for LiDAR data. I'll also talk a little about running a large-scale survey project, and some interesting challenges we've faced in both capture and data management.",
    "title": "Shooting Lasers at the Countryside: An Introduction to Mobile Mapping",
    "map_link": null,
    "latlon": null,
    "speaker": "James Harrison",
    "end_date": "2018-09-02 11:10:00",
    "source": "database",
    "end_time": "11:10",
    "type": "talk",
    "slug": "shooting-lasers-at-the-countryside",
    "id": 280,
    "link": "https://www.emfcamp.org/line-up/2018/280",
    "user_id": 1267,
    "may_record": true,
    "start_date": "2018-09-02 10:40:00",
    "start_time": "10:40",
    "is_fave": false,
    "venue": "Stage A",
    "conversation_id": "CON-386b64b0-6e0f-4cfd-9a91-f6be77f114ef",
    "member_id": "MEM-1f2b1177-9081-43d8-aa62-5f25bc5005bc"
  },
  {
    "description": "The traditional ending to EMF.",
    "title": "Sam2AA VS Gasman",
    "map_link": null,
    "latlon": null,
    "speaker": "Sam2AA, Gasman",
    "end_date": "2018-09-03 01:00:00",
    "source": "database",
    "end_time": "01:00",
    "type": "performance",
    "slug": "sam2aa-vs-gasman",
    "id": 537,
    "link": "https://www.emfcamp.org/line-up/2018/537",
    "user_id": 1208,
    "may_record": false,
    "start_date": "2018-09-03 00:30:00",
    "start_time": "00:30",
    "is_fave": false,
    "venue": "Stage B",
    "conversation_id": "CON-97d5c7e0-7c35-4b8c-a9a5-c60789cd6585",
    "member_id": "MEM-35894e8b-ff86-49c7-b672-f74fb17e96f4"
  },
  {
    "description": "The world's number one ZX Spectrum rock star returns to EMF with his trademark blend of bleeps, bloops, keytar solos, power pop, robotic vocals, key changes and unexpected Disney singalongs to transport you back to the 80s in full force. (Tory government and looming dread of nuclear war supplied separately.)",
    "title": "Gasman's ZX Spectrum Chiptune Odyssey",
    "map_link": null,
    "latlon": null,
    "speaker": "Gasman",
    "end_date": "2018-09-03 00:20:00",
    "source": "database",
    "end_time": "00:20",
    "type": "performance",
    "slug": "gasmans-zx-spectrum-chiptune-odyssey",
    "id": 335,
    "link": "https://www.emfcamp.org/line-up/2018/335",
    "user_id": 403,
    "may_record": false,
    "start_date": "2018-09-02 23:30:00",
    "start_time": "23:30",
    "is_fave": false,
    "venue": "Stage B",
    "conversation_id": "CON-b9412e8a-8807-44b2-af60-f138b3fd1696",
    "member_id": "MEM-43675d74-6af5-49be-9d5b-247ba8e97887"
  },
  {
    "age_range": "",
    "cost": "",
    "description": "This is a workshop about better understanding our relationships with each other. Including work, family and socal groups.\r\n\r\nUsing everyday examples the workshop introduces the Drama Triangle (Stephen Karpman https://en.wikipedia.org/wiki/Karpman_drama_triangle) and how it can make our interactions with people go wrong without us knowing why.\r\n\r\nIn the workshop I'll show how we can spot drama, and what to do about it. I'll use some examples from family, work and social life to recognise 'drama' and provide a way to interact better.\r\n\r\nAfter the workshop, attendees will have the tools to recognise and avoid miscommunication and anti-patterns with affect our daily lives in negative ways.\r\n\r\n \r\n\r\n\r\n\r\n\r\n\r\n",
    "title": "Drama, and what we'd like to do about it",
    "map_link": null,
    "latlon": null,
    "equipment": "",
    "speaker": "Mike Haber",
    "end_date": "2018-08-31 14:30:00",
    "source": "database",
    "end_time": "14:30",
    "type": "workshop",
    "slug": "drama-and-what-wed-like-to-do-about-it",
    "id": 33,
    "link": "https://www.emfcamp.org/line-up/2018/33",
    "user_id": 301,
    "may_record": false,
    "start_date": "2018-08-31 13:00:00",
    "start_time": "13:00",
    "is_fave": false,
    "venue": "Workshop 2",
    "conversation_id": "CON-1d162a94-b235-4836-884e-f82919ed2643",
    "member_id": "MEM-1952acf7-2a9e-405c-a4e6-59bfe7542a8c"
  },
  {
    "age_range": "16 years upwards (or 12 years with parental assistance)",
    "cost": "£75",
    "description": "The RC2014 is a Z80 based computer kit that runs Microsoft BASIC, and introduces you to the cutting edge world of computing in the late 1970s!\r\n\r\nIn this workshop you will get a RC2014 Mini kit and I will take you through the steps involved in building it, explaining how it works, what you can do with it, and, how to troubleshoot it if necessary.  By the end of the workshop you will have a working retro computer to take away that can be plugged in to a laptop & FTDI cable or a Raspberry Pi Zero with keyboard and monitor\r\n\r\nBeginners soldering experience is assumed",
    "title": "Build a Z80 Retro Computer Kit",
    "map_link": null,
    "latlon": null,
    "equipment": "Laptop & FTDI cable or Pi Zero & USB Keyboard & HDMI screen",
    "speaker": "Spencer owen",
    "end_date": "2018-08-31 19:10:00",
    "source": "database",
    "end_time": "19:10",
    "type": "workshop",
    "slug": "build-a-z80-retro-computer-kit",
    "id": 449,
    "link": "https://www.emfcamp.org/line-up/2018/449",
    "user_id": 880,
    "may_record": false,
    "start_date": "2018-08-31 17:10:00",
    "start_time": "17:10",
    "is_fave": false,
    "venue": "Workshop 3",
    "conversation_id": "CON-642e4593-3ec6-437c-b67a-c6c7a7843c5a",
    "member_id": "MEM-c3a30edd-d0bb-44bd-a1b7-76d374570d8c"
  },
  {
    "description": "A talk about the chromatouch dome found on site",
    "title": "Chromatouch",
    "map_link": null,
    "latlon": null,
    "speaker": "Chromatouch",
    "end_date": "2018-09-02 12:20:00",
    "source": "database",
    "end_time": "12:20",
    "type": "talk",
    "slug": "chromatouch",
    "id": 523,
    "link": "https://www.emfcamp.org/line-up/2018/523",
    "user_id": 1733,
    "may_record": true,
    "start_date": "2018-09-02 11:50:00",
    "start_time": "11:50",
    "is_fave": false,
    "venue": "Stage C",
    "conversation_id": "CON-9e1dfbab-27f3-43f4-8fd8-05635625e12b",
    "member_id": "MEM-fb933ae7-709e-49cb-88a1-5b7b1052f486"
  },
  {
    "description": "You should be afraid of your smart home. Really afraid!\r\n\r\nI've wired up my house with dozens of Internet of Things gadgets. Some spy on me, some let in hackers, some send all my data back to China, some give me electric shocks, some betray my medical information to the police.\r\n\r\nFind out how I've ruined my domestic bliss and made my vacuum cleaner self-aware.\r\n\r\nLearn how to protect yourself and how to critically evaluate what you buy for your home.\r\n\r\nContent Warning. This talk contains frank discussion about sex and death. ",
    "title": "The (Connected) House of Horrors",
    "map_link": null,
    "latlon": null,
    "speaker": "Terence Eden",
    "end_date": "2018-09-02 13:10:00",
    "source": "database",
    "end_time": "13:10",
    "type": "talk",
    "slug": "the-connected-house-of-horrors",
    "id": 1,
    "link": "https://www.emfcamp.org/line-up/2018/1",
    "user_id": 283,
    "may_record": true,
    "start_date": "2018-09-02 12:40:00",
    "start_time": "12:40",
    "is_fave": false,
    "venue": "Stage A",
    "conversation_id": "CON-566bdc49-f7a6-48a6-83f5-d4e8aefbd68b",
    "member_id": "MEM-21f5173a-0ff9-4f6d-826d-83e614158dd9"
  },
  {
    "description": "These are not the zombies you've fragged! A bioarchaeologist and an applied philosopher will take you on a historical zombie adventure beyond Romero's shambling hordes and stories about Haitian Voodoo. Did you know that the D&D wondrous item: Hand of Glory was inspired by real artefacts? Or that miasmic \"zombification\" in some video games reflects medieval ideas about contagion? What do past ideas about zombies tell us about zombies now? And how do video game zombies reflect current ideas about ethics? Also, find out how zombies play a role in cutting-edge neuroscience and ICT research!",
    "title": "BRAAAAAAAINS: Archaeology and Philosophy of Zombies in Games",
    "map_link": null,
    "latlon": null,
    "speaker": "Dr. Tyr Fothergill",
    "end_date": "2018-09-02 20:00:00",
    "source": "database",
    "end_time": "20:00",
    "type": "talk",
    "slug": "braaaaaaains-archaeology-and-philosophy-of-zombies-in-games",
    "id": 309,
    "link": "https://www.emfcamp.org/line-up/2018/309",
    "user_id": 1285,
    "may_record": true,
    "start_date": "2018-09-02 19:20:00",
    "start_time": "19:20",
    "is_fave": false,
    "venue": "Stage A",
    "conversation_id": "CON-ea3ff923-3c3a-480e-94d7-ca4480a5d8b4",
    "member_id": "MEM-43899d04-4871-412c-aaa1-cb6aad7fa9da"
  },
  {
    "age_range": "Ages 10+",
    "cost": "",
    "description": "It's adventure time! Come and try out Dungeons and Dragons (or other, similar, roleplaying games) with a selection of the finest, experienced Dungeon Masters! Don't worry if you've never seen anything but a 6-sided die, or if you don't know what a Xorn is, there's space for you at the table*! \r\n\r\nThese games will be newbie friendly, so if you've never played before and want to find out what it's all about, please come along! (And if you're one of the finest DMs in the land, let me know if you'd like to help out!)\r\n\r\nA selection of exciting and different board games will be provided as well for those who miss out on gaming with a DM. \r\n\r\n* space not guaranteed - first come first serve until the space is full!",
    "title": "Introduction to Dungeons and Dragons (and other RPGs and board games)! ",
    "map_link": null,
    "latlon": null,
    "equipment": "none required",
    "speaker": "Catherine Flick",
    "end_date": "2018-09-01 23:00:00",
    "source": "database",
    "end_time": "23:00",
    "type": "workshop",
    "slug": "introduction-to-dungeons-and-dragons-and-other-rpgs",
    "id": 120,
    "link": "https://www.emfcamp.org/line-up/2018/120",
    "user_id": 362,
    "may_record": false,
    "start_date": "2018-09-01 20:00:00",
    "start_time": "20:00",
    "is_fave": false,
    "venue": "Workshop 4",
    "conversation_id": "CON-778bf78b-7ea6-4521-a8d2-6104dc5994a8",
    "member_id": "MEM-9ec55a04-b917-44dc-8229-44d3ff1db9a2"
  },
  {
    "description": "Standup comedy from scientists and technologist and futurists who work at the cutting edge of tech. Jokes and stories from comedians who know their graphene from their gravity beams, their innovation policy from interstellar probes. Lydia Nicholas, Scary Boots, Cerys Bradley and Anna Ploszajski will light up your night with no crossed wires.",
    "title": "Augmented Hilarity",
    "map_link": null,
    "latlon": null,
    "speaker": "Lydia Nicholas",
    "end_date": "2018-09-02 17:40:00",
    "source": "database",
    "end_time": "17:40",
    "type": "talk",
    "slug": "augmented-hilarity",
    "id": 444,
    "link": "https://www.emfcamp.org/line-up/2018/444",
    "user_id": 1468,
    "may_record": true,
    "start_date": "2018-09-02 17:00:00",
    "start_time": "17:00",
    "is_fave": false,
    "venue": "Stage A",
    "conversation_id": "CON-5bdb89f6-4891-41c0-8027-bbf10a3a1091",
    "member_id": "MEM-03707d2d-8e5f-4735-a477-0671d539c60d"
  },
  {
    "age_range": "Any age",
    "cost": "N/A",
    "description": "A practical voyage into the art of light painting and light writing photography. We will start with an initial meet and greet where we will go over the basics and establish everyone's skill level. This will be followed up after dark with a practical lesson where we will walk around the site looking for subjects and learning what can be achieved. This would be followed up the next day with a review of the nights photography as well as a show and tell of the groups best images.",
    "title": "Light Painting / Light Writing",
    "map_link": null,
    "latlon": null,
    "equipment": "A DSLR, Mirrorless Camera or similar (capable of 30 second exposures or ideally bulb mode), tripod, torches etc.",
    "speaker": "Dan Nightingale",
    "end_date": "2018-08-31 21:20:00",
    "source": "database",
    "end_time": "21:20",
    "type": "workshop",
    "slug": "light-painting-light-writing",
    "id": 241,
    "link": "https://www.emfcamp.org/line-up/2018/241",
    "user_id": 1227,
    "may_record": false,
    "start_date": "2018-08-31 20:20:00",
    "start_time": "20:20",
    "is_fave": false,
    "venue": "Workshop 4",
    "conversation_id": "CON-5c338bc6-5bf3-453a-b573-28681d3892a6",
    "member_id": "MEM-f2a1acfc-2936-4574-817b-bcbd53c11670"
  },
  {
    "description": "Light is managed using lenses, objectives, telescopes. In theatre or TV, it is common to see spotlights following characters and laser lights creating special effects. Similar control on sound is difficult: you need expensive sets of speakers, like the ones in musical festivals, in ultrasound scanners, and in haptic devices.\r\n\r\nIn this talk, I will introduce another way: using 3D-printed materials, specially-engineered to manipulate sound. Using tractor beams, levitation pods (for polystyrene beads) and other demos, I will guide the audience towards a (not-so-far) future where what we see in science fiction movies like Iron Man or Minority Report is real. A world where two people will be able to listen at two different programs from the same radio or to receive personalised sound messages without headphones. A world where music at outdoor festivals and in beer gardens will be managed while preserving airflow. A world where sound control is a DIY task.",
    "title": "Shaping sound",
    "map_link": null,
    "latlon": null,
    "speaker": "Gianluca Memoli",
    "end_date": "2018-09-02 10:30:00",
    "source": "database",
    "end_time": "10:30",
    "type": "talk",
    "slug": "shaping-sound",
    "id": 340,
    "link": "https://www.emfcamp.org/line-up/2018/340",
    "user_id": 1316,
    "may_record": true,
    "start_date": "2018-09-02 10:00:00",
    "start_time": "10:00",
    "is_fave": false,
    "venue": "Stage B",
    "conversation_id": "CON-c43d380c-97b7-4279-9ddc-786a6d236dd3",
    "member_id": "MEM-0b72ddfd-a06b-4816-bdfb-876dce5c0555"
  },
  {
    "description": "The internet began as a network before firewalls, where any computer could communicate with any other computer without intermediation; but today there are host firewalls, perimeter firewalls, content filters, NATs, DNS limitations, BGP hijacks and all manner of other mechanisms which limit you and your computer's ability to communicate — and what is a network if not for communication?\r\n\r\nThe Tor \"Onion\" networking protocol is a return to this simpler, \"disintermediated\" state - you don't need anyone's permission to communicate from/to a well-known address, and you gain a host of security & operational benefits for free. We investigate these.",
    "title": "Why and How you should start using Onion Networking",
    "map_link": null,
    "latlon": null,
    "speaker": "Alec Muffett",
    "end_date": "2018-08-31 18:40:00",
    "source": "database",
    "end_time": "18:40",
    "type": "talk",
    "slug": "why-and-how-you-should-start-using-onion-networking",
    "id": 263,
    "link": "https://www.emfcamp.org/line-up/2018/263",
    "user_id": 206,
    "may_record": true,
    "start_date": "2018-08-31 18:10:00",
    "start_time": "18:10",
    "is_fave": false,
    "venue": "Stage C",
    "conversation_id": "CON-a16e5890-d43c-49f2-a9cb-9e1e18fe1eca",
    "member_id": "MEM-4b1f3a03-60fe-463d-9c76-4e979a8d3aef"
  },
  {
    "description": "Matrix.org is an ambitious open source project which defines a new protocol for open, decentralised, encrypted communication: adding a common denominator to the internet for securely publishing and subscribing to data (especially IM and VoIP) in realtime; liberating communication from being trapped in silos like WhatsApp, Slack, Discord and similar.\r\n\r\nWe maintain the specification for Matrix as well as release open source reference implementations of servers, clients, SDKs, bots and bridges to support the wider Matrix ecosystem.  As of Aug 2018 Matrix has around 5.5M reachable users and over 8000 server instances, ranging from individual personal servers through to massive deployments for governments and telcos - and a huge community of open source contributors building alternative clients, bots,  bridges, servers etc.\r\n\r\nToday Matrix is in late beta, but as of the end of 2017 the protocol is feature frozen as we converge on a 1.0 release later in 2018.  In this talk we'll give an overview of the Matrix protocol, the ecosystem, the road to 1.0 and show off all the latest clients and capabilities - including some of the more exciting non-IM usages, such as VR communication!",
    "title": "Power to the people: liberating online communication with Matrix.org",
    "map_link": null,
    "latlon": null,
    "speaker": "Matthew Hodgson",
    "end_date": "2018-09-01 16:20:00",
    "source": "database",
    "end_time": "16:20",
    "type": "talk",
    "slug": "power-to-the-people-liberating-online-communication",
    "id": 264,
    "link": "https://www.emfcamp.org/line-up/2018/264",
    "user_id": 1249,
    "may_record": true,
    "start_date": "2018-09-01 15:50:00",
    "start_time": "15:50",
    "is_fave": false,
    "venue": "Stage A",
    "conversation_id": "CON-d313da6e-8d76-42fd-92bf-9b17a5062559",
    "member_id": "MEM-5be7bf73-66e6-4585-9d0a-d70004e14ed3"
  },
  {
    "age_range": "8-12",
    "cost": "Free",
    "description": "Learn some knotting techniques and create your own 15cm paracord person.  You'll be able to to add swords and shields,helmets and hairy bits, tails and other trappings as you see fit.  I'll be running this workshop with the support of 2 experienced toy crafters aged 12 and 14. ",
    "title": "Making paracord people",
    "map_link": null,
    "latlon": null,
    "equipment": "Fingers",
    "speaker": "Fiona French",
    "end_date": "2018-09-01 18:00:00",
    "source": "database",
    "end_time": "18:00",
    "type": "youthworkshop",
    "slug": "making-paracord-people",
    "id": 177,
    "link": "https://www.emfcamp.org/line-up/2018/177",
    "user_id": 1167,
    "may_record": false,
    "start_date": "2018-09-01 16:40:00",
    "start_time": "16:40",
    "is_fave": false,
    "venue": "Youth Workshop",
    "conversation_id": "CON-861f8f69-d411-4d51-8629-c7235995c14c",
    "member_id": "MEM-43ab0340-eea7-49d0-9d3e-87e3dd8d2413"
  },
  {
    "description": "Failure is a great teacher, but we do not often talk openly about failure in a public setting. As a scientist (and failure enthusiast), I am trying to encourage my community to talk more about failure, which is difficult since the path to success is to publish about successes and to hide failures. Let's do more to talk about failure as a Maker community. Let's be honest about the dead-ends and dumb mistakes that got us to that early prototype. Rather than ridiculing 'fails', let's instead celebrate them, since they're what we learn from and allows us to become better than we are.\r\n\r\nInstead of teaching people that failure is bad, let's teach them how to be resilient to failure - give them a safe space to fail in, and provide them the encouragement to keep working towards success. \r\n\r\nAs a social experiment, I will setup a slackline at EMF Camp and invite you to come and try to slackline for the first time and *livestream you failure* with the tag #EMFailure. If you want help for any reason, get in touch with me (@grajohnt).",
    "title": "A Failure Enthusiast",
    "map_link": null,
    "latlon": null,
    "speaker": "John Thurmond",
    "end_date": "2018-09-01 11:00:00",
    "source": "database",
    "end_time": "11:00",
    "type": "talk",
    "slug": "a-failure-enthusiast",
    "id": 186,
    "link": "https://www.emfcamp.org/line-up/2018/186",
    "user_id": 620,
    "may_record": true,
    "start_date": "2018-09-01 10:40:00",
    "start_time": "10:40",
    "is_fave": false,
    "venue": "Stage B",
    "conversation_id": "CON-571b9aae-6749-4ae3-9ff8-0a97a82d6b69",
    "member_id": "MEM-94c56632-f399-4f00-a85a-af5a9aeabe70"
  },
  {
    "age_range": "We'll be working with sharp metal and hammers. Younger children may need an adult to help.",
    "cost": "Free",
    "description": "Make your own titanium spork, to your own design. You’ll cutting it from sheet and hammer it to shape. No experience is required, and you’ll end up learning some basic sheet-metal technique.\r\n\r\nSee http://www.jarkman.co.uk/catalog/random/emf2016sporks.htm for a previous iteration.",
    "title": "Titanium spork workshop",
    "map_link": null,
    "latlon": null,
    "equipment": "",
    "speaker": "Richard Sewell",
    "end_date": "2018-09-02 13:00:00",
    "source": "database",
    "end_time": "13:00",
    "type": "workshop",
    "slug": "titanium-spork-workshop",
    "id": 191,
    "link": "https://www.emfcamp.org/line-up/2018/191",
    "user_id": 378,
    "may_record": false,
    "start_date": "2018-09-02 10:00:00",
    "start_time": "10:00",
    "is_fave": false,
    "venue": "Workshop 4",
    "conversation_id": "CON-7636488f-8be3-41cb-b00b-39946f0d564d",
    "member_id": "MEM-f185deaf-638a-47ef-8b00-88f2db496035"
  },
  {
    "description": "Often we use graphs and charts ('visualizations') to display information in a way which makes understanding the data they show seem intuitive. They are used by well dressed individuals to show their projected quarterly earnings, by primary school teachers introducing exciting new ideas to wide eyed children, and by news organisations trying to explain that it's definitely ok to drink that 5th cup of coffee. But all's not fair in charts and graphs, intentionally or not they are not always faithful to the data. How can you spot a misleading chart, and what happens when what they don't reflect the truth? \r\n\r\nIn this talk we'll tour the visualization jungles, looking at some of the scariest, most dangerous, and weirdest visualizations out there. You'll learn some of the tricks used to change what a visualization shows and see examples of some previous weird and wonderful visualizations. By the end of our tour you'll know what to watch out for in your future visualization adventures, and how to make you own visualizations a little less intimidating or misleading to fellow adventurers.",
    "title": "A Tour Through the Visualization Jungle",
    "map_link": null,
    "latlon": null,
    "speaker": "Fearn Bishop",
    "end_date": "2018-09-01 17:20:00",
    "source": "database",
    "end_time": "17:20",
    "type": "talk",
    "slug": "a-tour-through-the-visualization-jungle",
    "id": 389,
    "link": "https://www.emfcamp.org/line-up/2018/389",
    "user_id": 398,
    "may_record": true,
    "start_date": "2018-09-01 16:50:00",
    "start_time": "16:50",
    "is_fave": false,
    "venue": "Stage B",
    "conversation_id": "CON-fad599e0-e92a-43ed-b6fe-50cbd34abbc7",
    "member_id": "MEM-3d68fbf3-2d54-4762-88a4-5cde1dc75274"
  },
  {
    "age_range": "Adults only due to sharp objects (knives, shears, cans) and fire.",
    "cost": "Free!",
    "description": "In less than an hour, learn how to make a super-efficient alcohol burning stove that can cook an entire meal from a single recycled drinks can. (Bring your own can!) \r\n\r\nThis is a skill you can use anywhere, works with materials that are cheap or free, and once you know how can be repeated in minutes so you'll have the ability to cook your own food or boil water wherever you are.",
    "title": "Make a stove out of a recycled drinks can! ",
    "map_link": null,
    "latlon": null,
    "equipment": "Bring your own drinks can, and ideally a pocket knife (some tools will be provided).",
    "speaker": "Maxine Green",
    "end_date": "2018-08-31 17:40:00",
    "source": "database",
    "end_time": "17:40",
    "type": "workshop",
    "slug": "make-a-stove-out-of-a-recycled-drinks-can",
    "id": 380,
    "link": "https://www.emfcamp.org/line-up/2018/380",
    "user_id": 1348,
    "may_record": false,
    "start_date": "2018-08-31 16:40:00",
    "start_time": "16:40",
    "is_fave": false,
    "venue": "Workshop 4",
    "conversation_id": "CON-2c029fdb-02cc-4e74-937f-a3216832db6b",
    "member_id": "MEM-409e028b-17c8-4c26-9f08-b6c280bfc431"
  },
  {
    "description": "Tagline: \"I almost wish there were a conspiracy, but I'm afraid it's much worse than that.\"\r\n\r\nIt is a widely, but vaguely, appreciated fact that banks and banking are powerful and important aspects of modern history, which affect almost all aspects of politics and society. Most thoughtful people, reflecting on the present trajectory of history, get the uncomfortable feeling that we are all being driven toward economic, political and ecological disaster, and that international banking has something to do with it.\r\n\r\nThis has made banking the focus of numerous conspiracy theories, most of which contain useful and verifiable information, but all of which fail in one key respect: they all subordinate the banking system to the agency of secretive groups of people who supposedly control the whole system across generations.\r\n\r\nThe conspiracy scenario, bad as it is, holds out the comforting thought that if we could just identify and take out the shadowy figures who are really in control, then everything could be put right. But what if the truth is even more terrible? What if the system has its own internal logic, like a virus or an algorithm, which needs no human hand to guide it?\r\n\r\nThis talk goes back to the basic principles, and the medieval Italian and English origins, of the banking system to explore its algorithmic properties. I will argue that credit systems are not only a powerful tool in the hands of human and organizations like governments and corporations, but also that they have revolutionary effects on the priorities and and agendas of those organizations. That the tool, in other words - like Elric of Melnibone's 'Stormbringer' or Faust's 'Mephistopheles' - guides the hand that seek to wield it.",
    "title": "Numbers vs Resources: The History of Banking",
    "map_link": null,
    "latlon": null,
    "speaker": "Patrick O'Connor",
    "end_date": "2018-09-01 18:00:00",
    "source": "database",
    "end_time": "18:00",
    "type": "talk",
    "slug": "numbers-vs-resources-the-history-of-banking",
    "id": 200,
    "link": "https://www.emfcamp.org/line-up/2018/200",
    "user_id": 1191,
    "may_record": true,
    "start_date": "2018-09-01 17:30:00",
    "start_time": "17:30",
    "is_fave": false,
    "venue": "Stage B",
    "conversation_id": "CON-a051f894-89f9-44ca-a5ec-fc5611990cc6",
    "member_id": "MEM-6cc5d9e0-c5c9-48c9-861b-740bebace40a"
  },
  {
    "age_range": "Children welcome with adult",
    "cost": "£10",
    "description": "Harness the full power of the upside down (and the ESP8266) to build a working version of the fairy light messaging system as seen in \"Stranger things\". \r\nThe light board is driven by the ESP8266 which allows a connection through WiFi so that you can update the messages from your mobile devices.\r\nBring a laptop to set up your own Arduino environment for programming or simply assemble the provided kit with help. Involves gluing, soldering, and programming, beginners are welcome.",
    "title": "Build a 'Stranger Things' Light Board",
    "map_link": null,
    "latlon": null,
    "equipment": "Laptop advised but not essential.",
    "speaker": "MSRaynsford",
    "end_date": "2018-08-31 15:00:00",
    "source": "database",
    "end_time": "15:00",
    "type": "workshop",
    "slug": "build-a-stranger-things-light-board",
    "id": 418,
    "link": "https://www.emfcamp.org/line-up/2018/418",
    "user_id": 1193,
    "may_record": false,
    "start_date": "2018-08-31 13:00:00",
    "start_time": "13:00",
    "is_fave": false,
    "venue": "Workshop 4",
    "conversation_id": "CON-6e2489c4-c6c5-47df-92ac-0275c0d5c01d",
    "member_id": "MEM-852a59e4-70c4-4705-97d0-c257a15aafcd"
  },
  {
    "age_range": "All ages, with a guardian if under 13. Some HTML/JS experience recommended!",
    "cost": "",
    "description": "How do people with disabilities use the internet? Accessibility and inclusive design have gained popularity recently, but a lot of web developers are still unaware of what they can do to make their sites and apps work for everyone. Even with a lot of goodwill, practical knowledge is needed: it can be overwhelming to try to use a screen reader, use the internet without a mouse, get notifications with no audio or empathise with reading and cognitive impairments. Things like ARIA and tab order logic can also be intimidating and may lead developers to make experiences worse when they think they are improving it.\r\n \r\nThis workshop will be part-talk, part-practical, to demystify accessibility: why it matters, what are the things to consider, how to test and find issues, and most importantly what you can do to fix them. Participants will have hands-on exercises of using a screen reader on their own devices, navigating using just a keyboard, and identify what's a good and a terrible experience. We will work on hands-on exercises with HTML and JavaScript to fix custom components, understand the logic, and for more experienced developers we will cover ARIA components and building accessible custom elements like accordions and tab panels.",
    "title": "Introduction to web accessibility",
    "map_link": null,
    "latlon": null,
    "equipment": "Laptop, smartphone, earphones",
    "speaker": "Victor Loux",
    "end_date": "2018-09-02 15:20:00",
    "source": "database",
    "end_time": "15:20",
    "type": "workshop",
    "slug": "introduction-to-web-accessibility",
    "id": 319,
    "link": "https://www.emfcamp.org/line-up/2018/319",
    "user_id": 92,
    "may_record": false,
    "start_date": "2018-09-02 13:20:00",
    "start_time": "13:20",
    "is_fave": false,
    "venue": "Workshop 3",
    "conversation_id": "CON-41031397-b6db-472c-aa9b-adfd47584e94",
    "member_id": "MEM-f47fe2ed-f5c4-47bf-9125-bf7097507d91"
  },
  {
    "description": "Quick <10min talks, on anything, from anybody who would like to get on the stage!\r\n\r\nIf you'd like to give a lightning talk, please email lightning@emfcamp.org, or try your luck and show up to a session.",
    "title": "Lightning Talks Sunday",
    "map_link": null,
    "latlon": null,
    "speaker": "Lightning Talks",
    "end_date": "2018-09-02 11:00:00",
    "source": "database",
    "end_time": "11:00",
    "type": "talk",
    "slug": "lightning-talks-sunday",
    "id": 485,
    "link": "https://www.emfcamp.org/line-up/2018/485",
    "user_id": 282,
    "may_record": true,
    "start_date": "2018-09-02 10:00:00",
    "start_time": "10:00",
    "is_fave": false,
    "venue": "Stage C",
    "conversation_id": "CON-f51bf147-732d-455e-9a89-515c04a1aeb6",
    "member_id": "MEM-168737aa-6c1a-444b-932b-aa0a1d21cbd6"
  },
  {
    "description": "Hear vicious venomous molluscs and baroque bifurcation diagrams!\r\n\r\nYou could already buy knitted scarves of elementary cellular automata and simulated sea shells, now you can listen to what passes for tunes!\r\n\r\nFabienne Serriere's generative knitting patterns drew attention to Hans Meinhardt's book \"The Algorithmic Beauty of Sea Shells\", the code that came with it is being slowly resurrected. Abuse of inverse short-time Fourier transforms in Python turns shell patterns into sounds.\r\n\r\nWe'll also stop worrying and learn to love the digital by exploring reasonably analogue chaotic attractor sounds with a Raspberry Pi and some cheap digital to analogue converters. Somewhere between a talk and a performance, this follows on from appearances at EMF 2016 and SHA 2017 where noises were caused to happen on stage and some people clapped afterwards. (Well, it counts as a performance if New Order pressing \"Start\" on their sequencer counts as an encore.) ",
    "title": "Never Mind the Molluscs: (Mis)Adventures in \"Aggro-Rhythmic Composition\"",
    "map_link": null,
    "latlon": null,
    "speaker": "Giles Greenway",
    "end_date": "2018-09-01 11:10:00",
    "source": "database",
    "end_time": "11:10",
    "type": "talk",
    "slug": "never-mind-the-molluscs",
    "id": 446,
    "link": "https://www.emfcamp.org/line-up/2018/446",
    "user_id": 384,
    "may_record": true,
    "start_date": "2018-09-01 10:30:00",
    "start_time": "10:30",
    "is_fave": false,
    "venue": "Stage C",
    "conversation_id": "CON-d27055fa-96ec-4736-a4e8-3f654f6e2a84",
    "member_id": "MEM-980c8adc-bfbf-4768-b6cf-dc3081ff2fc1"
  },
  {
    "description": "News and media outlets on the web are silos of information designed to be taken at face value and are resistant to aggregation and side-by-side analysis because - after all - they're really just vehicles to sell ads.\r\n\r\nWhere aggregation is available to the average user (usually on social media), news feeds are customized on behalf of the user with algorithms they can't understand or control.\r\n\r\nTo try and solve this problem for myself, I attempted to aggregate web content via RSS feeds, but found most article bodies are just click-through links and no actual content.\r\n\r\nThat's why I wrote a RSS/Atom reconstitutor, web scraper and search indexer - to be able to get feeds of news, blogs and reports I could read and analyze without the filter bubble.\r\n\r\nBut this talk is only a *bit* about that - it's the technical backbone around which we will explore surveillance, news as data, the ethics of advertising, and subverting some hilariously paper thin content protections.\r\n\r\nIn a talk for all levels of technical ability, I'd like to share the things I learned along the way and encourage everyone to question how they can use their own skills to take back control of information on the web and overcome the status quo.",
    "title": "Newsveillance",
    "map_link": null,
    "latlon": null,
    "speaker": "Matt Carroll",
    "end_date": "2018-08-31 17:10:00",
    "source": "database",
    "end_time": "17:10",
    "type": "talk",
    "slug": "newsveillance",
    "id": 147,
    "link": "https://www.emfcamp.org/line-up/2018/147",
    "user_id": 562,
    "may_record": true,
    "start_date": "2018-08-31 16:40:00",
    "start_time": "16:40",
    "is_fave": false,
    "venue": "Stage C",
    "conversation_id": "CON-77fd79a0-ea36-4084-bc79-55db02797ab4",
    "member_id": "MEM-5649778a-0d3b-4277-80a8-3bbb60b53ab9"
  },
  {
    "description": "Tudor Tarlev is an ex-nomad and university dropout turned researcher of lifelong human learning, with a Degree from the Center for Research and Interdisciplinarity in Paris.\r\n\r\nIn 2015 Tudor visited maker spaces across the globe (http://bit.ly/2KWnqT9) to document how people learn by doing. That trip inspired the launch of experimentQ.org podcast - a show about rebel teachers, scientists, and entrepreneurs reshaping our education systems.\r\n\r\nAt EMF Tudor will deliver a talk about the state of informal education and ways to document, visualize and get validations for learning experiences gained outside the schooling system. ",
    "title": "Document & quantify informal learning ",
    "map_link": null,
    "latlon": null,
    "speaker": "Tudor Tarlev",
    "end_date": "2018-09-01 17:20:00",
    "source": "database",
    "end_time": "17:20",
    "type": "talk",
    "slug": "document-quantify-informal-learning",
    "id": 401,
    "link": "https://www.emfcamp.org/line-up/2018/401",
    "user_id": 1369,
    "may_record": true,
    "start_date": "2018-09-01 17:00:00",
    "start_time": "17:00",
    "is_fave": false,
    "venue": "Stage C",
    "conversation_id": "CON-67f97bc3-3a18-4e07-ae91-086d7087ad00",
    "member_id": "MEM-3fe52f98-6097-495d-93c7-912fb2762f94"
  },
  {
    "description": "A short summary of how this year's EMF Badge came to be, the challenges we faced this time and some of the amazing things people have done with it in only three days.\r\n\r\n[alternative title, depending on circumstances: \"why you don't have a badge this year\"]",
    "title": "The making of TiLDA Mk4",
    "map_link": null,
    "latlon": null,
    "speaker": "Marek Ventur",
    "end_date": "2018-09-02 12:30:00",
    "source": "database",
    "end_time": "12:30",
    "type": "talk",
    "slug": "the-making-of-tilda-mk4",
    "id": 491,
    "link": "https://www.emfcamp.org/line-up/2018/491",
    "user_id": 339,
    "may_record": true,
    "start_date": "2018-09-02 12:00:00",
    "start_time": "12:00",
    "is_fave": false,
    "venue": "Stage A",
    "conversation_id": "CON-a123a7a7-9add-4c60-be71-990c4161b045",
    "member_id": "MEM-37c808dd-69e3-4e49-a3db-531e577f8bd2"
  },
  {
    "age_range": "7 to 12 with their parent, 12 up on their own is fine",
    "cost": "",
    "description": "A family workshop where we gather in teams to build bridges out of lollipop sticks and using hot glue guns. The format of the sessions is a short talk about the engineering principles in bridge design. Then we split up into team and work together to make a bridge that spans 35cm.\r\nAfter an hour we all come together to test each bridge by hanging weights off its center. Each bridge is tested to destruction. The bridge that holds the most weight is the winner and they receive a small token prize. ",
    "title": "Bridge Building",
    "map_link": null,
    "latlon": null,
    "equipment": "",
    "speaker": "Jeffrey Roe / Christian Kortenhorst",
    "end_date": "2018-09-02 12:30:00",
    "source": "database",
    "end_time": "12:30",
    "type": "youthworkshop",
    "slug": "bridge-building",
    "id": 117,
    "link": "https://www.emfcamp.org/line-up/2018/117",
    "user_id": 450,
    "may_record": false,
    "start_date": "2018-09-02 11:00:00",
    "start_time": "11:00",
    "is_fave": false,
    "venue": "Youth Workshop",
    "conversation_id": "CON-b485f0ba-4723-489a-8450-8ae91158ba65",
    "member_id": "MEM-d3b6f45d-f04d-4d0e-9674-748fdf58513f"
  },
  {
    "description": "Our ability to measure time has become so good that we've run into a problem. The Earth isn't very accurate. Which is awkward. Leap Seconds are our current best effort to bridge the widening gap between Atomic Time and the actual rotation of the Earth. But the addition of a leap second causes no-end of headaches for technology systems that often prefer to ignore it. In this talk I'd like to trace the history of Leap Seconds, how we deal with them and the ongoing debate about their future.",
    "title": "A brief history of Leap Seconds",
    "map_link": null,
    "latlon": null,
    "speaker": "John Dalziel",
    "end_date": "2018-09-02 13:00:00",
    "source": "database",
    "end_time": "13:00",
    "type": "talk",
    "slug": "a-brief-history-of-leap-seconds",
    "id": 32,
    "link": "https://www.emfcamp.org/line-up/2018/32",
    "user_id": 300,
    "may_record": true,
    "start_date": "2018-09-02 12:30:00",
    "start_time": "12:30",
    "is_fave": false,
    "venue": "Stage B",
    "conversation_id": "CON-cddd4403-b340-4c72-b27d-dd31074109fb",
    "member_id": "MEM-5df5f164-66d0-4d70-83b6-ddfdeec49836"
  },
  {
    "age_range": "",
    "cost": "",
    "description": "Are you a current or former trustee or director of a hackspace? Are you running a fledgling hackspace dealing with growth issues? Or do you have knowledge and insight to pass on? Let's meet up for a round table discussion!",
    "title": "Hackspaces round table",
    "map_link": null,
    "latlon": null,
    "equipment": "N/A",
    "speaker": "Iulian Arcus",
    "end_date": "2018-08-31 20:30:00",
    "source": "database",
    "end_time": "20:30",
    "type": "workshop",
    "slug": "hackspaces-round-table",
    "id": 437,
    "link": "https://www.emfcamp.org/line-up/2018/437",
    "user_id": 1462,
    "may_record": false,
    "start_date": "2018-08-31 18:30:00",
    "start_time": "18:30",
    "is_fave": false,
    "venue": "Workshop 1",
    "conversation_id": "CON-87c1e100-7f1b-4861-a631-fc286a110c16",
    "member_id": "MEM-3aea36f7-4ae7-4fba-872a-41caafa32953"
  },
  {
    "description": "For both SW and HW hacking, SAT and SMT solvers and their associated toolchains could be used to automate a lot of boring tasks for you, getting you to the next stage of that exploit chain you have been working on, or just helping you make sure there are no exploitable bugs in your soft- or hardware. In this talk I will go into what SAT and SMT solvers are, what kind of solvers are out there and give some practical examples in using them both to find, e.g. crack codes or bugs in systems. In particular, I will showcase some interesting use-cases of SAT solvers for cryptography, SMT solvers for puzzle-solving, and concolic execution (using SMT solvers) for automated bug-finding.\r\n\r\nMate Soos has been developing the CryptoMiniSat SAT solver for over 7 years that has is used in many places both in academia and industry and he helps maintain the SMT solver STP that is widely used in both industry and research. ",
    "title": "Hacking using SAT and SMT solvers",
    "map_link": null,
    "latlon": null,
    "speaker": "Mate Soos",
    "end_date": "2018-09-01 14:10:00",
    "source": "database",
    "end_time": "14:10",
    "type": "talk",
    "slug": "hacking-using-sat-and-smt-solvers",
    "id": 412,
    "link": "https://www.emfcamp.org/line-up/2018/412",
    "user_id": 1393,
    "may_record": true,
    "start_date": "2018-09-01 13:40:00",
    "start_time": "13:40",
    "is_fave": false,
    "venue": "Stage C",
    "conversation_id": "CON-0e4dd5f1-002b-4ca8-b1d0-701f6400ca35",
    "member_id": "MEM-1d945b87-b7ca-4a4b-bbd3-4c052d2ac545"
  },
  {
    "description": "BrightSign is an assistive wearable technology designed to translate custom hand gestures to text and speech by employing advanced machine learning software. It aims to give people who are non-verbal full control over how they communicate. Sign language and speech can be personalised to a chosen voice, accent or language, making BrightSign applicable on a global level. ",
    "title": "BrightSign: Gesture Recognition and Talking Gloves",
    "map_link": null,
    "latlon": null,
    "speaker": "Rehana Al-Soltane & Ed Hill",
    "end_date": "2018-09-01 18:00:00",
    "source": "database",
    "end_time": "18:00",
    "type": "talk",
    "slug": "brightsign-gesture-recognition-and-talking-gloves",
    "id": 539,
    "link": "https://www.emfcamp.org/line-up/2018/539",
    "user_id": 1817,
    "may_record": true,
    "start_date": "2018-09-01 17:30:00",
    "start_time": "17:30",
    "is_fave": false,
    "venue": "Stage C",
    "conversation_id": "CON-038d1c6f-2fd8-4b9e-9e35-87cd6bcd12e0",
    "member_id": "MEM-ab5a0c8f-fbec-4e9d-bd1c-823f857421e5"
  },
  {
    "description": "Chap Hop Performance featuring: off the hoof rapping, horses, tea, trousers...",
    "title": "Professor Elemental",
    "map_link": null,
    "latlon": null,
    "speaker": "Professor Elemental",
    "end_date": "2018-08-31 21:50:00",
    "source": "database",
    "end_time": "21:50",
    "type": "performance",
    "slug": "professor-elemental",
    "id": 525,
    "link": "https://www.emfcamp.org/line-up/2018/525",
    "user_id": 1208,
    "may_record": false,
    "start_date": "2018-08-31 21:00:00",
    "start_time": "21:00",
    "is_fave": false,
    "venue": "Stage B",
    "conversation_id": "CON-3d8d2672-c8c2-4d02-8236-726a9f004830",
    "member_id": "MEM-08cf0339-ed2b-407c-a218-2832efd801af"
  },
  {
    "description": "The Large Hadron Collider is the latest step in the continuing endeavour of particle physicists to understand our universe. Colliding hydrogen nuclei 40 million times every second the LHC is a powerful microscope looking into the world of the microcosm.  Experiments like ATLAS are detecting the products of these collisions. The large amount of data generated by these detectors are analysed by an international collaboration of physicists and have led already to important insights.\r\nWhere are we going next after the Nobel Prize winning discovery of the Higgs Boson?\r\nI will talk about current particle physics research, the ongoing hunt for Dark Matter and some of the technical challenges phased by experiments operating at this amazing machine.\r\n\r\n",
    "title": "Hunting for (un)known particles",
    "map_link": null,
    "latlon": null,
    "speaker": "Andreas Korn",
    "end_date": "2018-09-02 16:00:00",
    "source": "database",
    "end_time": "16:00",
    "type": "talk",
    "slug": "hunting-for-un-known-particles",
    "id": 469,
    "link": "https://www.emfcamp.org/line-up/2018/469",
    "user_id": 1485,
    "may_record": true,
    "start_date": "2018-09-02 15:30:00",
    "start_time": "15:30",
    "is_fave": false,
    "venue": "Stage C",
    "conversation_id": "CON-21e514f2-f754-4844-b588-d83e0aabb0d1",
    "member_id": "MEM-2c110530-9404-40db-bb2d-2a0c2dcdf262"
  },
  {
    "description": "When I learned the news that I had somewhat accidentally become the owner of a Decommissioned, 12 Storey High, Late Soviet Era, Water Tower in Latvia: naturally my first question was 'Could I use it to prop up a Buran?' (The USSR's equivalent of the US Space Shuttle)...  and If I'd have asked that question to Woking District council, then I'm guessing the answer would be a list of regulations that would contravene - but in Latvia, the answer was 'Yes, it is your tower so you can do what you like with it...'\r\n\r\nAnd so I had a challenge to work out what could and should be done with the tower and in very British tradition a list of 101 Hacks for a Water Tower was started, which was very rapidly joined by a sister list of 101 Ways to Kill Yourself on Water Tower.\r\n\r\nIn this talk I share some of the journey of exploration into the wonderful world of Water Towers, Soviet Engineering, the Baltics, and a bit of family history. This takes us from the British Water Tower Appreciation Society to Siberia and the SS, whilst taking part in a documentary, getting involved in an Olympic bid, making music, setting up an amateur radio station, breaking records (and a drone) on the tower on the way and much more.\r\n\r\nThe talk is generally light hearted, with a balance of education and amusement. ",
    "title": "101 Hacks for Late Soviet Water Towers",
    "map_link": null,
    "latlon": null,
    "speaker": "Ben Fitzgerald",
    "end_date": "2018-08-31 14:00:00",
    "source": "database",
    "end_time": "14:00",
    "type": "talk",
    "slug": "101-hacks-for-late-soviet-water-towers",
    "id": 229,
    "link": "https://www.emfcamp.org/line-up/2018/229",
    "user_id": 134,
    "may_record": true,
    "start_date": "2018-08-31 13:30:00",
    "start_time": "13:30",
    "is_fave": false,
    "venue": "Stage A",
    "conversation_id": "CON-40e7a4e8-b6b2-4570-bffb-e55339408d53",
    "member_id": "MEM-a69d5b7f-dc9c-4096-9161-7f6beec825d0"
  },
  {
    "age_range": "~12-90",
    "cost": "15 GBP max. more likely 10",
    "description": "What makes a good knot?\r\nTying the 5 most usefull knots, what they are good for, what is dangerous about them and how to untie them. \r\nHands-on-display of different types of rope and their applications.\r\nSplicing layed rope. \r\nSplicing techniques for modern style dyneema ropes. \r\n\r\nAll material and tools will be provided as a kit.",
    "title": "Knots, Ropes and Splices 101 ",
    "map_link": null,
    "latlon": null,
    "equipment": "may bring but don't have too: ropes of all colors and sizes, scissors and knives, lighters, sailmakers tools",
    "speaker": "Robert Nixdorf",
    "end_date": "2018-09-02 16:20:00",
    "source": "database",
    "end_time": "16:20",
    "type": "workshop",
    "slug": "knots-ropes-and-splices-101",
    "id": 452,
    "link": "https://www.emfcamp.org/line-up/2018/452",
    "user_id": 1473,
    "may_record": false,
    "start_date": "2018-09-02 13:20:00",
    "start_time": "13:20",
    "is_fave": false,
    "venue": "Workshop 4",
    "conversation_id": "CON-00ea854c-42ea-4c72-8e0d-4b40d799e088",
    "member_id": "MEM-d0e26d37-60bc-4c0f-b73d-026f1e2c242e"
  },
  {
    "description": "Durham University Electric Motorsport (DUEM) are Britain's leading and most established solar car team. Yes, you read that right: we've built a solar car ironically in a country not renowned for its...Sun! The team of 50 students spent a number of years engineering their latest solar car. This is their story of blood, sweat and carbon as they built up to racing 3000km across the outback entirely on solar power. I guess you can say their other car really is a solar car!",
    "title": "Racing the Sun",
    "map_link": null,
    "latlon": null,
    "speaker": "Tobias McBride",
    "end_date": "2018-09-02 20:00:00",
    "source": "database",
    "end_time": "20:00",
    "type": "talk",
    "slug": "racing-the-sun",
    "id": 2,
    "link": "https://www.emfcamp.org/line-up/2018/2",
    "user_id": 284,
    "may_record": true,
    "start_date": "2018-09-02 19:30:00",
    "start_time": "19:30",
    "is_fave": false,
    "venue": "Stage C",
    "conversation_id": "CON-c0a8b6a5-586f-46f7-a400-722114a14f85",
    "member_id": "MEM-d4825479-32ea-442e-9165-7752726af325"
  },
  {
    "description": "This talk will provide an introduction to software-defined radio and start by asking why we need SDR, before proceeding to taking take a look at the key components. The open hardware LimeSDR platform — which is being used to provide a GSM network at EMF Camp — will be covered in some detail as we explore its high level architecture. \r\n\r\nDetails of example applications will be provided and there will be short demonstrations of transmitting an LTE signal, and DVB-S transmit and receive.",
    "title": "An Introduction to Software-Defined Radio (SDR)",
    "map_link": null,
    "latlon": null,
    "speaker": "Dr Danny Webster ",
    "end_date": "2018-09-01 16:40:00",
    "source": "database",
    "end_time": "16:40",
    "type": "talk",
    "slug": "an-introduction-to-software-defined-radio-sdr",
    "id": 505,
    "link": "https://www.emfcamp.org/line-up/2018/505",
    "user_id": 1584,
    "may_record": true,
    "start_date": "2018-09-01 16:10:00",
    "start_time": "16:10",
    "is_fave": false,
    "venue": "Stage B",
    "conversation_id": "CON-0bb31250-942e-4216-8b3c-3cc5450baf99",
    "member_id": "MEM-5eb22c97-f299-4a00-b926-699872260a46"
  },
  {
    "age_range": "9-99",
    "cost": "free",
    "description": "Create a live dance performance using brainwave data and coding! A 1.5 hour workshop using scratch and OSC data (prerecorded) from the EEG emotiv headset. The participants will manipulate the data to create their own data visualisations in Scratch v3 (due to be released Aug 2018) or Music using Sonic Pi. We will focus on creativity, play, and community with the underlying theme of digital ethics. Each participant will be given the opportunity to wear the headset and see their own data by signing a disclaimer during the workshop [explain why]. We will take the visualisations created during the workshops and combine these into a short live performance to end the workshop.\r\n\r\nDBS: I have an enhanced DBS",
    "title": "The Singularity: dance, digital ethics and datavis coding workshop",
    "map_link": null,
    "latlon": null,
    "equipment": "Attendee Equipment Laptop with the capability to run: Scratch3 (online) sonicPi (optional) Wifi",
    "speaker": "Genevieve Smith-Nunes",
    "end_date": "2018-09-02 20:00:00",
    "source": "database",
    "end_time": "20:00",
    "type": "workshop",
    "slug": "the-singularity-dance-digital-ethics",
    "id": 198,
    "link": "https://www.emfcamp.org/line-up/2018/198",
    "user_id": 1188,
    "may_record": false,
    "start_date": "2018-09-02 18:00:00",
    "start_time": "18:00",
    "is_fave": false,
    "venue": "Workshop 2",
    "conversation_id": "CON-627dd901-0f5a-4053-a31c-5acd1d87a9e6",
    "member_id": "MEM-de59a771-5174-4cb6-881b-67c863e30e1f"
  },
  {
    "description": "We spent thousands of pounds and hundreds of hours building the most awesome 110kg combat robot ever to be dreamt up and then the BBC goes and cancels Robot Wars. Here's the story how Deadlock was thought up, designed and made by 3 people in a garage as well as what our plans are now.",
    "title": "Life after Robot Wars",
    "map_link": null,
    "latlon": null,
    "speaker": "Robert Karpinski",
    "end_date": "2018-09-02 10:30:00",
    "source": "database",
    "end_time": "10:30",
    "type": "talk",
    "slug": "life-after-robot-wars",
    "id": 83,
    "link": "https://www.emfcamp.org/line-up/2018/83",
    "user_id": 103,
    "may_record": true,
    "start_date": "2018-09-02 10:00:00",
    "start_time": "10:00",
    "is_fave": false,
    "venue": "Stage A",
    "conversation_id": "CON-9812d557-3805-44ba-9b04-84196d7df162",
    "member_id": "MEM-2dc8e13b-bafc-49d7-b368-9dc9404a8909"
  },
  {
    "description": "Everyone's familiar with the science fiction scenarios of \"AI gone wrong\", but what's the reality of the situation? This talk introduces AI Safety, a field of research which analyses the actual problems we're likely to face with powerful AI systems, and tries to find technical solutions to them, so we can ensure that artificial general intelligence is safe and beneficial for humanity.",
    "title": "AI Safety",
    "map_link": null,
    "latlon": null,
    "speaker": "Rob Miles",
    "end_date": "2018-08-31 15:20:00",
    "source": "database",
    "end_time": "15:20",
    "type": "talk",
    "slug": "ai-safety",
    "id": 159,
    "link": "https://www.emfcamp.org/line-up/2018/159",
    "user_id": 1092,
    "may_record": true,
    "start_date": "2018-08-31 14:50:00",
    "start_time": "14:50",
    "is_fave": false,
    "venue": "Stage B",
    "conversation_id": "CON-18dc03c6-0fd5-4fec-8562-2b4ed6942e05",
    "member_id": "MEM-6868b7b8-6230-43db-ad52-b0f8c041dd98"
  },
  {
    "age_range": "Under 16s should be accompanied",
    "cost": "",
    "description": "Bookbinding and boxmaking (making slipcases, hinged boxes for books etc) use a small set of common materials and tools to make some interesting, useful and beautiful structures.\r\n\r\nThere are some really simple and accessible but interesting techniques in the craft that I think maker folks may not have come across, and are really handy for (for example) rapidly prototyping enclosures with nothing but a scalpel, some PVA and cardboard.\r\n\r\nBookbinding involves some beautiful materials as well - it's not so hard to make your Maplin (RIP) plastic enclosures look less beige if you know how to put them together.\r\n\r\nPlease note: I'm also running and introduction to bookbinding workshop over the weekend that will cross over with this - probably come to one or the other.",
    "title": "Bookbinding and Boxmaking Techniques for Hackers",
    "map_link": null,
    "latlon": null,
    "equipment": "If you have any paper craft tools (scalpel, cutting mat etc) or materials you want to experiment with, bring them along",
    "speaker": "Ben Dornan",
    "end_date": "2018-09-01 15:10:00",
    "source": "database",
    "end_time": "15:10",
    "type": "workshop",
    "slug": "bookbinding-and-boxmaking-techniques-for-hackers",
    "id": 293,
    "link": "https://www.emfcamp.org/line-up/2018/293",
    "user_id": 50,
    "may_record": false,
    "start_date": "2018-09-01 13:10:00",
    "start_time": "13:10",
    "is_fave": false,
    "venue": "Workshop 3",
    "conversation_id": "CON-d686129c-c6d2-4226-9009-de06c61b14ab",
    "member_id": "MEM-b1af09be-9813-476c-adc5-4eb68b949503"
  },
  {
    "description": "The Internet, mobile telephony and mobile have radically changed the way people behave in emergencies and disasters across the world. In particular they have given people new tools and opportunities to find and help each other. From the Humanitarian OpenStreetMap team building maps on the fly in the developing world, through mobile charging stations for refugees to self organised responses to natural and man-made disasters. Communities across the globe are becoming more resilient and with the application of AI, robotics and drone technologies the outlook is, surprisingly for such a depressing subject, positive. ",
    "title": "How the Internet has changed emergencies",
    "map_link": null,
    "latlon": null,
    "speaker": "Ben Proctor",
    "end_date": "2018-09-01 18:40:00",
    "source": "database",
    "end_time": "18:40",
    "type": "talk",
    "slug": "how-the-internet-has-changed-emergencies",
    "id": 157,
    "link": "https://www.emfcamp.org/line-up/2018/157",
    "user_id": 945,
    "may_record": true,
    "start_date": "2018-09-01 18:10:00",
    "start_time": "18:10",
    "is_fave": false,
    "venue": "Stage C",
    "conversation_id": "CON-b6b72ec1-dc50-4824-99f6-9c03d798356f",
    "member_id": "MEM-3944ae28-659d-41f7-80c2-4593ff4941d7"
  },
  {
    "description": "How does social media mess with our relationship to reality?\r\nWhat the hell happened to the truth?\r\nCan you manufacture authenticity?\r\nShould I be scared of the bots?\r\nCan we believe our eyes any more?\r\nWill Twitter destroy the world?\r\n\r\nArtist Eric Drass (aka shardcore) may or may not answer these questions.",
    "title": "The Truth, Post-Truth & Nothing Like The Truth",
    "map_link": null,
    "latlon": null,
    "speaker": "Eric Drass aka shardcore",
    "end_date": "2018-09-01 20:00:00",
    "source": "database",
    "end_time": "20:00",
    "type": "talk",
    "slug": "the-truth-post-truth-nothing-like-the-truth",
    "id": 413,
    "link": "https://www.emfcamp.org/line-up/2018/413",
    "user_id": 1394,
    "may_record": true,
    "start_date": "2018-09-01 19:30:00",
    "start_time": "19:30",
    "is_fave": false,
    "venue": "Stage B",
    "conversation_id": "CON-933151f6-89e6-490b-9c15-b4322adda4ed",
    "member_id": "MEM-d67086eb-ab7c-473a-a5c1-58dba935ccaf"
  },
  {
    "description": "The first self-balancing skateboard was made by Ben Smithers in Norfolk around 2007. This inspired me to build my own in 2008 and along the way I discovered how to program in C, Arduino's, IMU fusion algorithms, not realising this would be as hard as it turned out to be. A gyro was £160 back then, a 3 axis IMU is now about £5, how things have changed.\r\n\r\nSince then I have built one and two wheeled boards, 2 wheeled wheelchair prototype and many others, documented on YT and Instructables, long before such gadgets came out from China, culminating in a 3000W hubmotor 1 wheeled motorcycle which I plan to bring to the camp and demonstrate. I test these on Pembrey and the famous Pendine Sands beaches in Wales, with video clips I can present.\r\n\r\nImposter credentials: I am a hospital doctor not an engineer. Electronic hobbyist. Until I started this sequence of machines I had only coded in BASIC aged 14 on my Sinclair ZX81 (built from a kit obviously).",
    "title": "10 years building self-balancing ride on robots",
    "map_link": null,
    "latlon": null,
    "speaker": "John Dingley",
    "end_date": "2018-09-02 18:00:00",
    "source": "database",
    "end_time": "18:00",
    "type": "talk",
    "slug": "10-years-building-self-balancing-ride-on-robots",
    "id": 366,
    "link": "https://www.emfcamp.org/line-up/2018/366",
    "user_id": 1338,
    "may_record": true,
    "start_date": "2018-09-02 17:30:00",
    "start_time": "17:30",
    "is_fave": false,
    "venue": "Stage B",
    "conversation_id": "CON-0bc76557-706c-41ba-a3c3-aaf88a968e1f",
    "member_id": "MEM-fa963d4f-6bc9-4ffd-a643-3dd6134dbcc7"
  },
  {
    "description": "Poetoid Lyricam is a Raspberry Pi, camera, thermal printer and batteries housed in the body of a 1970s Polaroid camera. The pictures it takes are fed to a neural net which generates captions, these are then mangled and reformatted to resemble a poem, which emerges from the printer on the back.\r\n\r\nThis talk will cover how it works and why it exists. With a look at my past and present experiences with text generation, Twitter bots, AI, and possibly going back as far as Dadaism and the cut-up technique. There will likely be a demonstration, and poetry readings.",
    "title": "Poetoid Lyricam: A Camera That Takes Poems",
    "map_link": null,
    "latlon": null,
    "speaker": "Barney Livingston",
    "end_date": "2018-09-01 19:20:00",
    "source": "database",
    "end_time": "19:20",
    "type": "talk",
    "slug": "poetoid-lyricam-a-camera-that-takes-poems",
    "id": 386,
    "link": "https://www.emfcamp.org/line-up/2018/386",
    "user_id": 406,
    "may_record": true,
    "start_date": "2018-09-01 18:50:00",
    "start_time": "18:50",
    "is_fave": false,
    "venue": "Stage C",
    "conversation_id": "CON-8696abed-a103-4b3f-a876-3be1f46788d4",
    "member_id": "MEM-7aeab8ad-a538-45f3-bc9c-76ee34c8d29f"
  },
  {
    "age_range": "16+ (Old enough to use a soldering iron and cutters)",
    "cost": "£10",
    "description": "A soldering workshop with well-established and tested kits that I design and sell myself. I am a qualified electronic engineer with programming, PCB layout and electronic prototyping experience. This will enable me to help attendees with soldering and troubleshooting during the workshop. \r\nAttendees will be able to follow fully featured step-by-step instructions, including hi-res build photos accessible through the internet on any browser. Care has been taken to make the PCBs easy to assemble.\r\nDuring the workshop I would like to point out:\r\n-\tWhat is a PCB anyway?\r\n-\tSolder, why are there so many different types? What should I use?\r\n-\tSoldering best practices and handy tips i.e. how to apply heat and solder to a joint.\r\n-\tVariations in components and the distinctions between polarised and unpolarised parts.\r\n\r\nDuring the workshop I would like to have attendees assemble one easy kit and one intermediate kit. The easy kit is a classic noisemaker/synth circuit, the mini APC (Atari Punk Console) including a small speaker. \r\nThe intermediate kit, which most beginners can handle after soldering the mini APC is a simple 8 step sequencer. The sequencer is able to sequence the mini APC by way of control voltages and gate signals, if all goes well the tent would be filled with people making 8 step musical loops.",
    "title": "Soldering, beginner to intermediate synth kit workshop",
    "map_link": null,
    "latlon": null,
    "equipment": "Something to access a browser (tablet/phone/laptop), Personal tools/soldering iron.",
    "speaker": "Darren Blaxcell - rakits.co.uk",
    "end_date": "2018-09-02 13:00:00",
    "source": "database",
    "end_time": "13:00",
    "type": "workshop",
    "slug": "soldering-beginner-to-intermediate-synth-kit-workshop",
    "id": 194,
    "link": "https://www.emfcamp.org/line-up/2018/194",
    "user_id": 1183,
    "may_record": false,
    "start_date": "2018-09-02 10:00:00",
    "start_time": "10:00",
    "is_fave": false,
    "venue": "Workshop 3",
    "conversation_id": "CON-e5ebfbf6-0290-4954-bef6-c7d946a0ad35",
    "member_id": "MEM-331a1b58-9ea1-49b2-af03-45c4515ef1db"
  },
  {
    "description": "An episode of the Bricolage Podcast, interviewing interesting people LIVE on stage.\r\n\r\nhttps://www.bricolage.run",
    "title": "Bricolage: a makers podcast LIVE",
    "map_link": null,
    "latlon": null,
    "speaker": "Dominic Morrow",
    "end_date": "2018-08-31 15:10:00",
    "source": "database",
    "end_time": "15:10",
    "type": "talk",
    "slug": "bricolage-a-makers-podcast-live",
    "id": 387,
    "link": "https://www.emfcamp.org/line-up/2018/387",
    "user_id": 315,
    "may_record": true,
    "start_date": "2018-08-31 14:40:00",
    "start_time": "14:40",
    "is_fave": false,
    "venue": "Stage C",
    "conversation_id": "CON-ed84540f-2ac2-48a1-8d47-dbe366678915",
    "member_id": "MEM-b53520ec-c65a-4dfb-93d7-1bf0b445d2c7"
  },
  {
    "age_range": "12+",
    "cost": "",
    "description": "To anyone without an understanding of how they work, cryptic crossword clues can be completely impenetrable. Two enthusiastic crossword solvers (and setters) will initiate you in the mysterious ways of how cryptic clues work, provide some practise examples and get you solving in no time!",
    "title": "Introduction to Cryptic Crosswords",
    "map_link": null,
    "latlon": null,
    "equipment": "",
    "speaker": "Katie Steckles",
    "end_date": "2018-09-02 20:00:00",
    "source": "database",
    "end_time": "20:00",
    "type": "workshop",
    "slug": "introduction-to-cryptic-crosswords",
    "id": 114,
    "link": "https://www.emfcamp.org/line-up/2018/114",
    "user_id": 468,
    "may_record": false,
    "start_date": "2018-09-02 19:00:00",
    "start_time": "19:00",
    "is_fave": false,
    "venue": "Workshop 4",
    "conversation_id": "CON-1374e741-e983-4112-9fa6-5e1ebcea1c1d",
    "member_id": "MEM-639e041b-4949-4ad4-b6e3-327c74ee126b"
  },
  {
    "description": "The talk will follow Matt’s progress through his career designing, developing and deploying animatronic control systems from the mid 1990's to present day, with the goal to make animatronic performances more lifelike and simpler for the puppeteer.\r\n\r\nIncluding creations from films such as: Lost In Space, Harry Potter, The Worlds End and the latest Star Wars episodes including The Force Awakens, Rogue One, The Last Jedi and Solo.\r\n\r\nPossible Q&A to follow??",
    "title": "Animatronics and robots in the movies with Matt Denton",
    "map_link": null,
    "latlon": null,
    "speaker": "Matt Denton",
    "end_date": "2018-09-01 19:00:00",
    "source": "database",
    "end_time": "19:00",
    "type": "talk",
    "slug": "animatronics-and-robots-in-the-movies-with-matt-denton",
    "id": 492,
    "link": "https://www.emfcamp.org/line-up/2018/492",
    "user_id": 1541,
    "may_record": true,
    "start_date": "2018-09-01 18:30:00",
    "start_time": "18:30",
    "is_fave": false,
    "venue": "Stage A",
    "conversation_id": "CON-328201ef-3953-498d-97c6-afd18ea8d116",
    "member_id": "MEM-00a51da5-aaa7-4b07-9bc9-199db47863ce"
  },
  {
    "description": "Everyone has visited a hacker conference, but not many have seen it through the eyes of an organizer. As someone who has worked hard behind the scenes to make SHA2017 one of the more awesome events, I am giving you a firsthand experience on the good, the bad and the ugly of event organisation.",
    "title": "SHA2017 - Behind the scenes of a hacker conference",
    "map_link": null,
    "latlon": null,
    "speaker": "Julius ter Pelkwijk",
    "end_date": "2018-09-02 17:20:00",
    "source": "database",
    "end_time": "17:20",
    "type": "talk",
    "slug": "sha2017-behind-the-scenes-of-a-hacker-conference",
    "id": 14,
    "link": "https://www.emfcamp.org/line-up/2018/14",
    "user_id": 111,
    "may_record": true,
    "start_date": "2018-09-02 16:50:00",
    "start_time": "16:50",
    "is_fave": false,
    "venue": "Stage B",
    "conversation_id": "CON-2a4c539a-8f8f-42d2-81a8-f5f1b72b9446",
    "member_id": "MEM-90ab4f10-c13f-45ef-8fd1-2f0be5aa3e1a"
  },
  {
    "age_range": "3+",
    "cost": "N/A",
    "description": "What can you build with straws and building blocks? Let your imagination run free with this creative drop in workshop where you can play and build anything from rockets to trees, obstacle courses to hats and whatever else takes your fancy.  ",
    "title": "Let's build!",
    "map_link": null,
    "latlon": null,
    "equipment": "N/A",
    "speaker": "Kate Davis",
    "end_date": "2018-08-31 14:20:00",
    "source": "database",
    "end_time": "14:20",
    "type": "youthworkshop",
    "slug": "lets-build",
    "id": 496,
    "link": "https://www.emfcamp.org/line-up/2018/496",
    "user_id": 1248,
    "may_record": false,
    "start_date": "2018-08-31 13:20:00",
    "start_time": "13:20",
    "is_fave": false,
    "venue": "Youth Workshop",
    "conversation_id": "CON-3449c6b4-d446-4175-857c-4905a22833cf",
    "member_id": "MEM-8d6f0256-cdb0-4a6f-bde8-bdbc01f7d862"
  },
  {
    "description": "ArduTouch makes way cool sound, music, and noise!  It is an open hardware, Arduino-compatible musical instrument with a touch keyboard, amp, and speaker.  It is easy to build -- designed for total beginners to learn to solder together.  It provides a very low cost, yet powerful, method for making music/sound/noise, and a fun way to learn Digital Signal Processing (DSP) for generating music/sound/noise. This talk will show beginners how the ArduTouch music synthesizer kit makes use of DSP to create its large diversity of music/sound/noise. Mitch will also explain how the touch keyboard works, as well as the cheap amplifier/speaker built into the board. The ArduTouch Arduino library works on any Arduino board and Mitch will demonstrate how to make use of this library to create your own unique synthesizers -- both by hacking some of the many examples it comes with, and by making use of its high-level functions. This talk will also include a demo of some of the music the ArduTouch can make, as well as some wonderful nasty noise!\r\n\r\nA workshop for soldering together ArduTouch music synthesizer kits will be held before the talk on Sunday at 1pm at the Hardware Hacking Area (Camp: G).",
    "title": "ArduTouch music synthesizer -- music generation for newbies",
    "map_link": null,
    "latlon": null,
    "speaker": "Mitch Altman",
    "end_date": "2018-09-02 17:10:00",
    "source": "database",
    "end_time": "17:10",
    "type": "talk",
    "slug": "ardutouch-music-synthesizer-music-generation-for-newbies",
    "id": 24,
    "link": "https://www.emfcamp.org/line-up/2018/24",
    "user_id": 162,
    "may_record": true,
    "start_date": "2018-09-02 16:10:00",
    "start_time": "16:10",
    "is_fave": false,
    "venue": "Stage C",
    "conversation_id": "CON-5a7639c2-a27b-45fc-b62f-6f0ea14c4cc9",
    "member_id": "MEM-9c553455-f3c5-42a4-ad9e-fcda274c9677"
  },
  {
    "description": "As a member of the team who brought WaveNet into production, I would like to give an insight into the technical challenges and the technology which powers Google's voice, and how this type of algorithms could be used to solve other interesting problems.\r\n\r\nWaveNet is a machine learning algorithm developed at (Google) DeepMind which was the first to obtain human-like quality of voice directly modeling waveforms. You can read more about it here: \r\n\r\nhttps://deepmind.com/blog/wavenet-generative-model-raw-audio/ \r\nhttps://en.wikipedia.org/wiki/WaveNet\r\n\r\nSince the original paper was published, there has been several developments to substantially speed up audio generation (several order of magnitude) in order to put it into production, and it is now powering Google's assistant voice in several languages. See also: \r\n\r\nhttps://deepmind.com/blog/wavenet-launches-google-assistant/ \r\nhttps://deepmind.com/blog/high-fidelity-speech-synthesis-wavenet/ \r\nhttps://arxiv.org/abs/1802.08435\r\n\r\nNote that the technology is not limited to audio and can pretty much work with any signal, but this is so new that we're just scratching the surface of the potential applications.\r\n\r\nIn my talk I will be talking about the basic tech, what it took to get it into production and the more recent developments. I would also like to give a few suggestions and hints on how to reproduce these results: the latest version (WaveRNN) is rather simple to implement and yet very powerful.",
    "title": "WaveNet, what's behind Google's voice",
    "map_link": null,
    "latlon": null,
    "speaker": "Norman Casagrande",
    "end_date": "2018-09-01 19:20:00",
    "source": "database",
    "end_time": "19:20",
    "type": "talk",
    "slug": "wavenet-whats-behind-googles-voice",
    "id": 406,
    "link": "https://www.emfcamp.org/line-up/2018/406",
    "user_id": 1386,
    "may_record": true,
    "start_date": "2018-09-01 18:50:00",
    "start_time": "18:50",
    "is_fave": false,
    "venue": "Stage B",
    "conversation_id": "CON-23f8caa1-7be9-4dc9-a3cb-f9e9522327f2",
    "member_id": "MEM-2b713b71-ae56-47fa-b003-fe062c1131d2"
  },
  {
    "description": "A while ago, I started building a robot that would find the developer who'd broken the build and call them a cock. Because of depression, I never finished it, and the robot came out weird anyway. More recently I started on a cuckoo clock that calls you a pillock, among other things. This talk will be an attempt to explore why I keep building abusive machines. There will also be live demonstrations and fulmination about ESP8266 hardware.",
    "title": "Out daemons, out! Exploring depression through sweary automata.",
    "map_link": null,
    "latlon": null,
    "speaker": "J. Hawkes-Reed",
    "end_date": "2018-09-02 19:20:00",
    "source": "database",
    "end_time": "19:20",
    "type": "talk",
    "slug": "out-daemons-out-exploring-depression-through-sweary-automata",
    "id": 97,
    "link": "https://www.emfcamp.org/line-up/2018/97",
    "user_id": 501,
    "may_record": true,
    "start_date": "2018-09-02 18:50:00",
    "start_time": "18:50",
    "is_fave": false,
    "venue": "Stage B",
    "conversation_id": "CON-ddab3b70-f043-468e-a3e1-640ce77af185",
    "member_id": "MEM-041e37b3-4ecf-453a-b42c-4b516aff08c9"
  },
  {
    "age_range": "14+",
    "cost": "",
    "description": "Learn to dance with Oli and Jo, your resident dancing engineers, in a friendly, fun, judgement free environment. \r\n\r\nWe'll teach a beginner's Lindy hop lesson with some excellent (spurious) engineering analogies thrown in for good measure.\r\n\r\nNo experience necessary all experience welcome!",
    "title": "Swing dancing for engineers",
    "map_link": null,
    "latlon": null,
    "equipment": "None",
    "speaker": "jo franchetti",
    "end_date": "2018-08-31 21:30:00",
    "source": "database",
    "end_time": "21:30",
    "type": "workshop",
    "slug": "swing-dancing-for-engineers",
    "id": 517,
    "link": "https://www.emfcamp.org/line-up/2018/517",
    "user_id": 573,
    "may_record": false,
    "start_date": "2018-08-31 20:30:00",
    "start_time": "20:30",
    "is_fave": false,
    "venue": "Stage A",
    "conversation_id": "CON-3d63084a-3fc9-4b7e-adbf-4936a4e9f258",
    "member_id": "MEM-8c741d3a-3d0a-4073-9c1d-1f19f2ab1ff8"
  },
  {
    "age_range": "All ages",
    "cost": "None",
    "description": "Makerspaces are awesome! But unfortunately it's not always easy for people to access them. Women, BME (Black and minority ethnic) people, people with disabilities, older people, and people on low incomes are often under-represented in makerspaces. In the first part of this workshop I’ll share some of the ways that makerspaces are managing to include people from these groups. Then I'd love to hear your stories about any successes and challenges you've experienced with building inclusive and diverse makerspace communities. Even if you don't have any success stories, if your makerspace hasn't been able to spend much time on engagement, or if you're not even involved in makerspaces but are curious about technology engagement issues, you're welcome to come along!\r\n\r\nAfter EMF I’ll turn the information crowdsourced during the workshop into a zine so that other makerspaces can benefit from this advice :)",
    "title": "Building inclusive makerspaces",
    "map_link": null,
    "latlon": null,
    "equipment": "None",
    "speaker": "Em O'Sullivan",
    "end_date": "2018-09-02 11:00:00",
    "source": "database",
    "end_time": "11:00",
    "type": "workshop",
    "slug": "building-inclusive-makerspaces",
    "id": 88,
    "link": "https://www.emfcamp.org/line-up/2018/88",
    "user_id": 479,
    "may_record": false,
    "start_date": "2018-09-02 10:00:00",
    "start_time": "10:00",
    "is_fave": false,
    "venue": "Workshop 1",
    "conversation_id": "CON-13f5ece4-748f-48a0-8e40-de8f59c93ea3",
    "member_id": "MEM-b144ee46-e23a-48ac-9dea-ea31c1e53874"
  },
  {
    "description": "Nobel-prize winning Professor Richard Feynman is known not only for his dramatic contributions to theoretical physics, his teaching of physics and his testimony on the Challenger disaster, but also for his unconventional life. Noted for picking locks, questioning authority, and unapologetic playing of bongos, the physics superstar also dabbled in life drawing and testified to the acceptability of sexwork in the community. \r\n\r\nIn this talk, I'll mix comedy, physics and biographical details to explain why Feynman is famous (in a way suitable for people who haven't studied physics past school)  and also why we should beware of buying into his personality cult. ",
    "title": "Richard Feynman: Dick.",
    "map_link": null,
    "latlon": null,
    "speaker": "Scary Boots",
    "end_date": "2018-09-02 19:10:00",
    "source": "database",
    "end_time": "19:10",
    "type": "talk",
    "slug": "richard-feynman-dick",
    "id": 143,
    "link": "https://www.emfcamp.org/line-up/2018/143",
    "user_id": 455,
    "may_record": true,
    "start_date": "2018-09-02 18:50:00",
    "start_time": "18:50",
    "is_fave": false,
    "venue": "Stage A",
    "conversation_id": "CON-3b3007d6-805e-4895-9408-8fc5b8126c8c",
    "member_id": "MEM-ed62d45e-0d38-4571-9dbc-1be60ebf4975"
  },
  {
    "description": "A brief history of folklore and technology.\r\n\r\nAt EMF2016, I talked about numbers stations - mysterious, Cold War shortwave radio stations. After doing that talk, I realised that the thing that I find most interesting about the numbers stations is how they became an urban myth, a living legend of the networked age.\r\n\r\nFor EMF2018, I'll examine the intersections of technology and folklore. I'll have a look at examples of our old folklore and superstitions following us into the spaces created by new technologies, and I'll also be looking at new folk tales that arise from our technologies, from World War II gremlins to Slenderman and the new cults of AI and Big Data.",
    "title": "Things That Go Bump On The Net",
    "map_link": null,
    "latlon": null,
    "speaker": "Henry Cooke",
    "end_date": "2018-09-01 18:20:00",
    "source": "database",
    "end_time": "18:20",
    "type": "talk",
    "slug": "things-that-go-bump-on-the-net",
    "id": 425,
    "link": "https://www.emfcamp.org/line-up/2018/425",
    "user_id": 1408,
    "may_record": true,
    "start_date": "2018-09-01 17:50:00",
    "start_time": "17:50",
    "is_fave": false,
    "venue": "Stage A",
    "conversation_id": "CON-9dc77de4-f55e-4903-b9d1-fa1733fdbde5",
    "member_id": "MEM-62098a13-f9e3-41f6-a84f-03d75b9365bf"
  },
  {
    "description": "During the build up to the Apollo space programme, mathematically gifted women, typically African-American, worked in high-pressure ‘pools’ churning out answers to NASA’s seemingly impossible questions. They were known as ‘computers’.\r\n\r\nThree women challenged the status quo, demanding recognition, authority and respect. Katherine Johnson rose through the ranks to become one of NASA’s most respected mathematicians, Mary Jackson became the first qualified African-American female engineer in the USA and Dorothy Vaughan saw the coming of machine-based computers, becoming one of the world’s leading experts on programming.\r\n\r\nThis incredible true story charts the rise of these formidable scientists against the odds. Even today they are yet to receive the recognition they deserve and Hidden Figures takes great strides in correcting this.",
    "title": "Hidden Figures (PG)",
    "map_link": null,
    "latlon": null,
    "speaker": "EMF Film Festival",
    "end_date": "2018-09-02 22:30:00",
    "source": "database",
    "end_time": "22:30",
    "type": "performance",
    "slug": "hidden-figures-pg",
    "id": 535,
    "link": "https://www.emfcamp.org/line-up/2018/535",
    "user_id": 282,
    "may_record": false,
    "start_date": "2018-09-02 20:20:00",
    "start_time": "20:20",
    "is_fave": false,
    "venue": "Stage C",
    "conversation_id": "CON-4cf3eea9-cbb3-4f05-b48b-4a17367af253",
    "member_id": "MEM-77867ec5-3505-431b-bab0-baf97a678b78"
  },
  {
    "description": "High Street clothing brands are developing digital machines to replace mass production with mass customisation. They aim to give customers more choice, but still as consumers rather than makers. We will explore how makerspaces could adapt these tools for DIY clothes making and show some of the tools that are accessible now.\r\n\r\nUsing new technologies, you no longer need to be a specialist to design clothes and shoes that fit perfectly. We will bring examples, including 3D printed sandals, a shoe last and insole, laser cut fabric and 3D printed accessories.\r\n\r\nWe will also highlight textile related developments in makerspaces including the raspberry pi 3D body scanner scanner we helped design at BuildBrighton, and hope to inspire more people to get involved in shaping new DIY technology.\r\n\r\n",
    "title": "How to Use Digital Tools to Make Clothes and Shoes",
    "map_link": null,
    "latlon": null,
    "speaker": "Poppy and Jan Mosbacher",
    "end_date": "2018-09-01 15:00:00",
    "source": "database",
    "end_time": "15:00",
    "type": "talk",
    "slug": "how-to-use-digital-tools-to-make-clothes-and-shoes",
    "id": 232,
    "link": "https://www.emfcamp.org/line-up/2018/232",
    "user_id": 734,
    "may_record": true,
    "start_date": "2018-09-01 14:30:00",
    "start_time": "14:30",
    "is_fave": false,
    "venue": "Stage B",
    "conversation_id": "CON-1a65c039-a08d-4aa4-ac71-cdf808b6ac7c",
    "member_id": "MEM-cc1925d7-51bd-4ccf-a6ac-cba93cd80aeb"
  },
  {
    "description": "In this talk, I will talk about some interesting applications of maths to video games, including how the find the shortest possible route to complete Pac-Man and the 3- and 4-dimensional shapes that 2D video game characters spend their time on.",
    "title": "Maths and Video Games",
    "map_link": null,
    "latlon": null,
    "speaker": "Matthew Scroggs",
    "end_date": "2018-09-01 17:40:00",
    "source": "database",
    "end_time": "17:40",
    "type": "talk",
    "slug": "maths-and-video-games",
    "id": 13,
    "link": "https://www.emfcamp.org/line-up/2018/13",
    "user_id": 14,
    "may_record": true,
    "start_date": "2018-09-01 17:10:00",
    "start_time": "17:10",
    "is_fave": false,
    "venue": "Stage A",
    "conversation_id": "CON-340d13c5-df0c-4e08-9ccd-1c231ad1d655",
    "member_id": "MEM-1e170709-02f8-4001-bda6-2941b5086cde"
  },
  {
    "age_range": "Approx 13+",
    "cost": "",
    "description": "In recent years there has been massive renewed interest in electronic modular synthesizers among enthusiasts who want to get back to the roots of electronic music and enjoy their creative freedom and opportunities for experimentation. However, beginners are often prevented from getting started with modular synths by their costs and apparent complexity. This workshop will be a hands-on introduction to making interesting sounds from modular synthesizers for complete beginners. We will use the open source simulated modular synthesizer \"VCV Rack\" to allow the participants to get the feel of working with a real modular synthesizer on their computer.",
    "title": "Beginners guide to modular sound synthesizers using VCV Rack",
    "map_link": null,
    "latlon": null,
    "equipment": "Required: laptop (Windows, MacOS or Linux) & headphones. Optional, for more advanced: a MIDI Keyboard",
    "speaker": "Iain Sharp",
    "end_date": "2018-09-02 14:20:00",
    "source": "database",
    "end_time": "14:20",
    "type": "workshop",
    "slug": "beginners-guide-to-modular-sound-synthesizers-using-vcv-rack",
    "id": 255,
    "link": "https://www.emfcamp.org/line-up/2018/255",
    "user_id": 674,
    "may_record": false,
    "start_date": "2018-09-02 11:20:00",
    "start_time": "11:20",
    "is_fave": false,
    "venue": "Workshop 1",
    "conversation_id": "CON-b6a8cff5-4d01-4683-8a43-7dd5eff5e793",
    "member_id": "MEM-6b238011-da14-41e5-a639-7dd970a82180"
  },
  {
    "description": "This year we lost Ursula K Le Guin, a writer whose work began to shape my worldview when I first read her Earthsea books as a child. Here I attempt to pay tribute to the many ways Le Guin's work continued to change my life and discuss with examples how her writing has challenged and informed me as a reader, writer, scholar and activist, how she used the tools of science fiction and fantasy to great effect to inspire us to look at and describe the very real societies in which we live and where you might want to start if you are new to her work. There may be free pickles and almost certainly there will be spoilers (I would advise attendees to read Those Who Walk Away From Omelas as preparation: http://www.mccc.edu/pdf/eng102/Week%209/Text_LeGuin%20Ursula_Ones%20Who%20Walk%20Away%20From%20Omelas.pdf).",
    "title": "Full communism and free pickles - life lessons from Ursula K Le Guin",
    "map_link": null,
    "latlon": null,
    "speaker": "Jane Charlesworth",
    "end_date": "2018-08-31 18:40:00",
    "source": "database",
    "end_time": "18:40",
    "type": "talk",
    "slug": "full-communism-and-free-pickles",
    "id": 206,
    "link": "https://www.emfcamp.org/line-up/2018/206",
    "user_id": 986,
    "may_record": true,
    "start_date": "2018-08-31 18:10:00",
    "start_time": "18:10",
    "is_fave": false,
    "venue": "Stage B",
    "conversation_id": "CON-7e4756f7-ba36-4416-907f-69af1b750170",
    "member_id": "MEM-3422dafb-00e0-41a2-94e4-0476fb6176c2"
  },
  {
    "age_range": "9+",
    "cost": "nothing",
    "description": "Learn how to sew with electricity in this beginner and child friendly workshop. \r\n\r\nWe'll make squishable Sparkle Heart emoji badges adorned with LEDs and learn the about basics of electronics. We'll also get inspired by learning about some of the coolest makers, artists and electrical engineers working in the exciting field of e textiles.\r\n\r\nHelen Leigh is a maker, book author and lecturer. ",
    "title": "Adorable electronics: craft-based making",
    "map_link": null,
    "latlon": null,
    "equipment": "nothing",
    "speaker": "Helen Leigh",
    "end_date": "2018-09-01 19:30:00",
    "source": "database",
    "end_time": "19:30",
    "type": "workshop",
    "slug": "adorable-electronics-craft-based-making",
    "id": 126,
    "link": "https://www.emfcamp.org/line-up/2018/126",
    "user_id": 547,
    "may_record": false,
    "start_date": "2018-09-01 17:30:00",
    "start_time": "17:30",
    "is_fave": false,
    "venue": "Workshop 4",
    "conversation_id": "CON-70da6968-39e1-42fc-a67a-7142d3a659a7",
    "member_id": "MEM-f4f7c02a-3a01-4740-ae6b-ed305b483a18"
  },
  {
    "description": "Celebrating the first UK release of Hackers in blu-ray format, we are proud to present this classic on the big screen in full HD.\r\n\r\nJake Davis, now having left his alter-ego hacktivist ‘Topiary’ behind, will introduce the film, discussing the impressions it made on him and his peers as the lines between technology fact and fiction became ever more blurred.\r\n\r\n1995 cult-classic Hackers has gained a loyal following over the years, emerging as the best amongst the glut of 1990s hacker-culture movies. Its influences may not be immediately apparent, but characters such as Zero Cool and Acid Burn left a lasting impression on young minds.\r\n\r\nCostumes are encouraged, although rollerblading in a field can be challenging.",
    "title": "Special Presentation: Hackers (12)",
    "map_link": null,
    "latlon": null,
    "speaker": "EMF Film Festival",
    "end_date": "2018-09-01 22:20:00",
    "source": "database",
    "end_time": "22:20",
    "type": "performance",
    "slug": "special-presentation-hackers-12",
    "id": 533,
    "link": "https://www.emfcamp.org/line-up/2018/533",
    "user_id": 282,
    "may_record": false,
    "start_date": "2018-09-01 20:20:00",
    "start_time": "20:20",
    "is_fave": false,
    "venue": "Stage C",
    "conversation_id": "CON-c01ee802-3710-4675-9097-ba0689b26ffe",
    "member_id": "MEM-2a220c88-cbb8-474f-ae03-ec621b288e5d"
  },
  {
    "description": "Since the dawn of time (well, Web PKI) certificates have been used to ensure that internet users are actually talking to the websites they think they are.  Since civilisation began (well, the mid-90s) Certificate Authorities have been trusted to Do The Right Thing™ when issuing these certificates, and watch out for baddies trying to get their hands on certificates for domains they don’t own.  But what if a CA makes issuance mistakes?  What if a CA is hacked?  What if a CA is run by the baddies themselves?!  Who watches the watchers?\r\n\r\nEnter Certificate Transparency.\r\n\r\nCertificate Transparency is the latest internet security superhero.  Power: detecting certificate misissuance and certificate authority misbehaviour (oooh yeah).\r\n\r\nBut seriously, capes and undies-over-skin-tight-lycra aside, what exactly is Certificate Transparency?  How does it work?  Why should you care?  Is it even helping?  Come along to this talk and find out!",
    "title": "Who watches the watchers in Web PKI?",
    "map_link": null,
    "latlon": null,
    "speaker": "Kat Joyce",
    "end_date": "2018-09-01 16:10:00",
    "source": "database",
    "end_time": "16:10",
    "type": "talk",
    "slug": "who-watches-the-watchers-in-web-pki",
    "id": 352,
    "link": "https://www.emfcamp.org/line-up/2018/352",
    "user_id": 1323,
    "may_record": true,
    "start_date": "2018-09-01 15:40:00",
    "start_time": "15:40",
    "is_fave": false,
    "venue": "Stage C",
    "conversation_id": "CON-ff541896-d160-4ba1-9f2c-63c81f9a63ab",
    "member_id": "MEM-dbe0a697-0648-4bb4-9be1-5887489e30be"
  },
  {
    "description": "Machine learning is now ubiquitous in modern society. It's often used to solve problems such as spam email detection, natural language translation, to find images matching certain search criteria, or to make music recommendations. This talk will turn the problem around and examine the extent to which neural networks can emulate human creativity. We'll start by thinking about what it means for an algorithmic system to be creative. Then through examples we'll look at how techniques in machine learning can be used to compose original music and generate art. During the talk, we'll get hands-on in modifying the algorithms and tuning neural network parameters to compose new music and paint new pictures as we go. We'll conclude by discussing future directions in the field of computational creativity, and thinking about whether computers will ever be able to match human levels of performance in this area.",
    "title": "Computational Creativity",
    "map_link": null,
    "latlon": null,
    "speaker": "Matthew Ireland",
    "end_date": "2018-09-01 20:00:00",
    "source": "database",
    "end_time": "20:00",
    "type": "talk",
    "slug": "computational-creativity",
    "id": 396,
    "link": "https://www.emfcamp.org/line-up/2018/396",
    "user_id": 429,
    "may_record": true,
    "start_date": "2018-09-01 19:30:00",
    "start_time": "19:30",
    "is_fave": false,
    "venue": "Stage C",
    "conversation_id": "CON-38f89a9e-3362-4053-be0a-263f67167f5a",
    "member_id": "MEM-34fd8ae0-fa43-483d-9b47-fbca99d9b28f"
  },
  {
    "description": "When you share an office with a CT scanner you start to look at the world differently, it's like having X-Ray vision (because it is X-ray vision really); you know you can look inside just about anything you like (as long as it is dead and will fit in a Pringles can.)\r\n\r\nOver the last 10 years or so I've been developing different types of CT scanner and finding uses for them that are not just the usual day-to-day teeth & bone scanning that is expected of them.\r\n\r\nFrom watching teeth dissolve in real time in fizzy drinks, determining if there is a maggot in my lunchtime apple, and discovering inaccessible text in a 14th century parchment roll, to recovering a lost episode of Morecambe and Wise and X-Raying my lunch. These are just some of the uses and, arguably abuses, of the equipment I get to play with.",
    "title": "The use and abuse of CT scanners",
    "map_link": null,
    "latlon": null,
    "speaker": "David Mills",
    "end_date": "2018-09-02 13:50:00",
    "source": "database",
    "end_time": "13:50",
    "type": "talk",
    "slug": "the-use-and-abuse-of-ct-scanners",
    "id": 65,
    "link": "https://www.emfcamp.org/line-up/2018/65",
    "user_id": 255,
    "may_record": true,
    "start_date": "2018-09-02 13:20:00",
    "start_time": "13:20",
    "is_fave": false,
    "venue": "Stage A",
    "conversation_id": "CON-700145bb-66ec-4afc-905f-b68a61891915",
    "member_id": "MEM-a065ed08-c015-429c-9ffb-81cea0e67360"
  },
  {
    "age_range": "All ages",
    "cost": "Free",
    "description": "What does the future of the Internet look like in the UK? The Age Appropriate Design Code of Practice in the new Data Protection Act could have implications for online anonymity, biometric IDs and age verification, automated profiling and geolocation, and using personal data for marketing. What are we missing, and what are the risks? Find out how to contribute to the consultation closing September 19.",
    "title": "Age Appropriate Design Online  — a new UK Code of Practice is coming",
    "map_link": null,
    "latlon": null,
    "equipment": "",
    "speaker": "Pippa King and Jen Persson",
    "end_date": "2018-08-31 18:10:00",
    "source": "database",
    "end_time": "18:10",
    "type": "workshop",
    "slug": "age-appropriate-design-online-a-new-uk-code-of-practice-is",
    "id": 134,
    "link": "https://www.emfcamp.org/line-up/2018/134",
    "user_id": 553,
    "may_record": false,
    "start_date": "2018-08-31 17:30:00",
    "start_time": "17:30",
    "is_fave": false,
    "venue": "Workshop 1",
    "conversation_id": "CON-cf3562c1-e9ea-4dbf-92b2-4822cd7c0491",
    "member_id": "MEM-7fd3bd3b-e642-41b9-8e9e-19d9aad56c39"
  },
  {
    "age_range": "10 - 1000",
    "cost": "5 pounds (each NFC LED costs around £1, NFC data tag - £1.5, plus nail art equipment (UV gel nail polish & reusable tools to share for the group) as well as single-use cuticle sticks, cotton pads, remover, etc.",
    "description": "This workshop puts the pretty and the geeky together by combining UV gel nail art with NFC technology. NFC (Near Field Communication) is a peer-to-peer radio communication method which allows devices up to 4cm away from each other to communicate (more: https://en.wikipedia.org/wiki/Near-field_communication). Its uses vary from contactless payments to smart cards, access fobs and file sharing, making it a vital communication tool.\r\nThe workshop will include:\r\n- introduction to gel manicure\r\n- brief introduction to the NFC technology\r\n- programming NFC data tags\r\n- placing NFC LEDs and data tags on nails and incorporating them into a nail art composition\r\nThe end result is a happy participant with a creative gel manicure involving NFC activated LEDs and a custom programmed nail which can perform various things: unlock a phone, open a browser and navigate to a link, open a specific application, link to a business card, etc.\r\n\r\nThis workshop would be open to all ages and genders, with an option to paint a fake plastic nails instead of own nails if that’s preferred; each data tag and diode stickers are around 8mm wide so that can be useful if someone has smaller nails.",
    "title": "NFC Nail Art",
    "map_link": null,
    "latlon": null,
    "equipment": "Android phone with the NFC feature",
    "speaker": "Kinga Kieczkowska",
    "end_date": "2018-09-01 14:50:00",
    "source": "database",
    "end_time": "14:50",
    "type": "workshop",
    "slug": "nfc-nail-art",
    "id": 275,
    "link": "https://www.emfcamp.org/line-up/2018/275",
    "user_id": 1260,
    "may_record": false,
    "start_date": "2018-09-01 13:20:00",
    "start_time": "13:20",
    "is_fave": false,
    "venue": "Workshop 4",
    "conversation_id": "CON-15e12e84-01c7-46f8-bfbe-fa0f8e779908",
    "member_id": "MEM-5b0dca8c-d6e9-4ed4-bd8e-879bca89ff44"
  },
  {
    "description": "Codes of Ethics are back in fashion - mostly driven by AI and other scary technology. What's in a code of ethics, and why should you care about it? Go behind the scenes with an ethicist and co-author of the Association of Computing Machinery's (ACM) new code of ethics that affects hundreds of thousands of computing professionals and get some answers to the following: What is a Code of Ethics? Why bother updating the old code, or having one at all? What's the code asking me to do, and why? How can I practically use the code? How did you decide whether something is good or bad, or whether something should be included in the code? What if my boss thinks codes of ethics are for losers? What if I work in the military/security/etc. domain? How is this code different from all the other codes out there? What happens if I break the Code of Ethics?\r\n\r\nBonus, time permitting (or talk to the speaker afterwards): Feel free to bring along an ethical dilemma and see how you might interpret it according to the new Code!",
    "title": "Codes of Ethics for tech: the hip old thing",
    "map_link": null,
    "latlon": null,
    "speaker": "Catherine Flick",
    "end_date": "2018-08-31 19:20:00",
    "source": "database",
    "end_time": "19:20",
    "type": "talk",
    "slug": "codes-of-ethics-for-tech-the-hip-old-thing",
    "id": 289,
    "link": "https://www.emfcamp.org/line-up/2018/289",
    "user_id": 362,
    "may_record": true,
    "start_date": "2018-08-31 18:50:00",
    "start_time": "18:50",
    "is_fave": false,
    "venue": "Stage B",
    "conversation_id": "CON-c143fe51-46c3-482a-ab7a-a646dcc33b18",
    "member_id": "MEM-90cec714-350d-4257-8ce5-e1a3c96d08cd"
  },
  {
    "description": "Smart connected lightbulbs are common, cheap, and come in a bewildering array of styles and functionality. Bulbs that change colour? Certainly. Bulbs that have a built in speaker? Yes. Bulbs that connect to a command and control network in a foreign state and potentially leak network security information? Of course.\r\n\r\nCome and learn what's actually inside one of these bulbs, what it does, whether it's trustworthy, alternatives that are potentially good actually. Leave depressed about the state of the world.",
    "title": "Everything you never wanted to know about smart lightbulbs",
    "map_link": null,
    "latlon": null,
    "speaker": "Matthew Garrett",
    "end_date": "2018-08-31 19:20:00",
    "source": "database",
    "end_time": "19:20",
    "type": "talk",
    "slug": "everything-you-never-wanted-to-know-about-smart-lightbulbs",
    "id": 131,
    "link": "https://www.emfcamp.org/line-up/2018/131",
    "user_id": 551,
    "may_record": true,
    "start_date": "2018-08-31 18:50:00",
    "start_time": "18:50",
    "is_fave": false,
    "venue": "Stage A",
    "conversation_id": "CON-aad45a9a-0349-4cca-abd1-be0c3636eeef",
    "member_id": "MEM-36cfcd3b-fef6-42c8-b6a5-8ab5ffc1b855"
  },
  {
    "description": "The impact of major space weather events are currently being discussed at the highest level of governments and is an active area of research. The potential damage of a solar superstorm to our national economy, communications network and electricity grid is a real threat and must be taken seriously. Such storms can cause the loss of GPS (with many more consequences than just not being able to find the way to EMF Camp), alter the orbits of satellites and could cripple the electricity grids around the world. \r\n\r\nCome along to join Dr. Sean Elvidge from the University of Birmingham to explore the causes of space weather, the potential repercussions (and likelihood) of a superstorm and an explanation of the work that is currently being undertaken to understand and mitigate these risks.",
    "title": "Sunny with a Mild Chance of Catastrophe",
    "map_link": null,
    "latlon": null,
    "speaker": "Sean Elvidge",
    "end_date": "2018-08-31 16:00:00",
    "source": "database",
    "end_time": "16:00",
    "type": "talk",
    "slug": "sunny-with-a-mild-chance-of-catastrophe",
    "id": 168,
    "link": "https://www.emfcamp.org/line-up/2018/168",
    "user_id": 1160,
    "may_record": true,
    "start_date": "2018-08-31 15:30:00",
    "start_time": "15:30",
    "is_fave": false,
    "venue": "Stage B",
    "conversation_id": "CON-7447bfd2-aac0-49de-95f0-4b51abe2d1f3",
    "member_id": "MEM-9db1bb85-4467-4305-92ab-ba38d22a9f12"
  },
  {
    "description": "In 1976, in an amusement park in Southern California, the crew of The Six Million Dollar Man were setting up a scene in a fun house.  They moved a waxwork dummy, accidentally broke off its arm, and discovered that rather than being made of wax, it was made of a real dead guy.\r\n\r\nWith a bit of investigation, the coroner discovered it was Elmer McCurdy, a failed bank robber who died in 1911.  Between his death and his discovery, he visited sideshows, hung out at Niagra Falls, rode on rollerskates, became a drug addict, and inspired the look of Skeletor from the He-Man cartoons and toys.\r\n\r\nWe'll get into Elmer's actual life, his adventures after his death, and where he's residing now.  FUN TIMES HAD BY ALL",
    "title": "The Story of Elmer McCurdy",
    "map_link": null,
    "latlon": null,
    "speaker": "Kate Bolin",
    "end_date": "2018-09-02 19:20:00",
    "source": "database",
    "end_time": "19:20",
    "type": "talk",
    "slug": "the-story-of-elmer-mccurdy",
    "id": 16,
    "link": "https://www.emfcamp.org/line-up/2018/16",
    "user_id": 292,
    "may_record": true,
    "start_date": "2018-09-02 19:00:00",
    "start_time": "19:00",
    "is_fave": false,
    "venue": "Stage C",
    "conversation_id": "CON-6c3025cd-a761-4756-84ed-5ef766ba8fa4",
    "member_id": "MEM-d737cc51-bad6-40e6-9e6c-aab97cfb91ad"
  },
  {
    "age_range": "All ages",
    "cost": "",
    "description": "Funky headgear made from long sculptural balloons in various colours.\r\nWe start off by making a basic hat to to fit your head, then \r\nthe fun part starts by adding more balloons to decorate it as you want.\r\nTo finish, we add the LED (and battery provided) to make it glow at night!",
    "title": "Fun Balloon Hats that Glow",
    "map_link": null,
    "latlon": null,
    "equipment": "None needed (But you may want to bring and add some of your own LEDS etc)",
    "speaker": "Stewart Dunn",
    "end_date": "2018-09-02 18:00:00",
    "source": "database",
    "end_time": "18:00",
    "type": "youthworkshop",
    "slug": "fun-balloon-hats-that-glow",
    "id": 500,
    "link": "https://www.emfcamp.org/line-up/2018/500",
    "user_id": 308,
    "may_record": false,
    "start_date": "2018-09-02 17:00:00",
    "start_time": "17:00",
    "is_fave": false,
    "venue": "Youth Workshop",
    "conversation_id": "CON-4a1abddc-1def-4c7b-ba47-16435869b2b8",
    "member_id": "MEM-9c2a60af-e646-49c9-8041-9176cc03a8f3"
  },
  {
    "age_range": "5 to 10",
    "cost": "None",
    "description": "A Forest School inspired activity. This would appeal to all ages of children as the wands can be as simple or complex as each individual sees fit.  Initially I would set the scene with some tree folklore or story relating to willow and dogwood.  Then, I would show how to bend the willow or dogwood into a wand shape and secure it.  The youngest children could then decorate their wand with natural resources, (or I could provide some coloured string, ribbon, feathers etc).  The older children could use basic woodcrafting tools such as potato peelers to strip the wands and whiltting knives to add carving notches for decoration, in addition.   I would imagine the younger children finishing earlier, but for older children this taking about an hour.  I would prefer all children to be accompanied by an adult, especially if they are hoping to use the tools.  I am a teacher, so CRB checked and Level 3 Qualified Forest School Leader.",
    "title": "Willow wand making ",
    "map_link": null,
    "latlon": null,
    "equipment": "Any natural resources they can find on site...leaves, feathers, petals, etc",
    "speaker": "Sarah Montague ",
    "end_date": "2018-09-02 10:40:00",
    "source": "database",
    "end_time": "10:40",
    "type": "youthworkshop",
    "slug": "willow-wand-making",
    "id": 75,
    "link": "https://www.emfcamp.org/line-up/2018/75",
    "user_id": 413,
    "may_record": false,
    "start_date": "2018-09-02 09:30:00",
    "start_time": "09:30",
    "is_fave": false,
    "venue": "Youth Workshop",
    "conversation_id": "CON-3bcfa1ed-01d0-411a-8e8c-205ff8dc80b8",
    "member_id": "MEM-16cebe86-690d-46dd-b450-6f1c8701c54e"
  },
  {
    "description": "Sequel for the EMF’16 talk on hacking modern automotive tech into a 1974 Ford Escort Mk1.\r\nAn updated journey on; connecting the car to the cloud using AWS for GPS tracking and remote engine start, 3D printing prototype engine parts and reverse engineering CAN signals to test a home-brew digital cluster built using a Raspberry Pi running a custom Linux image.",
    "title": "Car Hacking - Back to the future 1970’s style Part II",
    "map_link": null,
    "latlon": null,
    "speaker": "Dan Smith & Laura Hyatt",
    "end_date": "2018-09-01 15:40:00",
    "source": "database",
    "end_time": "15:40",
    "type": "talk",
    "slug": "car-hacking-back-to-the-future-1970-s-style-part-ii",
    "id": 211,
    "link": "https://www.emfcamp.org/line-up/2018/211",
    "user_id": 539,
    "may_record": true,
    "start_date": "2018-09-01 15:10:00",
    "start_time": "15:10",
    "is_fave": false,
    "venue": "Stage A",
    "conversation_id": "CON-323f727d-2e99-443f-a65a-1c2ac3e92675",
    "member_id": "MEM-aa31366a-7b9b-4489-ae9b-1dc87293af3d"
  },
  {
    "age_range": "16+",
    "cost": "Free",
    "description": "In this workshop you will make a functioning, interactive wearable tech project using Bela Mini and paper circuitry. Bela is an embedded computing platform for interactive audio projects that can be programmed using Pure Data, a visual language designed for audio. You will learn how to program in Pure Data and work with circuits using paper craft to realise their own wearable project ideas.\r\n\r\nNo previous experience with coding or electronics will be necessary. We will teach the basics of working with Pure Data and the Bela Mini drawing from our open-source collection of Pure Data code and paper circuitry and sensor designs.\r\n\r\nThis workshop is part of a Queen Mary University of London research project looking at what digital physical tools best support creative physical computing projects. We will provide all materials and Bela Mini kits for use during the workshops. ",
    "title": "Build a Wearable with Paper Circuitry and Bela Mini",
    "map_link": null,
    "latlon": null,
    "equipment": "Laptop (any OS) and headphones",
    "speaker": "Becky Stewart",
    "end_date": "2018-09-01 14:00:00",
    "source": "database",
    "end_time": "14:00",
    "type": "workshop",
    "slug": "build-a-wearable-with-paper-circuitry-and-bela-mini",
    "id": 378,
    "link": "https://www.emfcamp.org/line-up/2018/378",
    "user_id": 1347,
    "may_record": false,
    "start_date": "2018-09-01 10:00:00",
    "start_time": "10:00",
    "is_fave": false,
    "venue": "Workshop 1",
    "conversation_id": "CON-2db700b6-fc02-46c8-a22c-0e1a612c2109",
    "member_id": "MEM-a045160d-3298-4515-8680-01dbc5cd7aa6"
  },
  {
    "age_range": "15+",
    "cost": "",
    "description": "Like small poems or short stories, tiny narrative games are valuable creative works. They can be used as a way of expressing feelings, explore simple emotions and tell points of view.\r\n\r\nBitsy is a tiny tool made especially for creating games which are based on exploration and narrative. Its pixel art minimalistic visual style makes it perfect to just sit down and make a game in a short period of time.\r\n\r\nThe output is a simple HTML file, so the game is not only playable almost everywhere, it’s also really easy to distribute and opens chances of hacking and tinkering.\r\n\r\nWe will learn how to create games with Bitsy, both from a technical point of view and from a narrative point of view. We will explore space layout, dialogues, rhythm.\r\n\r\nAt the end of the workshop you’ll be able to create small narrative experience to enjoy with your friends, to deliver powerful messages and to dip your toe in the crazy world of game making. So, come on over with your laptop. It’s going to be great fun!",
    "title": "Tell stories in pixels and games",
    "map_link": null,
    "latlon": null,
    "equipment": "Laptop",
    "speaker": "Federico Fasce",
    "end_date": "2018-09-01 16:20:00",
    "source": "database",
    "end_time": "16:20",
    "type": "workshop",
    "slug": "tell-stories-in-pixels-and-games",
    "id": 350,
    "link": "https://www.emfcamp.org/line-up/2018/350",
    "user_id": 1322,
    "may_record": false,
    "start_date": "2018-09-01 14:20:00",
    "start_time": "14:20",
    "is_fave": false,
    "venue": "Workshop 1",
    "conversation_id": "CON-27d213d7-44a8-4c42-b16f-d14a26877f77",
    "member_id": "MEM-f95aa562-207d-4a6f-9f53-58ca0052f58b"
  },
  {
    "age_range": "15+",
    "cost": "£10",
    "description": "As a person that practices both art & computer science, I have found there can be an interaction between the two, where ideas and patterns from one discipline can be transferred in a new form into the other.\r\n\r\nI have created a workshop that introduces ideas about what is important in drawing and what are the steps to creating a picture using terminology familiar to people in tech.The workshop consists of some theoretical parts and engaging hands-on exercises, aided by a custom tool. Exercises include drawing cylinders from several angles while being aware of the 3d shape of the object, using a custom grid to copy a sketch and doing several iterations of thumbnails to explore an idea for a drawing. All the while, feedback and suggestions are offered to the participants.\r\n\r\nThe end outcome is that participants gain more confidence in their drawing abilities, go deeper into drawing even simple forms and understand that the underlying process for drawing is not a magical fuzzy path, but consists of many sequential and ‘deterministic’ steps.",
    "title": "Drawing for techies",
    "map_link": null,
    "latlon": null,
    "equipment": "pencils that they like, some colored pencils and all workshop sheets will be provided",
    "speaker": "Karolina Alexiou",
    "end_date": "2018-09-01 11:00:00",
    "source": "database",
    "end_time": "11:00",
    "type": "workshop",
    "slug": "drawing-for-techies",
    "id": 346,
    "link": "https://www.emfcamp.org/line-up/2018/346",
    "user_id": 1320,
    "may_record": false,
    "start_date": "2018-09-01 10:00:00",
    "start_time": "10:00",
    "is_fave": false,
    "venue": "Workshop 3",
    "conversation_id": "CON-47e4be57-0998-48d0-8f28-c6df32c0ac14",
    "member_id": "MEM-6701f63f-b626-4b75-a1aa-6a2ebc72b399"
  },
  {
    "description": "Earlier in the year i was confronted with an ANPR system at the garage at my house so i started playing with it. \r\n\r\nThe talk covers methods legal in the Netherlands where the PoC was made. I focus on the technology, on the implementation as Parking Garage access control.\r\n\r\nThe topic does cover areas of speed control and other forms of law enforcement. I have not attacked those but assume that the attack would also work there. I even suspect that truck drivers have found the same and do the attack on a large scale. ",
    "title": "Why automated number plate recognition systems suck",
    "map_link": null,
    "latlon": null,
    "speaker": "mc.fly",
    "end_date": "2018-09-02 14:30:00",
    "source": "database",
    "end_time": "14:30",
    "type": "talk",
    "slug": "why-automated-number-plate-recognition-systems-suck",
    "id": 284,
    "link": "https://www.emfcamp.org/line-up/2018/284",
    "user_id": 1269,
    "may_record": true,
    "start_date": "2018-09-02 14:00:00",
    "start_time": "14:00",
    "is_fave": false,
    "venue": "Stage A",
    "conversation_id": "CON-97e73c44-e003-44a5-9e60-fb7a899939c2",
    "member_id": "MEM-182a3eb8-f8e7-498b-85f7-9c6c6f583898"
  },
  {
    "description": "Sub-Saharan Eritrean by way of London, Lula is a creative enigma, who is carving out a career for herself as a multidisciplinary artist. \r\n\r\nAn unconventional thinker using technology as her enabler, Lula is breaking through “the norm” and liberating artistic expression as a sensory experience.\r\n \r\nLula’s personal project is an immersive live performance within an audio/visual installation that takes you on a journey of illegal migration.Lula sings about a lived experience of the past, present and future. Her soulful timbre, which carries the weight of her heritage, enables intergalactic travel. With the support of cutting edge technology, known as MiMu Gloves, she makes levitation through sound waves possible.\r\n\r\nSee her performance at TEDxTeen London August 2017 here:: https://bit.ly/2ix1lkL",
    "title": "Digital Immigrant // Unapologetic Other // Creative Gypsy",
    "map_link": null,
    "latlon": null,
    "speaker": "Lula XYZ",
    "end_date": "2018-08-31 22:50:00",
    "source": "database",
    "end_time": "22:50",
    "type": "performance",
    "slug": "digital-immigrant-unapologetic-other-creative-gypsy",
    "id": 189,
    "link": "https://www.emfcamp.org/line-up/2018/189",
    "user_id": 1179,
    "may_record": false,
    "start_date": "2018-08-31 22:00:00",
    "start_time": "22:00",
    "is_fave": false,
    "venue": "Stage B",
    "conversation_id": "CON-b3904870-6bce-4b28-aef8-d11dd9d8b3c6",
    "member_id": "MEM-cf24abfd-8be5-4393-b715-8a8be8b1f942"
  },
  {
    "description": "As with many young people interested in computing, I could never work out how a computer could turn 1's and 0's flowing through logic gates into what you see before you. You learn that this magic box can be programmed to do all sorts of amazing things, but are never really given the details as to how it does it. I wanted to know more, and after some research I started making logic gates with the one bit of electronics I knew how to use: Electric relays. I scrounged parts from cars, microwaves, scrap change machines, etc and put them together into increasingly complex contraptions. Two years later, I had TIM 8: a fully programmable 8 bit relay computer. This is the story of how TIM 8 came about, what I learnt along the way, and how relay computers are a fantastic way to demonstrate how a computer really works.\r\n\r\nFor the talk I would bring a presentation and TIM 8 (the size of a small suitcase).",
    "title": "The TIM Project: Building a relay computer from scrap",
    "map_link": null,
    "latlon": null,
    "speaker": "Rory Mangles",
    "end_date": "2018-09-01 13:30:00",
    "source": "database",
    "end_time": "13:30",
    "type": "talk",
    "slug": "the-tim-project-building-a-relay-computer-from-scrap",
    "id": 35,
    "link": "https://www.emfcamp.org/line-up/2018/35",
    "user_id": 302,
    "may_record": true,
    "start_date": "2018-09-01 13:00:00",
    "start_time": "13:00",
    "is_fave": false,
    "venue": "Stage C",
    "conversation_id": "CON-7d6deb36-ea2a-40de-929c-f65ab6137011",
    "member_id": "MEM-3201b25e-aa60-4627-bf37-afec17dfc61b"
  },
  {
    "description": "Immediately after the screening of Hackers, we are honoured to be joined by Hackers director Iain Softley in conversation with Jake Davis (AKA Topiary), sharing stories and answering your questions.",
    "title": "Iain Softley in conversation with Jake Davis",
    "map_link": null,
    "latlon": null,
    "speaker": "Jake Davis & Iain Softley",
    "end_date": "2018-09-01 23:00:00",
    "source": "database",
    "end_time": "23:00",
    "type": "talk",
    "slug": "iain-softley-in-conversation-with-jake-davis",
    "id": 534,
    "link": "https://www.emfcamp.org/line-up/2018/534",
    "user_id": 282,
    "may_record": true,
    "start_date": "2018-09-01 22:20:00",
    "start_time": "22:20",
    "is_fave": false,
    "venue": "Stage C",
    "conversation_id": "CON-dcdc9d6c-0868-4a73-a562-ae9f549bcfc7",
    "member_id": "MEM-a9c809d0-ab8f-4aee-b204-3379d0274c49"
  },
  {
    "description": "Geiger counters are interesting and surprisingly useful devices, and you can build one for less than the price of a video game. They can monitor background radiation levels, check household items such as smoke alarms and gas mantles, and provide information about medical treatments. I designed and built my own unit having been diagnosed with cancer in 2017, and it has provided some fascinating insights.\r\n\r\nThis talk describes the design and construction of a simple Geiger counter with an OLED display and a recording facility, and illustrates some of the science behind medical procedures involving radiation, such as PET scans (Positron Emission Tomography) and radiotherapy.",
    "title": "Antiparticles and Geiger counters",
    "map_link": null,
    "latlon": null,
    "speaker": "Chris Taylor",
    "end_date": "2018-09-01 10:30:00",
    "source": "database",
    "end_time": "10:30",
    "type": "talk",
    "slug": "antiparticles-and-geiger-counters",
    "id": 167,
    "link": "https://www.emfcamp.org/line-up/2018/167",
    "user_id": 1159,
    "may_record": true,
    "start_date": "2018-09-01 10:00:00",
    "start_time": "10:00",
    "is_fave": false,
    "venue": "Stage B",
    "conversation_id": "CON-31b62b4d-39e0-443e-8466-91ff4f763f5c",
    "member_id": "MEM-142f232f-2eff-4f8f-851d-459a3af9d6c1"
  },
  {
    "description": "Hannah Fry will explain the inner workings of algorithms: their power, their limitations, and whether they really are an improvement on the humans they replace. With algorithms making important decisions in healthcare, transport, finance, security, even what we watch, how much should we rely on them? What kind of future do we want?\r\n\r\nYou are accused of a crime. Who would you rather determine your fate – a human or an algorithm? An algorithm is more consistent and less prone to error of judgement. Yet a human can look you in the eye before passing sentence.\r\n\r\nYou need a liver transplant to save your life. Who would you want in charge of organ allocation? An algorithm can match organ donors with patients, potentially saving many more lives. But it may send you to the back of the queue.\r\n\r\nYou’re buying a (driverless) car. One vehicle is programmed to save as many lives as possible in a collision. Another promises to prioritize the lives of its passengers. Which do you choose?",
    "title": "Hello World: How to be Human in the Age of the Machine",
    "map_link": null,
    "latlon": null,
    "speaker": "Hannah Fry",
    "end_date": "2018-09-01 20:00:00",
    "source": "database",
    "end_time": "20:00",
    "type": "talk",
    "slug": "hello-world-how-to-be-human-in-the-age-of-the-machine",
    "id": 489,
    "link": "https://www.emfcamp.org/line-up/2018/489",
    "user_id": 1535,
    "may_record": false,
    "start_date": "2018-09-01 19:10:00",
    "start_time": "19:10",
    "is_fave": false,
    "venue": "Stage A",
    "conversation_id": "CON-871a85e2-562e-4bec-af65-c9d5b0ce6192",
    "member_id": "MEM-99b077da-0de1-40c7-911d-7aef9e1b5de6"
  },
  {
    "description": "Information security is a big deal nowadays as more and more people start to take their privacy online very seriously. But what's the point of protecting yourself if the web services you use are vulnerable to big scary hackers?\r\n\r\nIf you want to catch a glimpse of penetration testing, come along and learn about concepts such as discovering vulnerabilities, running through them, exploiting and patching them.\r\n\r\nThis talk will be based around a University coursework project, where an older version of web forum software \"phpBB\" is examined, exploited and patched. The technologies that phpBB was built on were quite simple, so the main focus of the talk will be the process of penetration testing.\r\n\r\nSome of the topics covered will include sanitising user input, as well as enforcing file and variable scopes. You will familiarise yourself with concepts such as never trusting user input and get to see exploits such as cross-site scripting and remote code execution.\r\n\r\nLastly, we will wrap up by patching out these vulnerabilities and hopefully learn a thing or two about building more secure software.",
    "title": "Attacking Websites for Educational Purposes Only",
    "map_link": null,
    "latlon": null,
    "speaker": "Andrejus Kostarevas",
    "end_date": "2018-09-01 10:20:00",
    "source": "database",
    "end_time": "10:20",
    "type": "talk",
    "slug": "attacking-websites-for-educational-purposes-only",
    "id": 371,
    "link": "https://www.emfcamp.org/line-up/2018/371",
    "user_id": 1339,
    "may_record": true,
    "start_date": "2018-09-01 10:00:00",
    "start_time": "10:00",
    "is_fave": false,
    "venue": "Stage A",
    "conversation_id": "CON-8cf485b7-ad1b-4453-a931-9521562ada82",
    "member_id": "MEM-a1e9bb3b-79f4-4e06-8f7e-09a5ffca6b35"
  },
  {
    "description": "Weight and temperature measurement for non-intrusive monitoring of a beehive. Total cost well under £100.\r\n\r\nData transimission every 15 minutes via wifi link to Thingspeak for generating realtime data curves on a browser on a PC or mobile phone.\r\n\r\nBenefits of curves throughout the year will be described\r\neg. swarm detection, advance warning of swarm preparation, need to feed colony, colony collapse, presence of brood, time to harvest honey\r\n\r\nFuture work - audio & video\r\n\r\nPresentation will cover R-Pi hardware and software plus construction details of plinth with load cell.\r\n\r\nRealtime data from submitter's website shown on the day (assuming internet access)\r\n\r\n ",
    "title": "Beehive monitor based on Raspberry Pi",
    "map_link": null,
    "latlon": null,
    "speaker": "Geo Meadows",
    "end_date": "2018-09-01 16:00:00",
    "source": "database",
    "end_time": "16:00",
    "type": "talk",
    "slug": "beehive-monitor-based-on-raspberry-pi",
    "id": 69,
    "link": "https://www.emfcamp.org/line-up/2018/69",
    "user_id": 342,
    "may_record": true,
    "start_date": "2018-09-01 15:40:00",
    "start_time": "15:40",
    "is_fave": false,
    "venue": "Stage B",
    "conversation_id": "CON-9a8bbdb6-9de1-4334-a585-9aa9818673a9",
    "member_id": "MEM-16f5b385-bb8a-4b2c-8135-628132bb889e"
  },
  {
    "description": "In recent history, fish have been relatively untroubled by the Internet of Things, but it was time for that to change. Armed only with a soldering iron, a Raspberry Pi, some JavaScript and ideas above my station, I set about connecting my aquarium to the Internet. Soon, armed with delusions of grandeur, things inevitably spiralled about of control and now my garage door has an API.\r\n\r\nThis talk is equal parts tutorial, inspiration and lunacy as I take the audience through my projects and hopefully dispel some of the mystery of IoT devices, showing how it can be easy to learn and a lot of fun to build.\r\n\r\nHighlights include a Scottish toilet emergency, an aquarium featuring military-grade security and an extinction-level event in the suburbs of Milton Keynes.\r\n",
    "title": "Boiling Nemo - Make your own Internet of Things",
    "map_link": null,
    "latlon": null,
    "speaker": "PJ Evans",
    "end_date": "2018-08-31 14:40:00",
    "source": "database",
    "end_time": "14:40",
    "type": "talk",
    "slug": "boiling-nemo-make-your-own-internet-of-things",
    "id": 145,
    "link": "https://www.emfcamp.org/line-up/2018/145",
    "user_id": 424,
    "may_record": true,
    "start_date": "2018-08-31 14:10:00",
    "start_time": "14:10",
    "is_fave": false,
    "venue": "Stage A",
    "conversation_id": "CON-fa746f81-09f8-426a-80ed-9156528c6260",
    "member_id": "MEM-75fb0e27-ad77-4a41-999a-56a2745fb0b7"
  },
  {
    "description": "The Battle of Mosul in 2017 was a turning point in world history, even though we think of it as just another one of the awful events of today's wars.  Not since its founding in 1863, has the International Committee of the Red Cross been unable to provide a neutral source of protection and assistance to the victims of war and therefore declined to provide a presence on the battlefield.  What does this mean for all citizens of the world, especially those living under the shadow of continuing, chaotic conflict?",
    "title": "The Battle of Mosul: what does it mean to live in a post-Geneva Convention world",
    "map_link": null,
    "latlon": null,
    "speaker": "Emily Mayhew",
    "end_date": "2018-09-01 18:40:00",
    "source": "database",
    "end_time": "18:40",
    "type": "talk",
    "slug": "the-battle-of-mosul",
    "id": 302,
    "link": "https://www.emfcamp.org/line-up/2018/302",
    "user_id": 1277,
    "may_record": true,
    "start_date": "2018-09-01 18:10:00",
    "start_time": "18:10",
    "is_fave": false,
    "venue": "Stage B",
    "conversation_id": "CON-c2b24378-3f84-4176-8731-9167649355b5",
    "member_id": "MEM-9598d4bc-8136-4e72-9c83-fa4cacb5b9c6"
  },
  {
    "description": "Some of you may have seen them in a pub, betting shop or even a casino. What I'm referring to are video slot machines, and they are the most popular item at any one of these places as well as the gaming expos where players can put money in and spin the reels in the hopes of getting a combination that will get the big rewards.\r\n\r\nBut how easy is it to develop games for these machines? What goes into making a video slot game for a dedicated machine? Are there any differences between each country in how these operate? And are these games made to take all your money?",
    "title": "Developing Games for the Casino/Gaming Industry",
    "map_link": null,
    "latlon": null,
    "speaker": "Tim Stoddard",
    "end_date": "2018-09-01 15:30:00",
    "source": "database",
    "end_time": "15:30",
    "type": "talk",
    "slug": "developing-games-for-the-casino-gaming-industry",
    "id": 130,
    "link": "https://www.emfcamp.org/line-up/2018/130",
    "user_id": 268,
    "may_record": true,
    "start_date": "2018-09-01 15:10:00",
    "start_time": "15:10",
    "is_fave": false,
    "venue": "Stage B",
    "conversation_id": "CON-d2d42ce1-ac56-478b-b022-7dbb5a435f06",
    "member_id": "MEM-51c5f96f-1c47-469c-ad15-b2128f5f67e7"
  },
  {
    "description": "Come to Stage A this Friday night to hangout and play multiplayer games on the big screen. We're going to to put on a selection of games and create a small space where people can sit down, chill out, watch and play some games.\r\n\r\nThere will be tables and seats for those who want to bring their boardgames too!",
    "title": "Multiplayer Indie Computer and Board Games",
    "map_link": null,
    "latlon": null,
    "speaker": "Amran",
    "end_date": "2018-09-01 01:00:00",
    "source": "database",
    "end_time": "01:00",
    "type": "performance",
    "slug": "multiplayer-indie-computer-and-board-games",
    "id": 526,
    "link": "https://www.emfcamp.org/line-up/2018/526",
    "user_id": 7,
    "may_record": false,
    "start_date": "2018-08-31 22:00:00",
    "start_time": "22:00",
    "is_fave": false,
    "venue": "Stage A",
    "conversation_id": "CON-cf634764-fde3-4f22-b5fa-3da667f43372",
    "member_id": "MEM-907a5506-0c8d-4d8d-97fa-9db98b67e9bf"
  },
  {
    "age_range": "9+",
    "cost": "",
    "description": "Making books is really fun, and a useful skill to have. It's also really easy to do at home. In this workshop I'll show you everything you need to get started, and you'll go away with at least one simple book that you've made yourself.",
    "title": "Bookbinding for Kids",
    "map_link": null,
    "latlon": null,
    "equipment": "Nothing",
    "speaker": "Ben Dornan",
    "end_date": "2018-08-31 16:10:00",
    "source": "database",
    "end_time": "16:10",
    "type": "youthworkshop",
    "slug": "bookbinding-for-kids",
    "id": 294,
    "link": "https://www.emfcamp.org/line-up/2018/294",
    "user_id": 50,
    "may_record": false,
    "start_date": "2018-08-31 14:40:00",
    "start_time": "14:40",
    "is_fave": false,
    "venue": "Youth Workshop",
    "conversation_id": "CON-31554397-53ac-4a34-8ded-6f6d4e9ca6b4",
    "member_id": "MEM-7f1966ef-3ae3-4997-a7b9-fe873c79567a"
  },
  {
    "description": "The 20-year mission to make an old game run properly on a new computer, with many side quests along the way. Woven together are threads of reverse-engineering (of both hardware and software), 1980s computers (in particular the original IBM PC from 1981), emulator coding, game design, electronics, microcontrollers, web services, the demoscene, test-driven development and even a bit of pure mathematics.",
    "title": "Adventures in retrocomputing",
    "map_link": null,
    "latlon": null,
    "speaker": "Andrew Jenner",
    "end_date": "2018-09-02 20:00:00",
    "source": "database",
    "end_time": "20:00",
    "type": "talk",
    "slug": "adventures-in-retrocomputing",
    "id": 50,
    "link": "https://www.emfcamp.org/line-up/2018/50",
    "user_id": 236,
    "may_record": true,
    "start_date": "2018-09-02 19:30:00",
    "start_time": "19:30",
    "is_fave": false,
    "venue": "Stage B",
    "conversation_id": "CON-4c0babb9-6c78-4668-8572-3aa4d8d3b45e",
    "member_id": "MEM-396e523a-8ecf-47fc-9c06-59bfaae642f2"
  },
  {
    "description": "After attending the last EMF camp, I fell in love with the tweetable LED inflatable bunny. I wondered if it would be possible to take the idea of LEDs controlled by twitter and put them all over something wearable, in this case my wedding dress.\r\n\r\nMy talk will go over the tech I used (suitable for absolute beginners), the mistakes that I made and the lessons I learnt along the way. From learning to use the twitter API, writing my own API, coding for an arduino and wiring the whole thing up to the worst bit, THE SEWING. I aim to spread the message that it is ok to f**k up, that everyone does it and that if you keep trying and keep asking for help, you can make silly things too. ",
    "title": "Tweet My Wedding Dress",
    "map_link": null,
    "latlon": null,
    "speaker": "jo franchetti",
    "end_date": "2018-09-02 15:20:00",
    "source": "database",
    "end_time": "15:20",
    "type": "talk",
    "slug": "tweet-my-wedding-dress",
    "id": 155,
    "link": "https://www.emfcamp.org/line-up/2018/155",
    "user_id": 573,
    "may_record": true,
    "start_date": "2018-09-02 15:00:00",
    "start_time": "15:00",
    "is_fave": false,
    "venue": "Stage C",
    "conversation_id": "CON-283a55a7-02a7-4cd3-b934-71c138035e48",
    "member_id": "MEM-c36545a4-bd36-4be0-9544-ea813fe1cf56"
  },
  {
    "description": "What are the tools to effectively manage a hackerspace? In this talk I’ll walk you through the infrastructure and services that we chose to set up at our lab, as well as the rationale behind the choice. We’ll explore how can people communicate better with the right tools, and what is needed to maximize collaboration potential.\r\n\r\nThe talk starts with what is in our experience needed to communicate effectively in a medium sized group (50-100 people), and then illustrates the tools and open source software that can be used to achieve that. There will be details on how to set up Discourse, Gitlab, Dokuwiki with central authentication via SAML and how FreeIPA can be used to manage hackerspace members’ access to both external (public) services and internal (wifi and computer login).",
    "title": "Bootstrapping a hackerspace",
    "map_link": null,
    "latlon": null,
    "speaker": "g5pw",
    "end_date": "2018-09-02 18:40:00",
    "source": "database",
    "end_time": "18:40",
    "type": "talk",
    "slug": "bootstrapping-a-hackerspace",
    "id": 92,
    "link": "https://www.emfcamp.org/line-up/2018/92",
    "user_id": 489,
    "may_record": true,
    "start_date": "2018-09-02 18:10:00",
    "start_time": "18:10",
    "is_fave": false,
    "venue": "Stage B",
    "conversation_id": "CON-7783f8b7-f14e-4e47-a95c-913c5ffc92e5",
    "member_id": "MEM-a514e93b-fc61-45c0-8f2c-040a6dfc4c21"
  },
  {
    "description": "A almost entirely factually accurate comedy set about the difficulties of getting people to experiment on when you're studying pain and fear, covering how utterly essential volunteers/willing subjects are to all human science and the perils and pitfalls of studying cognition in small children and babies, (and how they’re much smarter than we think). ",
    "title": "Why volunteers are unsung heroes of science ",
    "map_link": null,
    "latlon": null,
    "speaker": "Charvy Narain",
    "end_date": "2018-09-01 14:20:00",
    "source": "database",
    "end_time": "14:20",
    "type": "talk",
    "slug": "why-volunteers-are-unsung-heroes-of-science",
    "id": 445,
    "link": "https://www.emfcamp.org/line-up/2018/445",
    "user_id": 1470,
    "may_record": true,
    "start_date": "2018-09-01 14:00:00",
    "start_time": "14:00",
    "is_fave": false,
    "venue": "Stage A",
    "conversation_id": "CON-2596795e-81a5-4543-b444-00d7087bc85b",
    "member_id": "MEM-56f5a9f0-f1c2-455b-98bc-e0551724c67a"
  },
  {
    "age_range": "10+",
    "cost": "£5 for the leather and thread as well as two needles to make sure that you can finish sewing in your own time.",
    "description": "A leather sewing workshop which will give you a chance to sew and emboss your own EMF leather keyring and card wallet to keep. If you take part, you will be able to try using traditional saddle stitching to sew leather as well as personalise it using embossing.\r\n \r\nYou will get a pre-laser cut pieces of leather which they can then sew together using a choice of threads and customise by embossing to make your owne personal items and learn a thing or two about working with leather.",
    "title": "An introduction to leather stiching and embossing",
    "map_link": null,
    "latlon": null,
    "equipment": "All equipment will be provided",
    "speaker": "Florian Heine",
    "end_date": "2018-09-02 14:00:00",
    "source": "database",
    "end_time": "14:00",
    "type": "youthworkshop",
    "slug": "an-introduction-to-leather-stiching-and-embossing",
    "id": 261,
    "link": "https://www.emfcamp.org/line-up/2018/261",
    "user_id": 1246,
    "may_record": false,
    "start_date": "2018-09-02 13:00:00",
    "start_time": "13:00",
    "is_fave": false,
    "venue": "Youth Workshop",
    "conversation_id": "CON-884bb0dc-705a-41ba-a6b5-b4d96afe16f0",
    "member_id": "MEM-44bd2851-8fa3-4ef6-9fa6-f5b3ba2d68b3"
  },
  {
    "description": "VIEON is the electronic musical project of Matt Wild, based in Coventry, UK. Expanding to a live three-piece including sound engineer Stephen Dorphin and VJ Adrian Brian Thompson, their sound is inspired heavily by the 70s and 80s European art electronica pioneers (Jarre, Moroder, Kraftwerk), combined with the more recent influences of contemporary synthpop artists (Royksopp, Justice) as well as infusing aspects of dance, post-rock and ambient music.\r\n\r\nThe VIEON live show is a complete audio-visual event, using not only banks of synthesizers and samplers but also unusual visual instrumentation including vocoder, keytar, theremin and live projected technology and science-fiction inspired visuals including live webcam feeds of what's happening onstage.\r\n\r\nVIEON have raised their profile dramatically throughout 2015-17 with a series of engaging live audio-visual shows famed for their ambitious scope across the UK and beyond, playing their first overseas gig to a rapturous reception in Copenhagen in September 2017.",
    "title": "Vieon - an audio-visual electronica experience",
    "map_link": null,
    "latlon": null,
    "speaker": "Vieon",
    "end_date": "2018-09-01 00:50:00",
    "source": "database",
    "end_time": "00:50",
    "type": "performance",
    "slug": "vieon-an-audio-visual-electronica-experience",
    "id": 99,
    "link": "https://www.emfcamp.org/line-up/2018/99",
    "user_id": 507,
    "may_record": false,
    "start_date": "2018-09-01 00:00:00",
    "start_time": "00:00",
    "is_fave": false,
    "venue": "Stage B",
    "conversation_id": "CON-b587db51-60a4-485a-a8bb-c0c5d052f00e",
    "member_id": "MEM-ad0b998a-1ef5-4732-8b39-8b8be8338018"
  },
  {
    "description": "Solo, chiptune/electronics. Live mixes using Nintendo /DS (KORG DS-10)  mangled thru live FXs \r\n\r\n:\r\n",
    "title": "Illusion O",
    "map_link": null,
    "latlon": null,
    "speaker": "Chris Hind",
    "end_date": "2018-09-02 22:20:00",
    "source": "database",
    "end_time": "22:20",
    "type": "performance",
    "slug": "illusion-o",
    "id": 334,
    "link": "https://www.emfcamp.org/line-up/2018/334",
    "user_id": 1310,
    "may_record": false,
    "start_date": "2018-09-02 21:30:00",
    "start_time": "21:30",
    "is_fave": false,
    "venue": "Stage B",
    "conversation_id": "CON-cd2053d5-9e9a-4758-92d2-9c8a65a23639",
    "member_id": "MEM-16b80038-0e4e-4524-a0a7-9ce0e1d220c1"
  },
  {
    "description": "There are a number of emoji that, when used in digital communications, don't always refer to their original meaning. The peach emoji, for example, has been found through research conducted by emojipedia to refer most often not to the fruit, but to buttocks. Other fruit and vegetables emoji have suffered a similar fate.\r\n\r\nIn this talk I will explore the ways that emoji are frequently misunderstood or misused - referring to some of the leading research conducted by academics in the area. I will conclude with peer reviewed research that I have conducted looking at the ways we assign new meaning to emoji when communicating with a single other person. Why do we do this and how do we choose the emoji we use. Why is it that despite there being a heart emoji available, some of us choose to use 🍕 to say \"I love you\"?\r\n\r\nThe set is presented in a stand up comedy-style and despite discussing academic research is very accessible to any range of audience. Although parental guidance may be advised.",
    "title": "Why does 🍕 mean \"I love you\" : The ways that we use and misuse emoji",
    "map_link": null,
    "latlon": null,
    "speaker": "Sarah Wiseman",
    "end_date": "2018-09-02 15:10:00",
    "source": "database",
    "end_time": "15:10",
    "type": "talk",
    "slug": "why-does-mean-i-love-you-the-ways-that-we-use",
    "id": 373,
    "link": "https://www.emfcamp.org/line-up/2018/373",
    "user_id": 49,
    "may_record": true,
    "start_date": "2018-09-02 14:40:00",
    "start_time": "14:40",
    "is_fave": false,
    "venue": "Stage A",
    "conversation_id": "CON-86a64f2d-56a8-45ed-8943-256254901102",
    "member_id": "MEM-d657bf35-e90d-49d7-a286-a10ba0930305"
  },
  {
    "age_range": "over 12 (under 12 permitted with a participating, or not participating, adult present)",
    "cost": "£7",
    "description": "I will teach you to knit from creating the right number of stitches (casting on), knitting enough rows to make a square then finishing the pieces (casting off).\r\nI love knitting, and know that when you star some interesting things happen turning what should be a square or rectangle into a distorted triangle. I enjoyed it, so managed to get myself out of this mess to making jumpers, mittens and scarves.\r\nIf you want to learn to knit book one of my sessions. Each session is for 14 people, and children under 12 need to have an adult with them.",
    "title": "Learn to knit",
    "map_link": null,
    "latlon": null,
    "equipment": "n/a",
    "speaker": "Clare Yarnold",
    "end_date": "2018-08-31 18:10:00",
    "source": "database",
    "end_time": "18:10",
    "type": "workshop",
    "slug": "learn-to-knit",
    "id": 369,
    "link": "https://www.emfcamp.org/line-up/2018/369",
    "user_id": 1341,
    "may_record": false,
    "start_date": "2018-08-31 16:10:00",
    "start_time": "16:10",
    "is_fave": false,
    "venue": "Workshop 2",
    "conversation_id": "CON-3ea52374-0ee7-4bbd-934c-5e5599e30e46",
    "member_id": "MEM-69f99ec9-18b1-4c42-b1b0-a319c42cc36c"
  },
  {
    "age_range": "12+",
    "cost": "£1 to cover steel wire and booklet printouts.",
    "description": "A.K.A Man Knitting 101\r\n\r\nFrom a length of wire into some hand crafted jewellery/belt/strap, chainmaille shouldn't be difficult, or elitist. There are many resources out there, and many things to try. It does take a long time to produce a piece, so it's not a cheap thing to purchase, but it should be cheap and easy to practice.\r\n\r\nIn a couple of hours, I will teach how to make rings from wire, explain aspect ratios for rings, and some basic sheet weaves (E4 in 1, J12 in 2). We will then move on to some chains using the basics of these weaves (Box chain, Byzantine Chain, Helm Chain).\r\n\r\nIf there is time and/or interest after this, I'd welcome some time looking at specific projects and helping to start those projects off. (Whether it's an idea in advance with a pattern found online, or an idea from someone on the day).",
    "title": "Chainmailling for beginners",
    "map_link": null,
    "latlon": null,
    "equipment": "Comfortable pliers and clippers if owned please!  Limited number available to borrow.  Wire (1.6mm please) if specific materials are wanted.",
    "speaker": "Christopher Wells",
    "end_date": "2018-09-01 18:30:00",
    "source": "database",
    "end_time": "18:30",
    "type": "workshop",
    "slug": "chainmailling-for-beginners",
    "id": 274,
    "link": "https://www.emfcamp.org/line-up/2018/274",
    "user_id": 1259,
    "may_record": false,
    "start_date": "2018-09-01 15:30:00",
    "start_time": "15:30",
    "is_fave": false,
    "venue": "Workshop 3",
    "conversation_id": "CON-20b4c33d-fda2-406b-a2c7-947988a03416",
    "member_id": "MEM-18a241c9-bdea-44fc-aa01-b23b479d0000"
  },
  {
    "description": "Capybara plays \"music for your ears & for your rears\" - some jazzy stuff, some funky stuff. Some crude videos here: \r\n      https://www.facebook.com/capybarajazz/ \r\n     https://www.facebook.com/pg/capybarajazz/videos\r\n\r\nCreative funk influenced by John Scofield, Serge Gainsbourg, Snarky Puppy, Wayne Shorter and more. ",
    "title": "Capybara Funk & Jazz",
    "map_link": null,
    "latlon": null,
    "speaker": "Capybara",
    "end_date": "2018-09-01 21:50:00",
    "source": "database",
    "end_time": "21:50",
    "type": "performance",
    "slug": "capybara-funk-jazz",
    "id": 431,
    "link": "https://www.emfcamp.org/line-up/2018/431",
    "user_id": 1443,
    "may_record": false,
    "start_date": "2018-09-01 21:00:00",
    "start_time": "21:00",
    "is_fave": false,
    "venue": "Stage B",
    "conversation_id": "CON-04d16f6e-e29e-428e-b453-b0bce64d4e5a",
    "member_id": "MEM-faadf1e2-0dd4-48d6-9636-f845a84e2e5c"
  },
  {
    "age_range": "15+",
    "cost": "",
    "description": "It's natural to hate writing your CV, but this often means they can be difficult for an employer to read.\r\n\r\nDespite how important CVs can be when job hunting, you probably put more thought into the user experience of your first To Do List app than into your current CV, right? ;)\r\n\r\nThis workshop will give you tips to optimise your CV, and make a great impression on the next employer you apply to!",
    "title": "UX your CV",
    "map_link": null,
    "latlon": null,
    "equipment": "Laptop or notebook",
    "speaker": "Matt Rose",
    "end_date": "2018-09-02 17:40:00",
    "source": "database",
    "end_time": "17:40",
    "type": "workshop",
    "slug": "ux-your-cv",
    "id": 385,
    "link": "https://www.emfcamp.org/line-up/2018/385",
    "user_id": 1335,
    "may_record": false,
    "start_date": "2018-09-02 16:40:00",
    "start_time": "16:40",
    "is_fave": false,
    "venue": "Workshop 2",
    "conversation_id": "CON-23e9a5b4-6053-4621-bbee-3b8e0dff4514",
    "member_id": "MEM-dd4b2731-78d5-4752-ad9c-fb6714236491"
  },
  {
    "age_range": "All ages",
    "cost": "",
    "description": "Want to see what unencrypted data your devices are sending? What about encrypted? Can you change that data?\r\n\r\nWhether you're reverse engineering an app, want to annoy people (who gave you the permission for this!), or are just curious about data exchanged with your device, this might be useful for you.\r\n\r\nAfter a short introduction to networking, we'll create a basic MITM (man-in-the-middle) setup with your laptop. Your laptop will become a WiFi access point and target devices will connect to it. Network traffic will be inspected (wireshark) and also changed (dnsmasq, mitmproxy). We'll also install a custom CA on the phone to see HTTPS packets.\r\n\r\nYou will need a laptop with WiFi and Ethernet interfaces, and it needs to run Linux non-virtualised.\r\nYou should be comfortable doing basic admin on your Linux machine.\r\nTools we will use: wireshark, mitmproxy, dnsmasq.\r\n\r\nAfter the workshop, try it out yourself at home on a TV, toaster, or other networked device.",
    "title": "Who is my phone talking to (setting up a man-in-the-middle attack)",
    "map_link": null,
    "latlon": null,
    "equipment": "Laptop running Linux natively (not virtualised) with WiFi + ethernet network interfaces. Smartphone or other networked device.",
    "speaker": "Domen Puncer Kugler",
    "end_date": "2018-08-31 16:50:00",
    "source": "database",
    "end_time": "16:50",
    "type": "workshop",
    "slug": "who-is-my-phone-talking-to-setting-up-a-man-in-the-middle",
    "id": 390,
    "link": "https://www.emfcamp.org/line-up/2018/390",
    "user_id": 1357,
    "may_record": false,
    "start_date": "2018-08-31 15:20:00",
    "start_time": "15:20",
    "is_fave": false,
    "venue": "Workshop 3",
    "conversation_id": "CON-869b9b66-7cb7-4ccc-9ed2-66a85715114c",
    "member_id": "MEM-06dff292-8859-4a6e-a7f9-5409e9458400"
  },
  {
    "description": "Podcasting has been a quiet revolution. Most people didn't get it at first and some are still surprised it's not going away. But podcasting has not only survived three global hype cycles it's also one of the most resilient and unique media forms on the Internet. So far, Podcasting has successfully resisted being sucked up by a single YouTube-style platform that looks helpful in the beginning but would set the rules of its community in the future.\r\n\r\nInstead Podcasting is very much alive and has proven to be able to create new and serve to existing communities, communicate effectively to its audience and establish a following other media types haven't seen yet. Podcasts are sexy and you really want to know why.\r\n\r\nThis talk will explain in detail why podcasts matter, what makes podcasts magical when combined with community, why almost everybody should consider starting a podcast, which infrastructure on the net is actually useful, what kind of hardware is actually needed and what open source and free-ish tools exist to publish high quality audio content on the web today.",
    "title": "The secret powers of podcasting",
    "map_link": null,
    "latlon": null,
    "speaker": "Tim Pritlove",
    "end_date": "2018-09-01 12:10:00",
    "source": "database",
    "end_time": "12:10",
    "type": "talk",
    "slug": "the-secret-powers-of-podcasting",
    "id": 477,
    "link": "https://www.emfcamp.org/line-up/2018/477",
    "user_id": 350,
    "may_record": true,
    "start_date": "2018-09-01 11:20:00",
    "start_time": "11:20",
    "is_fave": false,
    "venue": "Stage C",
    "conversation_id": "CON-bd40db89-8c0b-4f13-a727-cc1b8ea764e6",
    "member_id": "MEM-06576973-7c7e-4324-bb0e-8378b4c9f6ca"
  },
  {
    "description": "Advances in NLP and machine learning are allowing automatic processing of knowledge. An untapped potential of this revolution is the augmentation and possible automation of the invention process. \r\n\r\nEveryone has a perception of an inventor as a crazy guy in a shed who is somehow, suddenly inspired. I would like to challenge this view by exploring the process of famous historical inventors to present day inventors and disruptors to give an understanding of how novel ideas come about, before moving onto what invention might look like in the future.\r\n\r\nIn particular, I would like to share a vision of AI augmented inventors and what this will mean for the democratisation of invention, drawing on my experience as a modern inventor with example patents and progress that has been made so far using new approaches.  \r\n",
    "title": "The Future of Invention",
    "map_link": null,
    "latlon": null,
    "speaker": "Chris Wright",
    "end_date": "2018-08-31 16:30:00",
    "source": "database",
    "end_time": "16:30",
    "type": "talk",
    "slug": "the-future-of-invention",
    "id": 82,
    "link": "https://www.emfcamp.org/line-up/2018/82",
    "user_id": 464,
    "may_record": true,
    "start_date": "2018-08-31 16:00:00",
    "start_time": "16:00",
    "is_fave": false,
    "venue": "Stage C",
    "conversation_id": "CON-0eea4f98-acc7-4edb-8d75-2122fbd9d075",
    "member_id": "MEM-f1f4fa03-0d28-4be0-a8b6-290750c8eee9"
  },
  {
    "description": "A talk on my recent works involving the physical sensation of sound, and how we can trick the senses to create the perception of a \"loud\" environment for one person at a time. Let's create music equipment that is accessible for a DJ who is profoundly deaf. Let's create VR experiences that let us feel the vibrations of the virtual world around us. Join me down a polymathic rabbit-hole where we can explore the worlds of augmented sonic reality, haptics, biofeedback & electrical nerve stimulation to understand why everyone is all about that bass.",
    "title": "Adventures in somatosensory music, body hacking & beyond",
    "map_link": null,
    "latlon": null,
    "speaker": "Chemical Adam",
    "end_date": "2018-09-01 13:30:00",
    "source": "database",
    "end_time": "13:30",
    "type": "talk",
    "slug": "adventures-in-somatosensory-music-body-hacking-beyond",
    "id": 471,
    "link": "https://www.emfcamp.org/line-up/2018/471",
    "user_id": 1490,
    "may_record": true,
    "start_date": "2018-09-01 13:00:00",
    "start_time": "13:00",
    "is_fave": false,
    "venue": "Stage B",
    "conversation_id": "CON-009dd715-bdff-4f4f-abd1-e69070ea1c69",
    "member_id": "MEM-d53eeec4-1248-4ea0-aae7-adacf16f4c41"
  },
  {
    "age_range": "5+",
    "cost": "£1",
    "description": "introduction to slime, which animals make slime and basic explanation of the chemistry involved. We then get hands on and make our own slime! \r\n",
    "title": "Slime Workshop",
    "map_link": null,
    "latlon": null,
    "equipment": "",
    "speaker": "Emma Markham",
    "end_date": "2018-09-01 16:20:00",
    "source": "database",
    "end_time": "16:20",
    "type": "youthworkshop",
    "slug": "slime-workshop",
    "id": 59,
    "link": "https://www.emfcamp.org/line-up/2018/59",
    "user_id": 325,
    "may_record": false,
    "start_date": "2018-09-01 14:50:00",
    "start_time": "14:50",
    "is_fave": false,
    "venue": "Youth Workshop",
    "conversation_id": "CON-2c4eedae-44fe-43b3-ad02-45958b1136a3",
    "member_id": "MEM-204214c6-5010-4b45-8673-8b233060b6a0"
  },
  {
    "age_range": "13+",
    "cost": "",
    "description": "This is a 2 hour workshop to introduce making Virtual Reality experiences you can use immediately using your smart phone. \r\n\r\nBy the end of the workshop you would have built a VR experience that works in your phone's web browser which you can show your friends.\r\n\r\nMake sure you bring your computer! ",
    "title": "Get started with Virtual Reality!",
    "map_link": null,
    "latlon": null,
    "equipment": "Laptop",
    "speaker": "Ada Rose Cannon",
    "end_date": "2018-09-02 16:40:00",
    "source": "database",
    "end_time": "16:40",
    "type": "workshop",
    "slug": "get-started-with-virtual-reality",
    "id": 96,
    "link": "https://www.emfcamp.org/line-up/2018/96",
    "user_id": 497,
    "may_record": false,
    "start_date": "2018-09-02 14:40:00",
    "start_time": "14:40",
    "is_fave": false,
    "venue": "Workshop 1",
    "conversation_id": "CON-84c9f1e8-b1b0-4750-976b-3997e352e178",
    "member_id": "MEM-532d6a11-377d-414a-b44c-3999d7178140"
  },
  {
    "description": "A hit at Electromagnetic Field 2016, this dazzling, surprising, hilarious and sometimes utterly bonkers animation made in three different styles interprets an ancient Indian story with a unique 1920s jazz soundtrack.\r\n\r\nSita is a Hindu goddess, the leading lady of India’s epic The Ramayana and a dutiful wife who follows her husband Rama on a 14 year exile to a forest, only to be kidnapped by an evil king from Sri Lanka. Nina (the filmmaker Nina Paley herself) is an artist who finds parallels in Sita’s life when her husband, in India on a work project, decides to break up their marriage and dump her via email. Three hilarious Indonesian shadow puppets narrate both the ancient tragedy and modern comedy in this beautifully animated interpretation of the epic.\r\n\r\nContains flashing images. May be unsuitable for younger children.",
    "title": "Sita Sings The Blues - Back by popular demand!",
    "map_link": null,
    "latlon": null,
    "speaker": "EMF Film Festival",
    "end_date": "2018-09-03 00:00:00",
    "source": "database",
    "end_time": "00:00",
    "type": "performance",
    "slug": "sita-sings-the-blues-back-by-popular-demand",
    "id": 536,
    "link": "https://www.emfcamp.org/line-up/2018/536",
    "user_id": 282,
    "may_record": false,
    "start_date": "2018-09-02 22:30:00",
    "start_time": "22:30",
    "is_fave": false,
    "venue": "Stage C",
    "conversation_id": "CON-9c2aefeb-e1ba-400d-b14a-755ec0f7f6b0",
    "member_id": "MEM-04795702-080e-409b-b929-21733d2460b8"
  },
  {
    "description": "Most people know that you can have your ashes launched into space, or made into a diamond once you’ve been cremated, but being cremated is far from your only option. From alkaline hydrolysis to freeze-drying, there are many (legal) ways to dispose of a body. Whether you want to nourish fungi, roses, a coral reef or the minds of trainee doctors, your remains could make the world a better place. Why be scattered, when you can leave behind something way more interesting?\r\n\r\nThis session will look at what actually happens in a crematorium and a burial (both traditional and green) as well as some of the more unusual alternatives that are now available to dispose of a body and the controversies that surround them.\r\n\r\nPlease note: if you just can’t live with your spouse any more, or you have a life-long vendetta against someone, this session won’t help you get that sorted out. Seek counselling. Buy a pet. Get out more. But don’t kill them.\r\n",
    "title": "How to dispose of a body: a dead interesting talk",
    "map_link": null,
    "latlon": null,
    "speaker": "Sophie Lovejoy",
    "end_date": "2018-09-02 15:50:00",
    "source": "database",
    "end_time": "15:50",
    "type": "talk",
    "slug": "how-to-dispose-of-a-body-a-dead-interesting-talk",
    "id": 141,
    "link": "https://www.emfcamp.org/line-up/2018/141",
    "user_id": 427,
    "may_record": true,
    "start_date": "2018-09-02 15:20:00",
    "start_time": "15:20",
    "is_fave": false,
    "venue": "Stage A",
    "conversation_id": "CON-82dc39d8-4ea2-49d1-b074-d514a506f7b1",
    "member_id": "MEM-64083d63-b53c-4618-9538-1451a66d02a9"
  },
  {
    "description": "I've designed a series of PCB modules that can be wired in series to form wearable circuits: necklaces, bracelets, or even epaulets and other accessories.\r\nEach small PCB has solderable pads for large SMD or through-hole components – including LEDs, resistors, coin battery holders, and so forth.\r\nEach holds one component, except for a few which are decorative (such as LED diffusers), and I plan to expand with more.\r\nThe PCBs also include strain-relief features; they are connected with wires to form \"ropes\" of circuitry, supported by a braided hemp sheath.\r\n\r\nThe project expands on a current trend in approachable tech: enabling people to build circuits with crafts such as stickers (Chibitronics), painting (Bare Conductive), and Lego (Crazy Circuits / Leguino). I want to do the same with jewelry-making.\r\n\r\nI'll have some prototypes and demos, and I'd like to talk about how to use them, how they help me visualize the flow of electricity, and how to contribute. I'll also bring a few kits to give out! ",
    "title": "Open-Source Modular Tech Jewelry",
    "map_link": null,
    "latlon": null,
    "speaker": "merlin",
    "end_date": "2018-09-02 13:40:00",
    "source": "database",
    "end_time": "13:40",
    "type": "talk",
    "slug": "open-source-modular-tech-jewelry",
    "id": 276,
    "link": "https://www.emfcamp.org/line-up/2018/276",
    "user_id": 1262,
    "may_record": true,
    "start_date": "2018-09-02 13:10:00",
    "start_time": "13:10",
    "is_fave": false,
    "venue": "Stage B",
    "conversation_id": "CON-452b227c-eb00-4b43-bbe5-43992b753abf",
    "member_id": "MEM-ef385078-77ea-4947-99b7-284b0b7b7994"
  },
  {
    "description": "Along with my friend Sawn, I run a Youtube channel where we build kids' invention ideas. From jam firing rockets to flaming pianos, from the last year and a half we have brought to life a different kids' invention ever month. We never know what we are building or what might go wrong until the last minute, so we've learnt to embrace failure, not take ourselves too seriously and cause havoc in public places. I talk about the five things I’ve learnt from this that I think all us makers should remember.",
    "title": "5 things we can all learn from Flaming Pianos ",
    "map_link": null,
    "latlon": null,
    "speaker": "Ruth Amos",
    "end_date": "2018-09-01 17:00:00",
    "source": "database",
    "end_time": "17:00",
    "type": "talk",
    "slug": "5-things-we-can-all-learn-from-flaming-pianos",
    "id": 478,
    "link": "https://www.emfcamp.org/line-up/2018/478",
    "user_id": 1520,
    "may_record": true,
    "start_date": "2018-09-01 16:30:00",
    "start_time": "16:30",
    "is_fave": false,
    "venue": "Stage A",
    "conversation_id": "CON-e5de873e-c37c-4921-abac-b3c292bb860e",
    "member_id": "MEM-88ad154a-ab8c-4fe9-9492-c071ccd7168c"
  },
  {
    "age_range": "6+ with adult supervision",
    "cost": "£5",
    "description": "Build a simple solid-fuelled model rocket from scratch!\r\n\r\nWe'll provide card templates and all required materials, you cut and stick the rocket together and then decorate it to taste.\r\n\r\nAssembling the rocket is straightforward and as they're all made from white card/paper there are plenty of options for decoration or modification. We'll provide some stickers, felt tips, glitter, etc, but feel free to bring your own too!\r\n\r\nSuitable for young children with some supervision. The build involves mostly scissors and tape, one step involves hot glue which requires adult supervision. Feel free to contact us beforehand if you want to check suitability: emf@adamgreig.com / extension 2440.\r\n\r\nThis workshop is also running as a main workshop on Saturday if you can't attend the youth workshop on Friday.",
    "title": "Build a rocket",
    "map_link": null,
    "latlon": null,
    "equipment": "",
    "speaker": "Adam Greig",
    "end_date": "2018-08-31 17:30:00",
    "source": "database",
    "end_time": "17:30",
    "type": "youthworkshop",
    "slug": "build-a-rocket",
    "id": 519,
    "link": "https://www.emfcamp.org/line-up/2018/519",
    "user_id": 129,
    "may_record": false,
    "start_date": "2018-08-31 16:30:00",
    "start_time": "16:30",
    "is_fave": false,
    "venue": "Youth Workshop",
    "conversation_id": "CON-37fa1510-c672-41af-8689-931278c1954c",
    "member_id": "MEM-a2c477cf-ea8a-4c92-93f0-3c757824cde5"
  },
  {
    "description": "There is a penis museum, but no vagina equivalent. There's only one way to change that: Make one. Join the Vagina Museum as they talk about why we need one, their experiences researching vaginas, vulvas and all parts related, what would go in a museum about the gynaecological anatomy and the wonderful and strange reactions encountered whilst making the world's first physical vagina museum.\r\n\r\nThe museum will have four permanent galleries: science, culture, society and history. The science section will cover topics from the anatomy to health, menstruation to menopause, contraception to consent, sexuality to gender identity. The culture collection will showcase the anatomy in the arts and their contribution to the discourse about our genitals, for example The Great Wall of Vagina or The Handmaid’s Tale. The society gallery will explore genitals’ place in society, e.g. religious rites surrounding menstruation, the practises of FGM, of which over 200 million people are living today suffering from, sexual violence and how these cases are dealt with in court. The history gallery will contain objects relating to the history of gynaecological medicine, contraception, menstrual products and sex work.",
    "title": "Why The World Needs A Vagina Museum",
    "map_link": null,
    "latlon": null,
    "speaker": "Florence Schechter",
    "end_date": "2018-08-31 18:00:00",
    "source": "database",
    "end_time": "18:00",
    "type": "talk",
    "slug": "why-the-world-needs-a-vagina-museum",
    "id": 94,
    "link": "https://www.emfcamp.org/line-up/2018/94",
    "user_id": 491,
    "may_record": true,
    "start_date": "2018-08-31 17:20:00",
    "start_time": "17:20",
    "is_fave": false,
    "venue": "Stage C",
    "conversation_id": "CON-b23f8a32-aa27-4219-b6b9-c2fc0774568c",
    "member_id": "MEM-54fbf22c-8ff4-4949-93f5-a31acf251754"
  },
  {
    "description": "A talk on helping new beekeepers start up in urban environments.\r\n\r\nThe talk will include location selection, equipment choice, purchasing bees, an introduction to local and national associations, the legality of keeping bees, the difference between urban and rural beekeeping, the costs associated with the hobby and a walkthrough of the first year and what to expect.\r\n\r\n",
    "title": "Urban Beekeeping: How to get started",
    "map_link": null,
    "latlon": null,
    "speaker": "Henry Sands",
    "end_date": "2018-09-01 13:20:00",
    "source": "database",
    "end_time": "13:20",
    "type": "talk",
    "slug": "urban-beekeeping-how-to-get-started",
    "id": 62,
    "link": "https://www.emfcamp.org/line-up/2018/62",
    "user_id": 326,
    "may_record": true,
    "start_date": "2018-09-01 12:40:00",
    "start_time": "12:40",
    "is_fave": false,
    "venue": "Stage A",
    "conversation_id": "CON-d7bb5ced-dc2f-4408-a1bb-983d69ee868f",
    "member_id": "MEM-d660a9f2-e3ab-46d2-bed7-bac309e10f5c"
  },
  {
    "description": "As Pi Wars approaches its 5th year, we want to tell you why and how we put on a two day competitive event that challenges teams of school children, their teachers, families and adults to make robots. The robots are all built with the Raspberry Pi as the main controller, but apart from a size limit, teams can do whatever they like.  And what they do even surprises us! Come and find out how robots are more than just radio controlled cars; they are art and engineering combined! ",
    "title": "Pi Wars - Challenging kids (and adults) to build competitive robots",
    "map_link": null,
    "latlon": null,
    "speaker": "GeekyTim",
    "end_date": "2018-08-31 13:30:00",
    "source": "database",
    "end_time": "13:30",
    "type": "talk",
    "slug": "pi-wars-challenging-kids-and-adults-to-build-competitive",
    "id": 154,
    "link": "https://www.emfcamp.org/line-up/2018/154",
    "user_id": 572,
    "may_record": true,
    "start_date": "2018-08-31 13:00:00",
    "start_time": "13:00",
    "is_fave": false,
    "venue": "Stage B",
    "conversation_id": "CON-217f44e5-a617-4b12-a781-34045b92e73e",
    "member_id": "MEM-96dcc985-66e5-4275-90b0-8e28ad864502"
  },
  {
    "description": "Ever wondered how the chips in your electronic devices are designed and fabricated? This talk looks at chip fabrication technologies, the process of designing, vaildating and testing analog, digital and mixed-signal chips. Several chip design projects the speaker has worked on, including prototype miniaturised capsules for fluorescence and ultrasound imaging within the human intestine, are also covered.\r\n",
    "title": "Designing Custom Chips and Sensors and Lab-in-a-Pill Technology",
    "map_link": null,
    "latlon": null,
    "speaker": "Dr. James Beeley",
    "end_date": "2018-08-31 15:50:00",
    "source": "database",
    "end_time": "15:50",
    "type": "talk",
    "slug": "designing-custom-chips-and-sensors",
    "id": 70,
    "link": "https://www.emfcamp.org/line-up/2018/70",
    "user_id": 343,
    "may_record": true,
    "start_date": "2018-08-31 15:20:00",
    "start_time": "15:20",
    "is_fave": false,
    "venue": "Stage C",
    "conversation_id": "CON-0d6c8bdb-a9c8-4422-bcdf-7adc8ff9a512",
    "member_id": "MEM-82e3a585-d23e-407a-a176-29b9a8ac1d5f"
  },
  {
    "description": "During my PhD, I spent my free time building an InMoov, which is a life-size 3D printed humanoid robot. I tweaked the original designs a bit to make it run on the Robot Operating System (ROS) and added a powered wheelchair base to give it mobility. Kermit, as it was named by the first human who saw it, now lives in fizzPOP in Birmingham and aspires to be the world's first 3D printed robot butler*.\r\n\r\nIn this talk, I'll present the story and future plans for Kermit as a how to guide to printing the robot's mechanisms, choosing actuators, and adapting a powered wheeled base to give the robot mobility. I will also talk about using ROS to operate the robot, enable it to perceive the environment and navigate autonomously, and execute useful tasks.",
    "title": "How to make a humanoid using a 3D printer, wheelchair, and ROS!",
    "map_link": null,
    "latlon": null,
    "speaker": "Muhammad Sayed",
    "end_date": "2018-08-31 19:20:00",
    "source": "database",
    "end_time": "19:20",
    "type": "talk",
    "slug": "how-to-make-a-humanoid-using-a-3d-printer-wheelchair-and-ros",
    "id": 455,
    "link": "https://www.emfcamp.org/line-up/2018/455",
    "user_id": 1475,
    "may_record": true,
    "start_date": "2018-08-31 18:50:00",
    "start_time": "18:50",
    "is_fave": false,
    "venue": "Stage C",
    "conversation_id": "CON-9f59c62e-6988-4680-abae-ac72e6a40f2a",
    "member_id": "MEM-3e58a349-0b04-48e9-af8a-a454396718a6"
  },
  {
    "description": "Quick <10min talks, on anything, from anybody who would like to get on the stage!\r\n\r\nIf you'd like to give a lightning talk, please email lightning@emfcamp.org, or try your luck and show up to a session.",
    "title": "Lightning Talks Saturday",
    "map_link": null,
    "latlon": null,
    "speaker": "Lightning Talks",
    "end_date": "2018-09-01 12:50:00",
    "source": "database",
    "end_time": "12:50",
    "type": "talk",
    "slug": "lightning-talks-saturday",
    "id": 484,
    "link": "https://www.emfcamp.org/line-up/2018/484",
    "user_id": 282,
    "may_record": true,
    "start_date": "2018-09-01 11:50:00",
    "start_time": "11:50",
    "is_fave": false,
    "venue": "Stage B",
    "conversation_id": "CON-d670cb6d-6bd9-416e-95bf-fdf9cb58e0fe",
    "member_id": "MEM-210e2728-bd57-453e-b2ed-2b39edc5a48d"
  },
  {
    "description": "Furby is a cute little guy, but what exactly is going on beneath that lurid neon fluff? In this talk, we'll take you on a deep dive into IoT reverse engineering, walking you through the story of our work on the Furby Connect, and offering up a set of broadly-applicable reversing tips and approaches that you can try out against your favourite toy or embedded device. We'll also demonstrate live how you can use your smartphone to hijack the update mechanism of your Furby (or your friend's!) and take control of its audio and video playback at range.\r\n\r\n",
    "title": "Don't Feed Them After Midnight: Reverse-Engineering the Furby Connect",
    "map_link": null,
    "latlon": null,
    "speaker": "Ed Locard",
    "end_date": "2018-09-01 11:10:00",
    "source": "database",
    "end_time": "11:10",
    "type": "talk",
    "slug": "dont-feed-them-after-midnight",
    "id": 111,
    "link": "https://www.emfcamp.org/line-up/2018/111",
    "user_id": 530,
    "may_record": true,
    "start_date": "2018-09-01 10:30:00",
    "start_time": "10:30",
    "is_fave": false,
    "venue": "Stage A",
    "conversation_id": "CON-b4fd4c15-a556-4e21-b404-653717f0dfc5",
    "member_id": "MEM-2c561948-e720-42fa-a0be-9f5951fa70f9"
  },
  {
    "description": "Come to Stage A this Saturday night to hangout and play multiplayer games on the big screen. We're going to to put on a selection of games and create a small space where people can sit down, chill out, watch and play some games.\r\n\r\nThere will be tables and seats for those who want to bring their boardgames too!",
    "title": "Multiplayer Indie Computer and Board Games",
    "map_link": null,
    "latlon": null,
    "speaker": "Indie Games",
    "end_date": "2018-09-02 01:00:00",
    "source": "database",
    "end_time": "01:00",
    "type": "performance",
    "slug": "multiplayer-indie-computer-and-board-games",
    "id": 527,
    "link": "https://www.emfcamp.org/line-up/2018/527",
    "user_id": 7,
    "may_record": false,
    "start_date": "2018-09-01 22:00:00",
    "start_time": "22:00",
    "is_fave": false,
    "venue": "Stage A",
    "conversation_id": "CON-9e8cd21a-f91e-4a36-8090-380e0977b9bc",
    "member_id": "MEM-06207e07-8f94-4e63-b535-f84c44f2914b"
  },
  {
    "description": "This talk is about an Open Source robot version of me that I use instead of commuting. It uses web technologies and cheap, off the shelf hardware to give good quality audio and video, and also allows me to move around a bit. It's particularly good for small meetings where manifesting in a laptop or phone doesn't give me enough physical presence to participate fully. \r\n\r\nI'll run through the technologies involved, the advantages and pitfalls of using one, and some of the 10 experiments and mistakes that have culminated in its current format: an Ikea lamp. I'll also do a demo!",
    "title": "A cheap, remotely posable presence robot using a Raspberry Pi, webRTC and a few servos",
    "map_link": null,
    "latlon": null,
    "speaker": "Libby Miller",
    "end_date": "2018-08-31 13:20:00",
    "source": "database",
    "end_time": "13:20",
    "type": "talk",
    "slug": "a-cheap-remotely-posable-presence-robot-using-a-raspberry-pi",
    "id": 456,
    "link": "https://www.emfcamp.org/line-up/2018/456",
    "user_id": 372,
    "may_record": true,
    "start_date": "2018-08-31 13:00:00",
    "start_time": "13:00",
    "is_fave": false,
    "venue": "Stage A",
    "conversation_id": "CON-e12713ed-90ff-4c93-8b35-371f56f1d48a",
    "member_id": "MEM-be8c43bd-b9d3-4f83-9774-a4b0d5becbf0"
  },
  {
    "description": "Closing Ceremony",
    "title": "Closing Ceremony",
    "map_link": null,
    "latlon": null,
    "speaker": "Jonty Wareing",
    "end_date": "2018-09-02 21:00:00",
    "source": "database",
    "end_time": "21:00",
    "type": "talk",
    "slug": "closing-ceremony",
    "id": 487,
    "link": "https://www.emfcamp.org/line-up/2018/487",
    "user_id": 282,
    "may_record": true,
    "start_date": "2018-09-02 20:30:00",
    "start_time": "20:30",
    "is_fave": false,
    "venue": "Stage A",
    "conversation_id": "CON-634c8420-6d0c-4de0-a564-0dde9363f75b",
    "member_id": "MEM-e55f36d9-4330-43af-9bd6-5fcead1d96cf"
  },
  {
    "description": "LoRaWAN is a long-range and low-power communication system used to connect physical devices to servers. It is a set of physical and logical protocols used to connect ultra low bandwidth devices across a large area.\r\n\r\nThis talk first gives an overview the technology used, why you would use it, and giving some examples of where it is being used today. It then follows the challenges of rolling out a regional LoRaWAN network.\r\n\r\nThis is an accessible technical talk. It contains technical information of interest to those wanting to work with this technology, but it should be understandable by those who are less technical.\r\n\r\nThe speaker has been connecting hardware to the internet for over two decades and is a member of the team rolling out of a regional LoRaWAN network.",
    "title": "Deploying a LoRaWAN network",
    "map_link": null,
    "latlon": null,
    "speaker": "Alistair MacDonald",
    "end_date": "2018-09-02 11:50:00",
    "source": "database",
    "end_time": "11:50",
    "type": "talk",
    "slug": "deploying-a-lorawan-network",
    "id": 463,
    "link": "https://www.emfcamp.org/line-up/2018/463",
    "user_id": 248,
    "may_record": true,
    "start_date": "2018-09-02 11:20:00",
    "start_time": "11:20",
    "is_fave": false,
    "venue": "Stage A",
    "conversation_id": "CON-8102a32d-f176-4770-9690-2b7d0554f130",
    "member_id": "MEM-bd9b8435-69df-41bc-b0b6-86683ddd9371"
  },
  {
    "description": "You’ve heard of smart phones, smart meters, smart watches… even smart fridges. Well now it’s the turn of smart materials.\r\n\r\nThis is a show about the future of stuff. Within our lifetimes, solid objects will react, sense, change and move according to their surroundings. This won’t be a result of fancy robotics or cunning electronics, but rather the fundamental properties of the materials themselves. Inspired by Leonardo da Vinci’s flying machine, drawn over 500 year ago, smart materials will make our aeroplanes of the future adapting, sensing and morphing, so that they fly like birds or bats. In years to come, we will be living in self-regulating houses, riding self-fixing bicycles, and driving on self-illuminating roads, all thanks to smart materials. These are metals, plastics, fabrics and fluids that react to the outside world without any human involvement, and they promise to change the way we live our lives forever.\r\n\r\nIn this one hour show, an award-winning materials scientist and engineer will be your guide on the smart material safari. There will be demonstrations of the smart materials that exist today, and exploration on how they will make the material world around us smarter tomorrow. Expect to see matter doing things you’ve never seen it do before!\r\n",
    "title": "Smart Materials",
    "map_link": null,
    "latlon": null,
    "speaker": "Anna Ploszajski",
    "end_date": "2018-09-02 14:40:00",
    "source": "database",
    "end_time": "14:40",
    "type": "talk",
    "slug": "smart-materials",
    "id": 112,
    "link": "https://www.emfcamp.org/line-up/2018/112",
    "user_id": 535,
    "may_record": true,
    "start_date": "2018-09-02 13:50:00",
    "start_time": "13:50",
    "is_fave": false,
    "venue": "Stage B",
    "conversation_id": "CON-29c4ea47-1c78-4d36-a0a7-0e679f70c902",
    "member_id": "MEM-0fe5d622-2579-4fb5-8f3f-8fa24e706693"
  },
  {
    "description": "Throughout history, music has often been employed as a morale boosting device. From wartime rallying songs to football terraces to \"If you're happy and you know it\", we sing to encourage the troops; to celebrate epic victories; to cheer on our favourite team.\r\n\r\nWhose battles are more epic, whose victories more heroically won than global corporations with enough spare marketing budget to commission their own soundtrack? \r\n\r\nIn this talk I will take my audience through the history of the corporate song, from IBM's rousing classic 1937 songbook \"Songs Of The IBM\" to modern masterpieces such as \"We Built This Starbucks (On Heart And Soul)\" (it's exactly what it sounds like from the title) and \"Symantec Revolution\", hailed by the Observer as \"The worst song in the history of music (with added sinister corporate overtones)\".\r\n\r\nI'll explore a number of different musical styles (or at least, attempts at those styles) and try my best to answer the question, \"Why? Just...why?\"",
    "title": "The Art And Science Of The Motivational Corporate Anthem",
    "map_link": null,
    "latlon": null,
    "speaker": "Kate Tolley",
    "end_date": "2018-09-01 10:20:00",
    "source": "database",
    "end_time": "10:20",
    "type": "talk",
    "slug": "the-art-and-science-of-the-motivational-corporate-anthem",
    "id": 457,
    "link": "https://www.emfcamp.org/line-up/2018/457",
    "user_id": 1476,
    "may_record": true,
    "start_date": "2018-09-01 10:00:00",
    "start_time": "10:00",
    "is_fave": false,
    "venue": "Stage C",
    "conversation_id": "CON-e9f9cc98-9246-4f82-9905-13a56c04ab78",
    "member_id": "MEM-f2c65998-b06f-4339-9244-f44ffcc8be59"
  },
  {
    "description": "An audience interactive event; where willing guinea pigs and unwilling volunteers present an informative, intellectual and light-hearted presentation to a receptive crowd. Unfortunately, they won't see the presentation before they talk about it!\r\n\r\nPowerpoint Karaoke will feature a selection of decks for attendees to present to the crowd, with only a moment to see what they’re about to discuss. The presentations will be interesting, but it can’t be said for sure how informative they may be. \r\n\r\nWith the rise of blockchain cardgames, paper cryptocurrency and washing machines being bricked by ransomware, never has there been a better time for people to take the stage and attempt to convince everyone that they too understand the nonsense on the projector.\r\n\r\nWinners will be rewarded with a suitably terrible trophy for display on their office cubicle of choice, praised highly for their public speaking skills, and potentially get a promotion by listing ‘Ideation and Blue Sky Thinktalking’ on LinkedIn*. (*promotion opportunities not guaranteed)\r\n\r\nPowerpoint Karaoke has a background at many hacker events, so why not come and enjoy a pint and a sensible chuckle?\r\n",
    "title": "Powerpoint Karaoke",
    "map_link": null,
    "latlon": null,
    "speaker": "Adam Froggatt ",
    "end_date": "2018-09-01 21:30:00",
    "source": "database",
    "end_time": "21:30",
    "type": "performance",
    "slug": "powerpoint-karaoke",
    "id": 329,
    "link": "https://www.emfcamp.org/line-up/2018/329",
    "user_id": 196,
    "may_record": false,
    "start_date": "2018-09-01 20:30:00",
    "start_time": "20:30",
    "is_fave": false,
    "venue": "Stage A",
    "conversation_id": "CON-4aeec4ff-5cda-4347-904d-e8cb310607c6",
    "member_id": "MEM-7a010a06-af38-40cf-8ee4-3dc3d3d8071e"
  },
  {
    "description": "HiTag2 is an RFID technology operating at 125KHz. It is distinguished from many others in the same field by its use of 2-way communications for authentication and its use of encryption to protect the data transmissions - the majority of RFID technologies at 125KHz feature no authentication or encryption at all. As a result it has been widely used to provide secure building access and has also been used as the technology that implements car immobilisers.\r\n\r\nIn 2012, academic researchers Roel Verdult, Flavio D. Garcia and Josep Balasch published the seminal paper, ‘Gone in 360 Seconds: Hijacking with Hitag2’ that presented three attacks on the encryption system used in HiTag2. They implemented their attacks on the Proxmark 3 device (an RFID research and hacking tool) and gave several high-profile demonstrations, but didn’t release any of their code or tools. Since then, the forums supporting Proxmark 3 and RFIDler (another RFID hacking tool) have received many requests for implementations of these attacks, but until recently none had been forthcoming. Garcia et al went on to produce a fast correlation attack in the 2016 paper, ‘Lock It and Still Lose It’.\r\n\r\nIn this talk I will explain how HiTag2 RFID works in detail, including the PRNG and the authentication and encryption protocols, and will present my own implementations of the attacks, written for RFIDler and supported by desktop computers. The first attack uses a nonce replay to misuse the integrity protection of the comms in order to allow access to the readable RFID tag pages without needing to know the key. The second, third and fourth attacks use time/memory trade-off brute force, cryptanalytic attacks and a fast correlation attack to recover the key, such that the contents of the read-protected pages can also be accessed. The attacks are weaponised and permit cloning of tags, which I will demonstrate.",
    "title": "Cracking HiTag2 Crypto",
    "map_link": null,
    "latlon": null,
    "speaker": "Kev Sheldrake",
    "end_date": "2018-08-31 18:00:00",
    "source": "database",
    "end_time": "18:00",
    "type": "talk",
    "slug": "cracking-hitag2-crypto",
    "id": 73,
    "link": "https://www.emfcamp.org/line-up/2018/73",
    "user_id": 351,
    "may_record": true,
    "start_date": "2018-08-31 17:10:00",
    "start_time": "17:10",
    "is_fave": false,
    "venue": "Stage B",
    "conversation_id": "CON-4aff983d-139a-4359-97e0-57668a5f9895",
    "member_id": "MEM-98af85a9-ef4f-470d-b01f-44dea664cc55"
  },
  {
    "description": "Have you ever wondered how to make music without buying into the world of commercial software? Are you a musician who wants to get into multitrack recording? Are you an electronic artist looking to build a digital studio? Or just curious about the tools people use to make music?\r\n\r\nThe free and open-source world contains a rich selection of music software, from synths to sequencers, drum machines to DJ decks, MIDI to mastering. Take a tour of this colourful world as we touch on a number of important musical tools and see and hear how they fit together into your toolbox. Whether you're interested in making a recording studio, creating your own digital sounds, performing live or just understanding a bit more about the creative process, there's something here for you.",
    "title": "Making music in the free and open-source world",
    "map_link": null,
    "latlon": null,
    "speaker": "Gavan Fantom",
    "end_date": "2018-09-02 15:20:00",
    "source": "database",
    "end_time": "15:20",
    "type": "talk",
    "slug": "making-music-in-the-free-and-open-source-world",
    "id": 450,
    "link": "https://www.emfcamp.org/line-up/2018/450",
    "user_id": 86,
    "may_record": true,
    "start_date": "2018-09-02 14:50:00",
    "start_time": "14:50",
    "is_fave": false,
    "venue": "Stage B",
    "conversation_id": "CON-e559fc64-f44e-4a96-bab0-18cdfaf434b9",
    "member_id": "MEM-6b17e00c-34f6-4e25-803e-3b1300efdb51"
  },
  {
    "description": "A talk which will appeal to anyone who has an interest in making their own electronic music instruments and noise makers. Starting simply, with creating your own contact mics and spring reverbs, progressing all the way to creating your own midi controllers and fully programmable digital audio effects. The concept is to show you how easy it is to get started (I had no formal electronics background, and just learnt from experimenting) and inspire you to get started making NOISE.\r\n\r\nThe talk will cover my personal journey through DIY instrument building, which I embarked on initially to build a simple item I needed for my live performance, and rapidly spiralled out of control!\r\n\r\nHere are some examples:\r\nhttps://youtu.be/sdTysy3dD84\r\nhttps://youtu.be/gib-URplJxI\r\nhttps://youtu.be/xWpq3soblYY\r\nhttps://youtu.be/5j84GfI8yQM\r\n\r\nAbout the artist:\r\nCutlasses is the solo project of musician and DIY electronic instrument maker, Scott Pitkethly.  \r\n\r\nHe has given a number of of talks on the subject of DIY instrument building, as well as talks on other programming related subjects.  His electronic instruments won the Music Hackspace DIY Instrument award, and have featured on sites such as Hackaday and Create Digital Music. The homemade instruments combine both analogue and digital electronics to manipulate and deconstruct audio.\r\n",
    "title": "Adventures in DIY Electronic Instruments",
    "map_link": null,
    "latlon": null,
    "speaker": "Scott Pitkethly",
    "end_date": "2018-09-01 14:20:00",
    "source": "database",
    "end_time": "14:20",
    "type": "talk",
    "slug": "adventures-in-diy-electronic-instruments",
    "id": 362,
    "link": "https://www.emfcamp.org/line-up/2018/362",
    "user_id": 1334,
    "may_record": true,
    "start_date": "2018-09-01 13:40:00",
    "start_time": "13:40",
    "is_fave": false,
    "venue": "Stage B",
    "conversation_id": "CON-8e97457f-ea94-4a65-b787-dc6cbb25cc65",
    "member_id": "MEM-338ef331-a92d-4f48-86a3-e0f49452cb6f"
  },
  {
    "description": "How can classical ballet be used a medium for computer science theory, digital ethics and visualisation biometric data including EEG? What will the future hold for the human body and communication when we boldly go into space? What ethical consideration must we take to ensure that it is the many who control their personal data?\r\n\r\nWe’ve been making educational, technologically exciting ballets and performance workshops for five years now. As artists we want to do collaborative learning with our audiences, to help them express their own ideas within a collaborative artistic technological framework. It is not just a performance to sit down and watch. Art and performance can break down the traditional barriers to audiences that consider themselves non-technical. We like to release as much of our performance and learning materials as possible as open source.\r\n\r\nOur project is long-running, and has tackled subjects from chronic pain to sorting algorithms. Now we are looking to space, brain hacking, and unashamed futurism. How can we begin to live in the future while increasing accessibility and inclusivity? What are the ethical concerns surrounding things that might seem abstract at first glance - like brainwave data?\r\n\r\nClassical ballet might sound like a strange way to learn about technology, ethics and medicine, but we hope to change the way you think about education/learning. Combining the algorithmic nature of classical ballet with futuristic thinking, breaking down artificial cultural barriers and fostering personal creative ownership for all. \r\n\r\nMay contain duct tape.",
    "title": "The Singularity: dance, digital ethics and datavis",
    "map_link": null,
    "latlon": null,
    "speaker": "Genevieve Smith-Nunes",
    "end_date": "2018-09-02 13:00:00",
    "source": "database",
    "end_time": "13:00",
    "type": "talk",
    "slug": "the-singularity-dance-digital-ethics-and-datavis",
    "id": 216,
    "link": "https://www.emfcamp.org/line-up/2018/216",
    "user_id": 1188,
    "may_record": true,
    "start_date": "2018-09-02 12:30:00",
    "start_time": "12:30",
    "is_fave": false,
    "venue": "Stage C",
    "conversation_id": "CON-49d158fc-1543-4279-b881-61e57da65a97",
    "member_id": "MEM-915ad641-55d4-40b1-9d44-ac5f78357814"
  },
  {
    "description": "Aspiring superstar DJ Lai Power hails from the motor city of Birmingham, UK. Uploading echoes of Chicago/Detroit into your cyberbrain. Future sounds from the ninth dimension. HI-NRG anti-capitalist dance music for the working class.\r\n\r\nhttps://soundcloud.com/laipower",
    "title": "Lai Power",
    "map_link": null,
    "latlon": null,
    "speaker": "Lai Power",
    "end_date": "2018-09-02 00:50:00",
    "source": "database",
    "end_time": "00:50",
    "type": "performance",
    "slug": "lai-power",
    "id": 301,
    "link": "https://www.emfcamp.org/line-up/2018/301",
    "user_id": 1276,
    "may_record": false,
    "start_date": "2018-09-02 00:00:00",
    "start_time": "00:00",
    "is_fave": false,
    "venue": "Stage B",
    "conversation_id": "CON-810fb069-bfbc-4d9a-bc82-2e41af684538",
    "member_id": "MEM-5ae33dfb-2249-42b8-9c89-34bdd7bc796a"
  },
  {
    "description": "Come to Stage A this Sunday night to hangout and play multiplayer games on the big screen. We're going to to put on a selection of games and create a small space where people can sit down, chill out, watch and play some games.\r\n\r\nThere will be tables and seats for those who want to bring their boardgames too!",
    "title": "Multiplayer Indie Computer and Board Games",
    "map_link": null,
    "latlon": null,
    "speaker": "Indie Games",
    "end_date": "2018-09-03 01:00:00",
    "source": "database",
    "end_time": "01:00",
    "type": "performance",
    "slug": "multiplayer-indie-computer-and-board-games",
    "id": 528,
    "link": "https://www.emfcamp.org/line-up/2018/528",
    "user_id": 7,
    "may_record": false,
    "start_date": "2018-09-02 21:30:00",
    "start_time": "21:30",
    "is_fave": false,
    "venue": "Stage A",
    "conversation_id": "CON-2ddfa382-ae29-428c-9215-c836a865cb2f",
    "member_id": "MEM-c5c3bf2d-6967-4b71-8c09-0d3b9e36245d"
  },
  {
    "age_range": "Teens and up.",
    "cost": "£20",
    "description": "Build and use the world's first £20 brain-smartphone interface to enter text on your phone by thinking (well, we're getting there...)! This project drops the cost of brain-computer interfaces by using your smartphone, tin foil and a bathing cap in the hope of doing what Google Cardboard did for VR. We explain the theory (steady-state visually evoked potential) behind the text entry app. Now in eight colours!\r\n\r\nEach icibici workshop is stand-alone: come to one to buy and build your kit; come back to work on the software.\r\n\r\niOS users need to register on Testflight.\r\n\r\nSee https://icibici.github.io/site/ for more details.",
    "title": "icibici workshop: a £20 brain-computer interface for your phone/tablet/etc.",
    "map_link": null,
    "latlon": null,
    "equipment": "Please bring your device (with an audio jack), a pocket knife and a small screwdriver.",
    "speaker": "Colin Rowat",
    "end_date": "2018-08-31 14:20:00",
    "source": "database",
    "end_time": "14:20",
    "type": "workshop",
    "slug": "icibici-workshop-a-20-brain-computer-interface",
    "id": 262,
    "link": "https://www.emfcamp.org/line-up/2018/262",
    "user_id": 1247,
    "may_record": false,
    "start_date": "2018-08-31 13:20:00",
    "start_time": "13:20",
    "is_fave": false,
    "venue": "Workshop 3",
    "conversation_id": "CON-e58f5b69-06ce-4d08-96ef-798616b8aa28",
    "member_id": "MEM-85ab66ab-f7fe-4631-b4f2-8ec581824c03"
  },
  {
    "age_range": "~6 years upwards, reasonably fine motor skills required, cutting tape etc",
    "cost": "None",
    "description": "Learn about electronics by crafting LEDs with card and copper strip. No previous experience of  circuit making required. ",
    "title": "Paper Circuits Workshop",
    "map_link": null,
    "latlon": null,
    "equipment": "None",
    "speaker": "Peter Jackson",
    "end_date": "2018-09-02 16:40:00",
    "source": "database",
    "end_time": "16:40",
    "type": "youthworkshop",
    "slug": "paper-circuits-workshop",
    "id": 395,
    "link": "https://www.emfcamp.org/line-up/2018/395",
    "user_id": 70,
    "may_record": false,
    "start_date": "2018-09-02 15:40:00",
    "start_time": "15:40",
    "is_fave": false,
    "venue": "Youth Workshop",
    "conversation_id": "CON-1a05b094-c961-4af2-9fd7-e35bd1e1e523",
    "member_id": "MEM-af2bdc61-c16f-4ee1-84a4-ee61bf463f59"
  },
  {
    "age_range": "10 - 99",
    "cost": "",
    "description": "This is an introduction to robotica for children age 10 - 15.\r\nWe will start with the basics and end up with a maze, or a line finder.\r\n\r\nWe will try to set up workshop tent our selves, so that throughout the event people can fumble around with the sets.\r\n\r\nAt other hackerevents we also did a contest on the Sunday, where the robot has to follow a parcours, and of course the best robot will win.",
    "title": "Lego Mindstorms workshop",
    "map_link": null,
    "latlon": null,
    "equipment": "None",
    "speaker": "Harm Boertien",
    "end_date": "2018-08-31 20:20:00",
    "source": "database",
    "end_time": "20:20",
    "type": "youthworkshop",
    "slug": "lego-mindstorms-workshop",
    "id": 313,
    "link": "https://www.emfcamp.org/line-up/2018/313",
    "user_id": 1287,
    "may_record": false,
    "start_date": "2018-08-31 17:50:00",
    "start_time": "17:50",
    "is_fave": false,
    "venue": "Youth Workshop",
    "conversation_id": "CON-9b38fede-e805-4a0c-b9fd-5778da1a01c2",
    "member_id": "MEM-e25ff05d-e6e4-41ff-b96a-51da23f96f69"
  },
  {
    "description": "A companion performance to accompany my ‘Adventures in DIY Electronic Instruments’ talk. This semi-improvised ambient performance, composed especially for EMF Camp, will last around 20 minutes, and will be made using only instruments and effects I have built myself. \r\n\r\nThe piece will employ mechanical, contact mic based, noise makers, DIY digital effects running algorithms designed by myself and analogue sound sources and combine them into a mini DIY orchestra, which will serve to demonstrate the nature of my DIY instruments, as well as being an artistic piece in it’s own right.\r\n\r\nHere are some links showing a selection of devices I've built\r\nhttps://youtu.be/sdTysy3dD84\r\nhttps://youtu.be/gib-URplJxI\r\nhttps://youtu.be/xWpq3soblYY\r\nhttps://youtu.be/5j84GfI8yQM\r\n\r\nHere's my website, click Music for streaming links\r\nhttp://www.cutlasses.co.uk\r\n",
    "title": "Adventures in DIY Electronic Instruments - Cutlasses performance",
    "map_link": null,
    "latlon": null,
    "speaker": "Scott Pitkethly",
    "end_date": "2018-09-02 21:20:00",
    "source": "database",
    "end_time": "21:20",
    "type": "performance",
    "slug": "adventures-in-diy-electronic-instruments",
    "id": 482,
    "link": "https://www.emfcamp.org/line-up/2018/482",
    "user_id": 1334,
    "may_record": false,
    "start_date": "2018-09-02 21:00:00",
    "start_time": "21:00",
    "is_fave": false,
    "venue": "Stage B",
    "conversation_id": "CON-0f767a6d-fd3a-4b64-99d1-6288fd839340",
    "member_id": "MEM-a511243f-f850-422b-8c53-74a3726ef689"
  },
  {
    "age_range": "Under 16s should be accompanied",
    "cost": "",
    "description": "Because who doesn't love stationery and making things. It's super easy to get started with making books at home, and there's loads to explore once you get going. Here, we're going to make a simple book using a Japanese 3 hole binding structure. You should come away from the workshop with a book, some basic theory and technique, and some pointers on next projects to think about.\r\n\r\nPlease note: This workshop was delivered at EMF 2016, so if you came last time around you won't find anything new here. I'm also running a Bookbinding and Boxmaking Techniques for Hackers session over the weekend which will cross over heavily with this - probably come to one or the other.",
    "title": "Introduction to Japanese Bookbinding",
    "map_link": null,
    "latlon": null,
    "equipment": "If you have a cutting mat that'd be useful",
    "speaker": "Ben Dornan",
    "end_date": "2018-09-02 17:40:00",
    "source": "database",
    "end_time": "17:40",
    "type": "workshop",
    "slug": "introduction-to-japanese-bookbinding",
    "id": 296,
    "link": "https://www.emfcamp.org/line-up/2018/296",
    "user_id": 50,
    "may_record": false,
    "start_date": "2018-09-02 15:40:00",
    "start_time": "15:40",
    "is_fave": false,
    "venue": "Workshop 3",
    "conversation_id": "CON-3c2eec86-2464-42e9-b865-01a7fe80b91c",
    "member_id": "MEM-95bb7b76-7e58-4a22-ad3b-a65d82a0ff6b"
  },
  {
    "description": "Maybe you've been doing too much for too long. And if you have, there's the very real possibility that this is going to hurt you. Occupational burnout is the too common outcome of extended, seemingly-inescapable stress. In this talk we'll look at the impact of burnout, how to manage your way through it and a potential, unexpected upside. Come along to learn more about burnout, cognitive psychology and all the ways that your brain is (fascinatingly) terrible.",
    "title": "Burnout and Your Meat Computer",
    "map_link": null,
    "latlon": null,
    "speaker": "Jessica Rose",
    "end_date": "2018-09-01 12:30:00",
    "source": "database",
    "end_time": "12:30",
    "type": "talk",
    "slug": "burnout-and-your-meat-computer",
    "id": 38,
    "link": "https://www.emfcamp.org/line-up/2018/38",
    "user_id": 71,
    "may_record": true,
    "start_date": "2018-09-01 12:00:00",
    "start_time": "12:00",
    "is_fave": false,
    "venue": "Stage A",
    "conversation_id": "CON-4afe741b-f2b4-45b1-b973-25a174692e42",
    "member_id": "MEM-7d625ffa-0181-4897-92b5-591f3077afe0"
  },
  {
    "age_range": "9-13",
    "cost": "0 to participate, £20 to take your micro-bit makes and speakers home with you",
    "description": "Learn how to code musical notes and how to play them – by tilting, spinning, shaking or touching the buttons on the micro:bit. Using these new skills, design and make a bit of moveable musical tech that can be controlled with your own body. Inspired by Imogen Heap's mi.mu gloves, we empower individuals to interact with music in ways they've never done before. We will bring makeymakeys, micro:bits, speakers, battery packs, alligator clips, laptops, and any other resources you may need. The micro:bits can be coded using the block editor, javascript, and/or python, and we will bring resources for each. All code will be shared on GitHub.\r\n\r\nThe MyNormal project at ArkT Centre and members of ScienceOxford have collaborated to give a voice to those underrepresented in the music industry. Over several months of workshops, we sought to give disabled youth high quality music and technology opportunities. We will share these results and encourage other youth",
    "title": "Accessible Music Instruments",
    "map_link": null,
    "latlon": null,
    "equipment": "feel free to bring speakers, headphones, or clothes you'd like to integrate speakers into",
    "speaker": "Noelle Aly",
    "end_date": "2018-09-01 20:20:00",
    "source": "database",
    "end_time": "20:20",
    "type": "youthworkshop",
    "slug": "accessible-music-instruments",
    "id": 388,
    "link": "https://www.emfcamp.org/line-up/2018/388",
    "user_id": 1356,
    "may_record": false,
    "start_date": "2018-09-01 18:20:00",
    "start_time": "18:20",
    "is_fave": false,
    "venue": "Youth Workshop",
    "conversation_id": "CON-9ee52755-4df9-4a3c-a8ad-37c59c2a63b1",
    "member_id": "MEM-f5f49baf-5883-423d-81b9-8c443f62700c"
  },
  {
    "age_range": "14+",
    "cost": "£5",
    "description": "Dip your toes into the weird and wonderful world of circuit bending. Opening up old battery powered musical toys and connecting different parts of the circuit to make new noises...and then jamming with them!\r\n\r\n\r\n\r\nI will provide a selection of battery powered noisy toys for participants to experiment with, but they're also welcome to bring their own too. We'll begin with a short introduction, which will also cover a safety briefing (always avoid capacitors) and some top tips e.g Do not bend anything that you are dearly attached to, or is difficult to replace. Usually circuit bending does not harm your targets, but sometimes things go wrong and you might accidentally fry the piece you are working on.\r\n\r\nAfter everybody has the chance to find the noises within the toy we'll all connect up to the PA system and get everybody jamming together - collaborating through music and digital creativity.",
    "title": "Circuit Bending",
    "map_link": null,
    "latlon": null,
    "equipment": "(optional) battery powered noisy toys.",
    "speaker": "Frazer Merrick",
    "end_date": "2018-09-02 20:00:00",
    "source": "database",
    "end_time": "20:00",
    "type": "workshop",
    "slug": "circuit-bending",
    "id": 240,
    "link": "https://www.emfcamp.org/line-up/2018/240",
    "user_id": 1223,
    "may_record": false,
    "start_date": "2018-09-02 18:00:00",
    "start_time": "18:00",
    "is_fave": false,
    "venue": "Workshop 3",
    "conversation_id": "CON-119e1bfc-1452-4090-b82f-9ceceb177cdb",
    "member_id": "MEM-463692ec-2b6a-4b9b-8e38-09d722ae9625"
  },
  {
    "description": "CANUTE, is a multi-line refreshable Braille display. The project has been developed using Bristol Hackspace as a base and workshop facility by Bristol Braille Technology which is a Not For Profit enterprise. We are working on open sourcing elements of the project because having an open source data protocol will expand the avenues for information and equipment it can link into and the information it can display. Currently available displays are one line of text and between 20 and 80 letters long, Canute will be both 9 lines and affordable.\r\n\r\nThe blind community are currently poorly supported with literature as very little is transferred to bulky Braille paper format and this has an impact on literacy and employment and access to modern communication. So much information is displayed 'on the screen' and Text-To-Speech is not always convenient (and is often inconvenient) and is a very different experience to reading. We aim to reverse this with CANUTE which will be the world's first electronic multi-line refreshable Braille display.\r\n\r\nAfter nearly 6 years of development on gifted and sponsored budgets in the corner of a Hackspace using Chinese motors, modules the prototype model has attracted the attention of brailleists and support organisations all over the world. we have spent the last 12 months converting the design from prototype 3D printed parts to use all mass produced parts and injection moulded components which is a process fraught with technical difficulties and problems.\r\n\r\nThere will be machine(s) available to demonstrate during and after the presentation. \r\nhttp://www.bristolbraille.co.uk/ ",
    "title": "CANUTE. Making the worlds first multiline braille reader, an engineers story. ",
    "map_link": null,
    "latlon": null,
    "speaker": "Russell Couper",
    "end_date": "2018-09-02 14:50:00",
    "source": "database",
    "end_time": "14:50",
    "type": "talk",
    "slug": "canute-making-the-worlds-first-multiline-braille-reader",
    "id": 408,
    "link": "https://www.emfcamp.org/line-up/2018/408",
    "user_id": 1389,
    "may_record": true,
    "start_date": "2018-09-02 14:20:00",
    "start_time": "14:20",
    "is_fave": false,
    "venue": "Stage C",
    "conversation_id": "CON-f288551b-0b7b-4a2a-8569-72de1b771de4",
    "member_id": "MEM-20a144ca-cd66-4968-84ae-fb85cf31a3d3"
  },
  {
    "description": "Its difficult to say how many mountains in the world have never been climbed - probably thousands. Breaking new ground is always exciting, whether in mountaineering or mathematics. We'll talk about our experiences making several first ascents of unclimbed peaks in the Indian Himalaya and the Kyrgyz Tien Shan, and some of the surprising similarities to our other lives in research and development. We'll cover some of the specifics of pulling off a climbing trip further afield than the Alps, and also talk generally about big projects in unknown territory.",
    "title": "How to Climb a Mountain.",
    "map_link": null,
    "latlon": null,
    "speaker": "Andy Vine",
    "end_date": "2018-09-02 16:40:00",
    "source": "database",
    "end_time": "16:40",
    "type": "talk",
    "slug": "how-to-climb-a-mountain",
    "id": 176,
    "link": "https://www.emfcamp.org/line-up/2018/176",
    "user_id": 1616,
    "may_record": true,
    "start_date": "2018-09-02 16:10:00",
    "start_time": "16:10",
    "is_fave": false,
    "venue": "Stage B",
    "conversation_id": "CON-983e85f8-5950-4459-b460-07ce6e6d9d66",
    "member_id": "MEM-6a9d2046-7ed1-4bf6-ac41-1931395c242d"
  },
  {
    "age_range": "8 and over",
    "cost": "",
    "description": "Starting with a single sheet of paper, make a triangle, turn it into a hexagon or a star. Learn to make modules from paper and join them to make cubes, dodecahedra, stellated shapes. Learn about the platonic solids, tessellations, and what happens if you try to fit more than six triangles around a point.",
    "title": "Making Maths with Modular Origami",
    "map_link": null,
    "latlon": null,
    "equipment": "0",
    "speaker": "Alison Kiddle",
    "end_date": "2018-09-02 15:20:00",
    "source": "database",
    "end_time": "15:20",
    "type": "youthworkshop",
    "slug": "making-maths-with-modular-origami",
    "id": 170,
    "link": "https://www.emfcamp.org/line-up/2018/170",
    "user_id": 1162,
    "may_record": false,
    "start_date": "2018-09-02 14:20:00",
    "start_time": "14:20",
    "is_fave": false,
    "venue": "Youth Workshop",
    "conversation_id": "CON-1bc636ed-381a-45a4-bba2-1bd851dfd3bd",
    "member_id": "MEM-165d3025-fe19-4166-ad36-5a5c47727698"
  },
  {
    "description": "The show that works like magic to spell bind the audience, make them gasp, gape, wonder and laugh. \r\n\r\nFeaturing all demonstrations,  strange and wonderful noises, levitating objects, flash bang and big sparks and the occasional funny smell, all done with some fantastic and rare equipment. You won't believe your eyes. ",
    "title": "Science Magic...Magic Science",
    "map_link": null,
    "latlon": null,
    "speaker": "Ian B Dunne",
    "end_date": "2018-08-31 15:20:00",
    "source": "database",
    "end_time": "15:20",
    "type": "talk",
    "slug": "science-magic-magic-science",
    "id": 267,
    "link": "https://www.emfcamp.org/line-up/2018/267",
    "user_id": 1251,
    "may_record": true,
    "start_date": "2018-08-31 14:50:00",
    "start_time": "14:50",
    "is_fave": false,
    "venue": "Stage A",
    "conversation_id": "CON-db7281aa-de7d-4a5b-b647-78e0f64058ac",
    "member_id": "MEM-cddb455f-1213-4e40-b296-a9560c77191d"
  },
  {
    "description": "Continuing in the tradition of sonic-fiction, POLYOP fuse live electronic music performance with sci-fi mythologies to create an immersive audio-visual voyage. Follow the omnipotent Creator on his pilgrimage through distant reaches of an alternate polyhedral universe, occupied by psychedelic soundscapes, rhythmical acid entities and uncharted electro artefacts. \r\n\r\nPOLYOP have developed their live show alongside their own open-source visual performance engine 'Hedron'. Their sound fuses the DNA of funk, and electro with techno and modern sound design; whilst the visuals combine sci-fi aesthetics with polyhedral graphics popularised by early 3D graphics engines.\r\n\r\nVids & Projects: \r\nhttp://polyop.uk/\r\n\r\n",
    "title": "The Creator: An Audio-Visual Voyage",
    "map_link": null,
    "latlon": null,
    "speaker": "Polyop",
    "end_date": "2018-09-01 23:50:00",
    "source": "database",
    "end_time": "23:50",
    "type": "performance",
    "slug": "the-creator-an-audio-visual-voyage",
    "id": 41,
    "link": "https://www.emfcamp.org/line-up/2018/41",
    "user_id": 307,
    "may_record": false,
    "start_date": "2018-09-01 23:00:00",
    "start_time": "23:00",
    "is_fave": false,
    "venue": "Stage B",
    "conversation_id": "CON-1c612b85-0128-4bde-b73a-1623a0f56ecd",
    "member_id": "MEM-c0fa2e08-5270-4b00-a9d2-c26ce204a29b"
  },
  {
    "description": "Want to make a movie? Alia Sheikh did, putting together a team at Electromagnetic Field in 2014 to create ‘Tentman’. Tonight, before the premiere of her work, Alia discusses the skills and knowledge she acquired to get started in filmmaking and shares some anecdotes from the Tentman project.",
    "title": "How To Make a Movie at EMF",
    "map_link": null,
    "latlon": null,
    "speaker": "Alia Sheikh",
    "end_date": "2018-08-31 20:40:00",
    "source": "database",
    "end_time": "20:40",
    "type": "talk",
    "slug": "how-to-make-a-movie-at-emf",
    "id": 529,
    "link": "https://www.emfcamp.org/line-up/2018/529",
    "user_id": 282,
    "may_record": true,
    "start_date": "2018-08-31 20:20:00",
    "start_time": "20:20",
    "is_fave": false,
    "venue": "Stage C",
    "conversation_id": "CON-fc536898-2ec6-4423-8494-5d1e39371058",
    "member_id": "MEM-28a875cc-265b-44b3-b5d4-3bbe6f298a73"
  },
  {
    "description": "Opening Ceremony",
    "title": "Opening Ceremony",
    "map_link": null,
    "latlon": null,
    "speaker": "Jonty Wareing",
    "end_date": "2018-08-31 12:50:00",
    "source": "database",
    "end_time": "12:50",
    "type": "talk",
    "slug": "opening-ceremony",
    "id": 486,
    "link": "https://www.emfcamp.org/line-up/2018/486",
    "user_id": 282,
    "may_record": true,
    "start_date": "2018-08-31 12:30:00",
    "start_time": "12:30",
    "is_fave": false,
    "venue": "Stage A",
    "conversation_id": "CON-e9ca300d-f5b7-4fad-b453-05bf935a8d89",
    "member_id": "MEM-7544af7d-fccb-4dc3-8add-35f1ab9c4e59"
  },
  {
    "age_range": "Any - ideally 14+",
    "cost": "",
    "description": "Suitable for complete beginners, this workshop will teach the absolute fundamentals of building web pages with HTML and CSS. By the end, participants will understand enough terminology, theory and application to build a simple standards-compliant website.",
    "title": "Web Design for absolute beginners",
    "map_link": null,
    "latlon": null,
    "equipment": "Laptop",
    "speaker": "Kevin Lewis",
    "end_date": "2018-08-31 20:00:00",
    "source": "database",
    "end_time": "20:00",
    "type": "workshop",
    "slug": "web-design-for-absolute-beginners",
    "id": 187,
    "link": "https://www.emfcamp.org/line-up/2018/187",
    "user_id": 1178,
    "may_record": false,
    "start_date": "2018-08-31 18:00:00",
    "start_time": "18:00",
    "is_fave": false,
    "venue": "Workshop 4",
    "conversation_id": "CON-2355edad-46db-4f9e-b224-3051dc2d6b8a",
    "member_id": "MEM-51e61585-4da0-4906-8b92-361ba3060fce"
  },
  {
    "age_range": "16+",
    "cost": "",
    "description": "If you love Science Fiction, Technology, Model Making, 3D Printing and Design, then this is the perfect workshop for you, and even if you are new to any of these things, its still definitely worth giving it a go!  \r\n\r\nWe will be exploring how Science Fiction can teach us a few things about the creation of new technologies. We will be focusing on the future of 3D Printing, but the process I will guide you through can be applied to anything and everything. This will provide a great opportunity to flex your creative muscles and question how we want to use technology in the future. We will be using a combination of sketching, drawing, sketch modelling, illustrating, doodling…pretty much anything you want to create your 3D Printers of the future.  \r\n\r\nSome materials will be provided for you to rip, tear, cut, stick and glue, but do bring along any materials you think could be useful.",
    "title": "Design Fiction – Using Science Fiction for invention",
    "map_link": null,
    "latlon": null,
    "equipment": "Pens Pencils and any model making materials you like (some will also be provided, but you can never have too many supplies!).",
    "speaker": "Matthew Pilling",
    "end_date": "2018-09-02 20:00:00",
    "source": "database",
    "end_time": "20:00",
    "type": "workshop",
    "slug": "design-fiction-using-science-fiction-for-invention",
    "id": 343,
    "link": "https://www.emfcamp.org/line-up/2018/343",
    "user_id": 1318,
    "may_record": false,
    "start_date": "2018-09-02 17:00:00",
    "start_time": "17:00",
    "is_fave": false,
    "venue": "Workshop 1",
    "conversation_id": "CON-c835a359-841a-480c-b0e7-55715d28c3b5",
    "member_id": "MEM-715127a6-24a9-4629-a1a3-ee76aa3b46eb"
  },
  {
    "age_range": "Ages 8+",
    "cost": "£12",
    "description": "Detect the Electro Magnetic Fields at EMF camp!\r\nYou will build and take away a simple EMF detector with this simple soldering kit.\r\nThe unit included everything you need including case and headphones.\r\nIts also a good workshop to learn to solder.\r\n20 people maximum.",
    "title": "Build a DIY EMF detector",
    "map_link": null,
    "latlon": null,
    "equipment": "Nothing extra needed",
    "speaker": "Matthew Little",
    "end_date": "2018-09-01 12:50:00",
    "source": "database",
    "end_time": "12:50",
    "type": "workshop",
    "slug": "build-a-diy-emf-detector",
    "id": 208,
    "link": "https://www.emfcamp.org/line-up/2018/208",
    "user_id": 408,
    "may_record": false,
    "start_date": "2018-09-01 11:20:00",
    "start_time": "11:20",
    "is_fave": false,
    "venue": "Workshop 3",
    "conversation_id": "CON-b0e83f76-f33f-4242-aa43-0088bf3fe233",
    "member_id": "MEM-da5d1f70-fff0-4ecb-8f13-1756c1d83ecc"
  },
  {
    "description": "The film made at Electromagnetic Field! Meet Tentman, a tent that escapes the bonds of his pegs and roams free to experience EMF first hand. He dances, drinks, flirts with other tents and shares his strong views on mallets. A fun, kid-friendly 30 minute snapshot of the uniqueness that is EMF.\r\n\r\nFrom the director:\r\n\r\nTent. Man. Which is it? Tentman is a film created at Electromagnetic Field 2014/2016 by festival attendees. Written by Pascoe Foxell and directed by Alia Sheikh. Edward Linard (Vikings, Madness in the Method) leads a cast of thousands (EMF attendees) for the world premiere of a film that Jonty has described as \"WTF?\".\r\n\r\nTentman Q&A\r\n\r\nWant to get into filmmaking? Inspired by Tentman? Here’s your chance to put your questions to the makers and cast. Immediately follows the screening.",
    "title": "Tentman: World Premiere",
    "map_link": null,
    "latlon": null,
    "speaker": "EMF Film Festival",
    "end_date": "2018-08-31 21:10:00",
    "source": "database",
    "end_time": "21:10",
    "type": "performance",
    "slug": "tentman-world-premiere",
    "id": 530,
    "link": "https://www.emfcamp.org/line-up/2018/530",
    "user_id": 282,
    "may_record": false,
    "start_date": "2018-08-31 20:40:00",
    "start_time": "20:40",
    "is_fave": false,
    "venue": "Stage C",
    "conversation_id": "CON-e157809f-fb8e-4138-af59-e80201812fae",
    "member_id": "MEM-f412b76f-3444-43fd-9ceb-e7a7b32e6c7a"
  },
  {
    "description": "Murmurmur is a London based producer_beat maker_drummer, with a background in jazz/fusion and experimental art/rock bands. \r\nHis sound is influenced by world music, hip hop, jazz and the electronic scene in general. The music is a \"collage\" of soundscapes, field recordings, vinyls, toys, synths, lo-tech Instruments with a live set powered by drum grooves.",
    "title": "Electronic music + drums",
    "map_link": null,
    "latlon": null,
    "speaker": "murmurmur",
    "end_date": "2018-09-01 22:50:00",
    "source": "database",
    "end_time": "22:50",
    "type": "performance",
    "slug": "electronic-music-drums",
    "id": 411,
    "link": "https://www.emfcamp.org/line-up/2018/411",
    "user_id": 1392,
    "may_record": false,
    "start_date": "2018-09-01 22:00:00",
    "start_time": "22:00",
    "is_fave": false,
    "venue": "Stage B",
    "conversation_id": "CON-a6ec3c79-4b42-4393-9eec-7dc9f14e5616",
    "member_id": "MEM-92963071-ed41-4f9b-9930-aadf21f2f51a"
  },
  {
    "description": "I hacked a domestic knitting machine from the 1980s and turned it into a network printer. I'll show you how I did it using a Raspberry Pi, an Arduino compatible board, Python and a PHP/MySQL web interface. I share my source code. I'll also take you through a brief showcase of what I've done with my printer since automating it, including Stargazing: a knitted tapestry on show for the first time here at EMF!",
    "title": "The Knitting Network Printer",
    "map_link": null,
    "latlon": null,
    "speaker": "Sarah Spencer (aka Simmonds)",
    "end_date": "2018-09-02 11:40:00",
    "source": "database",
    "end_time": "11:40",
    "type": "talk",
    "slug": "the-knitting-network-printer",
    "id": 29,
    "link": "https://www.emfcamp.org/line-up/2018/29",
    "user_id": 298,
    "may_record": true,
    "start_date": "2018-09-02 11:10:00",
    "start_time": "11:10",
    "is_fave": false,
    "venue": "Stage B",
    "conversation_id": "CON-35bbec24-9248-4908-9612-8497a9003258",
    "member_id": "MEM-13bbab78-becb-4fb8-9c37-14995ed1d738"
  },
  {
    "description": "Members of the EMF infrastructure teams (network, power, video, telephony) will give some insight into how we delivered these services this year. We'll explain particularly some of the new challenges faced at Eastnor, and the new services we've delivered, along with sharing some statistics on how they were used. This year we'll also talk about some of the automation we've developed over the last few events to ease our workload and ensure consistency.",
    "title": "EMF 2018 Infrastructure Review",
    "map_link": null,
    "latlon": null,
    "speaker": "David Croft, Will Hargrave",
    "end_date": "2018-09-02 18:40:00",
    "source": "database",
    "end_time": "18:40",
    "type": "talk",
    "slug": "emf-2018-infrastructure-review",
    "id": 71,
    "link": "https://www.emfcamp.org/line-up/2018/71",
    "user_id": 5,
    "may_record": true,
    "start_date": "2018-09-02 17:50:00",
    "start_time": "17:50",
    "is_fave": false,
    "venue": "Stage A",
    "conversation_id": "CON-f223ea28-886e-4ca1-84d3-bbf7dcf7d7a1",
    "member_id": "MEM-e5f119be-a17c-49e8-9b37-e7edcecce74a"
  },
  {
    "description": "2xAA (aka Sam Wray) harnesses the low-fi power of the Nintendo Game Boy and various other portable hardwares to create a flowing electro-house set.",
    "title": "2xAA [electronic music crafted using Game Boys]",
    "map_link": null,
    "latlon": null,
    "speaker": "2xAA",
    "end_date": "2018-09-02 23:20:00",
    "source": "database",
    "end_time": "23:20",
    "type": "performance",
    "slug": "2xaa-electronic-music-crafted-using-game-boys",
    "id": 4,
    "link": "https://www.emfcamp.org/line-up/2018/4",
    "user_id": 285,
    "may_record": false,
    "start_date": "2018-09-02 22:30:00",
    "start_time": "22:30",
    "is_fave": false,
    "venue": "Stage B",
    "conversation_id": "CON-1fb9fba4-e152-48f4-ad65-c478ab49b050",
    "member_id": "MEM-b6fd0312-c4f6-457e-bdc3-13c574b361b4"
  }
]
